#include <iostream>
#include <Windows.h>
#include <thread>
#include <map>
#include <algorithm>
#include <iostream>
#include <cstdlib>
#pragma comment(lib,"winmm.lib")
using namespace std;
HMIDIOUT handle;
enum Scale
{
  Rest = 0, C8 = 108, B7 = 107, A7s = 106, A7 = 105, G7s = 104, G7 = 103, F7s = 102, F7 = 101, E7 = 100,
  D7s = 99, D7 = 98, C7s = 97, C7 = 96, B6 = 95, A6s = 94, A6 = 93, G6s = 92, G6 = 91, F6s = 90, F6 = 89,
  E6 = 88, D6s = 87, D6 = 86, C6s = 85, C6 = 84, B5 = 83, A5s = 82, A5 = 81, G5s = 80, G5 = 79, F5s = 78,
  F5 = 77, E5 = 76, D5s = 75, D5 = 74, C5s = 73, C5 = 72, B4 = 71, A4s = 70, A4 = 69, G4s = 68, G4 = 67,
  F4s = 66, F4 = 65, E4 = 64, D4s = 63, D4 = 62, C4s = 61, C4 = 60, B3 = 59, A3s = 58, A3 = 57, G3s = 56,
  G3 = 55, F3s = 54, F3 = 53, E3 = 52, D3s = 51, D3 = 50, C3s = 49, C3 = 48, B2 = 47, A2s = 46, A2 = 45,
  G2s = 44, G2 = 43, F2s = 42, F2 = 41, E2 = 40, D2s = 39, D2 = 38, C2s = 37, C2 = 36, B1 = 35, A1s = 34,
  A1 = 33, G1s = 32, G1 = 31, F1s = 30, F1 = 29, E1 = 28, D1s = 27, D1 = 26, C1s = 25, C1 = 24, B0 = 23,
  A0s = 22, A0 = 21,
};
enum Voice
{
  X1 = C2, X2 = D2, X3 = E2, X4 = F2, X5 = G2, X6 = A2, X7 = B2,
  L1 = C3, L2 = D3, L3 = E3, L4 = F3, L5 = G3, L6 = A3, L7 = B3,
  M1 = C4, M2 = D4, M3 = E4, M4 = F4, M5 = G4, M6 = A4, M7 = B4,
  H1 = C5, H2 = D5, H3 = E5, H4 = F5, H5 = G5, H6 = A5, H7 = B5,
  LOW_SPEED = 500, MIDDLE_SPEED = 400, HIGH_SPEED = 300,
  _ = 0XFF,Y1= C6, Y2= D6, Y3= E6, Y4= F6, Y5 = G6, Y6 = A6, Y7 = B6,PA = 100000001,R = 1009,s = 1013,P = 1019, S = 1013,
  _4 = 0XFF, _8 = 0XFE, _16 = 0XFD, _20 = 0XFC, _24 = 0XFB, _32 = 0XFA, _2 = 0XF9
};
enum Guitar_Frets
{
  // 吉他指板对应的音高
  G10 = 64, G11 = 65, G12 = 66, G13 = 67, G14 = 68, G15 = 69, G16 = 70, G17 = 71, G18 = 72, G19 = 73, G110 = 74, G111 = 75, G112 = 76, G113 = 77, G114 = 78, G115 = 79, G116 = 80, G117 = 81, G118 = 82, G119 = 83,
  G20 = 59, G21 = 60, G22 = 61, G23 = 62, G24 = 63, G25 = 64, G26 = 65, G27 = 66, G28 = 67, G29 = 68, G210 = 69, G211 = 70, G212 = 71, G213 = 72, G214 = 73, G215 = 74, G216 = 75, G217 = 76, G218 = 77, G219 = 78,
  G30 = 55, G31 = 56, G32 = 57, G33 = 58, G34 = 59, G35 = 60, G36 = 61, G37 = 62, G38 = 63, G39 = 64, G310 = 65, G311 = 66, G312 = 67, G313 = 68, G314 = 69, G315 = 70, G316 = 71, G317 = 72, G318 = 73, G319 = 74,
  G40 = 50, G41 = 51, G42 = 52, G43 = 53, G44 = 54, G45 = 55, G46 = 56, G47 = 57, G48 = 58, G49 = 59, G410 = 60, G411 = 61, G412 = 62, G413 = 63, G414 = 64, G415 = 65, G416 = 66, G417 = 67, G418 = 68, G419 = 69,
  G50 = 45, G51 = 46, G52 = 47, G53 = 48, G54 = 49, G55 = 50, G56 = 51, G57 = 52, G58 = 53, G59 = 54, G510 = 55, G511 = 56, G512 = 57, G513 = 58, G514 = 59, G515 = 60, G516 = 61, G517 = 62, G518 = 63, G519 = 64,
  G60 = 40, G61 = 41, G62 = 42, G63 = 43, G64 = 44, G65 = 45, G66 = 46, G67 = 47, G68 = 48, G69 = 49, G610 = 50, G611 = 51, G612 = 52, G613 = 53, G614 = 54, G615 = 55, G616 = 56, G617 = 57, G618 = 58, G619 = 59
};
enum Bass_Frets
{
  B10 = 43, B11 = 44, B12 = 45, B13 = 46, B14 = 47, B15 = 48, B16 = 49, B17 = 50, B18 = 51, B19 = 52, B110 = 53, B111 = 54, B112 = 55, B113 = 56, B114 = 57, B115 = 58, B116 = 59, B117 = 60, B118 = 61, B119 = 62,
  B20 = 38, B21 = 39, B22 = 40, B23 = 41, B24 = 42, B25 = 43, B26 = 44, B27 = 45, B28 = 46, B29 = 47, B210 = 48, B211 = 49, B212 = 50, B213 = 51, B214 = 52, B215 = 53, B216 = 54, B217 = 55, B218 = 56, B219 = 57,
  B30 = 33, B31 = 34, B32 = 35, B33 = 36, B34 = 37, B35 = 38, B36 = 39, B37 = 40, B38 = 41, B39 = 42, B310 = 43, B311 = 44, B312 = 45, B313 = 46, B314 = 47, B315 = 48, B316 = 49, B317 = 50, B318 = 51, B319 = 52,
  B40 = 28, B41 = 29, B42 = 30, B43 = 31, B44 = 32, B45 = 33, B46 = 34, B47 = 35, B48 = 36, B49 = 37, B410 = 38, B411 = 39, B412 = 40, B413 = 41, B414 = 42, B415 = 43, B416 = 44, B417 = 45, B418 = 46, B419 = 47
};
enum Drum
{
  BS = A2, TH = F3, TM = D3, TL = B3
};
bool pedal  = 0;

//函数原型
void Wind(void);//起风了
void Trivial(void);//平凡之路
void GYZ(void);//孤勇者
void HKTK(void);//海阔天空
void GYDGS(void);//光阴的故事
void QBY(void);//千本樱
void DSHH_Music(void);//花火を打ち上げて
void DSHH_init(void);//花火を打ち上げて初始化
void gzqs(void);//勾指起誓
void BDHT_init(void);//Burn The House Down初始化
void BDHT_Music(void);//Burn The House Down
void QT(void);//晴天
void unravel(void);//unravel
void call_of_silence(void);//call of silence
void HOM(void);//回家
void th(void);//童话
void KQS(void);//喀秋莎
void QCZHQ(void);//青春症候群
void jjdxy(void);//皎洁的笑颜
void Score(void);//火花
void NGC2237(void);//玫瑰星云
void People(void);//落凡尘
void Light(void);//光之黎明
void Star_and_Sea(void);//梦返

int main(void)
{
  int xz;
  cout << "歌单:" << endl
     << "1.起风了" << endl
     << "2.平凡之路" << endl
     << "3.孤勇者" << endl
     << "4.海阔天空" << endl
     << "5.光阴的故事" << endl
     << "6.千本樱" << endl
     << "7.花火を打ち上げて" << endl
     << "8.勾指起誓" << endl
     << "9.Burn The House Down" << endl
     << "10.晴天" << endl
     << "11.unravel" << endl
     << "12.call of silence" << endl
     << "13.回家" << endl
     << "14.童话" << endl
     << "15.喀秋莎" << endl
     << "16.青春症候群" << endl
     << "17.皎洁的笑颜" << endl
     << "18.火花" << endl
     << "19.玫瑰星云" << endl
     << "20.落凡尘" << endl
     << "21.光之黎明" << endl
     << "22.梦返" << endl;
  cout << "请输入你要听的歌曲(输入数字):";
  while (cin >> xz)
  {
    switch (xz)
    {
      case 1:
        Wind();
        //起风了
        break;
      case 2:
        Trivial();
        //平凡之路
        break;
      case 3:
        GYZ();
        // 孤勇者
        break;
      case 4:
        HKTK();
        //海阔天空
        break;
      case 5:
        GYDGS();
        //光阴的故事
        break;
      case 6:
        QBY();
        //千本樱
        break;
      case 7:
        DSHH_init();
        DSHH_Music();
        //花火を打ち上げて
        break;
      case 8:
        gzqs();
        //勾指起誓
        break;
      case 9:
        BDHT_init();
        BDHT_Music();
        //Burn The House Down
        break;
      case 10:
        QT();
        //晴天
        break;
      case 11:
        unravel();
        //unravel
        break;
      case 12:
        call_of_silence();
        //call of silence
        break;
      case 13:
        HOM();
        //回家
        break;
      case 14:
        th();
        //童话
        break;
      case 15:
        KQS();
        //喀秋莎
        break;
      case 16:
        QCZHQ();
        //青春症候群
        break;
      case 17:
        jjdxy();
        //皎洁的笑颜
        break;
      case 18:
        Score();
        //火花
        break;
      case 19:
        NGC2237();
        //玫瑰星云
        break;
      case 20:
        People();
        //落凡尘
        break;
      case 21:
        Light();
        //光之黎明
        break;
      case 22:
        Star_and_Sea();
        //梦返
        break;
      default:
        break;
    }
    cout << "请输入你要听的歌曲(输入数字,输入非数字退出):";
  }
  return 0;
}

// 起风了
void Wind(void)
{
  HMIDIOUT handle;
  midiOutOpen(&handle, 0, 0, 0, CALLBACK_NULL);
  // midiOutShortMsg(handle, 2 << 8 | 0xC0);
  int volume = 0x7f;
  int voice = 0x0;
  int sleep = 350;
  int wind[] =
  {
    400,0,L7,M1,M2,M3,300,L3,0,M5,M3,300,L2,L5,2,_,0,L7,M1,M2,M3,300,L2,0,M5,M3,M2,M3,M1,M2,L7,M1,300,L5,0,L7,M1,M2,M3,300,L3,0,M5,M3,300,L2,L5,2,_,0,L7,M1,M2,M3,300,L2,0,M5,M3,M2,M3,M1,M2,L7,M1,300,L5,
    0,L7,M1,M2,M3,300,L3,0,M5,M3,300,L2,L5,2,_,0,L7,M1,M2,M3,300,L2,0,M5,M3,M2,M3,M1,M2,L7,M1,300,L5,0,L7,M1,M2,M3,300,L3,0,M5,M3,300,L2,L5,2,_,
    0,M6,M3,M2,L6,M3,L6,M2,M3,L6,_,_,_,
    M2,700,0,M1,300,M2,700,0,M1,300,M2,M3,M5,0,M3,700,300,M2,700,0,M1,300,M2,700,0,M1,M2,M3,M2,M1,300,L5,_,
    M2,700,0,M1,300,M2,700,0,M1,300,M2,M3,M5,0,M3,700,300,M2,700,0,M3,300,M2,0,M1,700,300,M2,_,_,_,
    M2,700,0,M1,300,M2,700,0,M1,300,M2,M3,M5,0,M3,700,300,M2,700,0,M3,300,M2,0,M1,700,300,L6,_,
    0,M3,M2,M1,M2,300,M1,_,0,M3,M2,M1,M2,300,M1,700,0,L5,M3,M2,M1,M2,300,M1,_,_,_,
    M1,M2,M3,M1,M6,0,M5,M6,300,_,700,0,M1,300,M7,0,M6,M7,300,_,_,M7,0,M6,M7,300,_,M3,0,H1,H2,H1,M7,300,M6,M5,M6,0,M5,M6,_,M5,M6,M5,300,M6,0,M5,M2,300,_,0,M5,700,300,M3,_,_,_,
    M1,M2,M3,M1,M6,0,M5,M6,300,_,700,0,M1,300,M7,0,M6,M7,300,_,_,M7,0,M6,M7,300,_,M3,0,H1,H2,H1,M7,300,M6,M5,M6,0,H3,H3,300,_,M5,M6,0,H3,H3,300,_,0,M5,700,300,M6,_,_,_,_,_,
    H1,H2,H3,0,H6,H5,300,_,0,H6,H5,300,_,0,H6,H5,300,_,0,H2,H3,300,H3,0,H6,H5,300,_,0,H6,H5,300,_,0,H6,H5,300,_,0,H2,H3,300,H2,0,H1,M6,300,_,0,H1,H1,300,H2,0,H1,300,M6,700,0,_,300,H1,700,H3,_,0,H3,H4,H3,H2,H3,300,H2,700,
    H1,H2,H3,0,H6,H5,_,H6,H5,_,H6,H5,300,_,H3,H3,0,H6,H5,_,H6,H5,_,H6,H5,700,300,H3,700,H2,0,H1,M6,700,300,
    H3,700,H2,0,H1,300,M6,700,H1,H1,_,_,_,_,_,
    0,M6,300,H3,700,H2,0,H1,M6,700,300,H3,H2,700,300,0,H1,M6,300,700,H1,H1,_,_,
    0,L7,M1,M2,M3,300,L3,0,M5,M3,300,L2,L5,2,_,0,L7,M1,M2,M3,300,L2,0,M5,M3,M2,M3,M1,M2,L7,M1,300,L5,0,L7,M1,M2,M3,300,L3,0,M5,M3,300,L2,L5,2,_,
    0,M6,M3,M2,L6,M3,L6,M2,M3,L6,_,_,_,
    M2,700,0,M1,300,M2,700,0,M1,300,M2,M3,M5,0,M3,700,300,M2,700,0,M1,300,M2,700,0,M1,M2,M3,M2,M1,300,L5,_,
    M2,700,0,M1,300,M2,700,0,M1,300,M2,M3,M5,0,M3,700,300,M2,700,0,M3,300,M2,0,M1,700,300,M2,_,_,_,
    M2,700,0,M1,300,M2,700,0,M1,300,M2,M3,M5,0,M3,700,300,M2,700,0,M3,300,M2,0,M1,700,300,L6,_,
    0,M3,M2,M1,M2,300,M1,_,0,M3,M2,M1,M2,300,M1,700,0,L5,M3,M2,M1,M2,300,M1,_,_,_,
    M1,M2,M3,M1,M6,0,M5,M6,300,_,700,0,M1,300,M7,0,M6,M7,300,_,_,M7,0,M6,M7,300,_,M3,0,H1,H2,H1,M7,300,M6,M5,M6,0,M5,M6,_,M5,M6,M5,300,M6,0,M5,M2,300,_,0,M5,700,300,M3,_,_,_,
    M1,M2,M3,M1,M6,0,M5,M6,300,_,700,0,M1,300,M7,0,M6,M7,300,_,_,M7,0,M6,M7,300,_,M3,0,H1,H2,H1,M7,300,M6,M5,M6,0,H3,H3,300,_,M5,M6,0,H3,H3,300,_,0,M5,700,300,M6,_,_,_,_,_,
    H1,H2,H3,0,H6,H5,300,_,0,H6,H5,300,_,0,H6,H5,300,_,0,H2,H3,300,H3,0,H6,H5,300,_,0,H6,H5,300,_,0,H6,H5,300,_,0,H2,H3,300,H2,0,H1,M6,300,_,0,H1,H1,300,H2,0,H1,300,M6,700,0,_,300,H1,700,H3,_,0,H3,H4,H3,H2,H3,300,H2,700,
    H1,H2,H3,0,H6,H5,_,H6,H5,_,H6,H5,300,_,H3,H3,0,H6,H5,_,H6,H5,_,H6,H5,700,300,H3,700,H2,0,H1,M6,700,300,
    H3,700,H2,0,H1,300,M6,700,H1,H1,_,_,_,_,_,
    H1,H2,H3,0,H6,H5,300,_,0,H6,H5,300,_,0,H6,H5,300,_,0,H2,H3,300,H3,0,H6,H5,300,_,0,H6,H5,300,_,0,H6,H5,300,_,0,H2,H3,300,H2,0,H1,M6,300,_,0,H1,H1,300,H2,0,H1,300,M6,700,0,_,300,H1,700,H3,_,0,H3,H4,H3,H2,H3,300,H2,700,
    H2,H3,0,H6,H5,_,H6,H5,_,H6,H5,300,_,H3,H3,0,H6,H5,_,H6,H5,_,H6,H5,700,300,H3,700,H2,0,H1,M6,700,300,
    H3,700,H2,0,H1,300,M6,700,H1,H1,_,_,_,_,_,
    H1,H2,H3,0,H6,H5,300,_,0,H6,H5,300,_,0,H6,H5,300,_,0,H2,H3,300,H3,0,H6,H5,300,_,0,H6,H5,300,_,0,H6,H5,300,_,0,H2,H3,300,H2,0,H1,M6,300,_,0,H1,H1,300,H2,0,H1,300,M6,700,0,_,300,H1,700,H3,_,0,H3,H4,H3,H2,H3,300,H2,700,
    H1,H2,H3,0,H6,H5,_,H6,H5,_,H6,H5,300,_,H3,H3,0,H6,H5,_,H6,H5,_,H6,H5,700,300,H3,700,H2,0,H1,M6,700,300,
    H3,700,H2,0,H1,300,M6,700,H1,H1,_,_,_,_,_,
    0,M6,300,H3,700,H2,0,H1,M6,700,300,H3,H2,700,300,0,H1,M6,300,700,H1,H1,_,_,_,_,_,_,_,
  };

  for (auto i : wind)
  {
    switch (i)
    {
      case 0:
        sleep = 175;
        continue;
      case 700:
        Sleep(175);
        continue;
      case 300:
        sleep = 350;
        continue;
      case 0XFF:
        Sleep(350);
        continue;
    }
    // if (i == 900) volume += 100;
    voice = (volume << 16) + ((i) << 8) + 0x90;
    midiOutShortMsg(handle, voice);
    Sleep(sleep);// midiOutShortMsg(handle, 0x7BB0);
  }
  midiOutClose(handle);
}
// 平凡之路
void Trivial(void)
{
  midiOutOpen(&handle, 0, 0, 0, CALLBACK_NULL);
  int volume = 0x7f;
  int voice = 0x0;
  int sleep = 300;
  int trivial[] =
  {
     MIDDLE_SPEED, X6,L6,M3,M1,M1,L4,M4,M1,X1,L5,M3,M1,L7,M1,M2,L5,X6,L6,M3,M1,M1,L4,M4,M1,X1,L5,M3,M1,L7,M1,M2,L5,_,_,
     400,M3,M3,0,M6,M6,_,_,400,M1,M2,0,M3,M3,_,400,_,_,_,_,_,_,_,_,M3,M3,0,M6,M6,_,_,400,_,M5,M5,M4,M3,_,_,_,_,_,_,_,_,
     M3,M3,M6,_,M1,M2,M3,_,_,_,_,_,_,_,M3,M3,M1,M4,0,M4,M4,_,400,M3,M1,_,_,_,
     400,M3,M3,0,M6,M6,_,_,400,M1,M2,0,M3,M3,_,400,_,_,_,_,_,_,_,_,M3,M3,0,M6,M6,_,_,400,_,M5,M5,M4,M3,_,_,_,_,_,_,_,_,
     M3,M3,M6,_,M1,M2,M3,_,_,_,_,_,_,_,M3,M3,M1,M4,0,M4,M4,_,400,M3,M1,_,_,_,_,_,
     M5,M6,M7,H1,0,M7,H1,_,M5,300,M6,M6,_,M5,0,M4,M3,_,300,M3,M3,0,M3,M2,_,300,M5,M6,M7,H1,0,M7,H1,_,M5,300,M6,M6,_,M6,0,H1,H1,_,300,H1,H1,0,H1,H2,_,M5,300,
     M6,M7,H1,0,M7,H1,_,H3,700,H6,700,H5,_,H4,H3,_,H3,H2,_,
     M6,700,M7,H1,_,700,H1,0,H2,H1,_,H1,M7,300,H1,0,H2,_,H1,700,M7,H1,_,_,_,
     400,M3,M3,0,M6,M6,_,_,400,M1,M2,0,M3,M3,_,400,_,_,_,_,_,_,_,_,M3,M3,0,M6,M6,_,_,400,_,M5,M5,M4,M3,_,_,_,_,_,_,_,_,
     M3,M3,M6,_,M1,M2,M3,_,_,_,_,_,_,_,M3,M3,M1,M4,0,M4,M4,_,400,M3,M1,_,_,_,_,_,
     M5,M6,M7,H1,0,M7,H1,_,M5,300,M6,M6,_,M5,0,M4,M3,_,300,M3,M3,0,M3,M2,_,300,M5,M6,M7,H1,0,M7,H1,_,M5,300,M6,M6,_,M6,0,H1,H1,_,300,H1,H1,0,H1,H2,_,M5,300,M6,M7,H1,0,M7,H1,_,H3,700,H6,700,H5,_,H4,H3,_,H3,H2,_,
     M6,700,M7,H1,_,700,H1,0,H2,H1,_,H1,M7,300,H1,0,H2,_,H1,700,M7,H1,_,_,_,
     M5,0,L7,M1,_,_,L7,300,M1,0,L7,M1,300,L7,L5,M5,0,L7,M1,_,L7,300,M7,0,L6,L7,300,M1,L5,M5,0,L7,M1,_,_,L7,300,M1,0,L7,M1,300,M2,L5,M5,0,L7,M1,_,L7,L7,M1,300,M2,M2,_,
     M5,0,L7,M1,_,_,L7,300,M1,0,L7,M1,300,L7,L5,M5,0,M5,M1,300,M1,700,0,M1,300,L7,0,L6,L7,300,M1,L5,M5,0,L7,M1,_,L7,300,M1,0,M2,M3,300,M4,M3,M1,0,L5,M1,300,M2,0,M1,M2,M2,M3,300,M4,M3,_,
     M5,0,L7,M1,_,_,L7,300,M1,0,L7,M1,300,L7,L5,M5,0,L7,M1,_,_,L7,300,M1,0,L7,M1,300,L7,L5,M5,0,L7,M1,_,_,L7,300,M1,0,L7,L6,300,M2,L5,M5,0,L7,M1,_,L7,L7,M1,300,M2,M2,_,
     M5,0,M2,M3,300,M3,M1,M2,0,M3,M4,300,M6,M5,M5,_,M5,_,M4,0,M3,M2,300,M3,M5,0,L7,M1,_,L7,300,M1,0,M2,M3,300,M4,M3,M4,0,M3,M2,300,M1,0,M5,M1,M2,M3,300,M4,M3,_,
     X6,L6,M3,M1,M1,L4,M4,M1,X1,L5,M3,M1,L7,M1,M2,L5,
     X6,L6,M3,M1,M1,L4,M4,M1,X1,L5,M3,M1,L7,M1,M2,L5,
     X6,L6,M3,M1,M1,L4,M4,M1,X1,L5,M3,M1,L7,M1,M2,L5,
     X6,L6,M3,M1,M1,L4,M4,M1,X1,L5,M3,M1,_,_,
     M5,M6,M7,H1,0,M7,H1,_,M5,300,M6,M6,_,M5,0,M4,M3,_,300,M3,M3,0,M3,M2,_,300,M5,M6,M7,H1,0,M7,H1,_,M5,300,M6,M6,_,M6,0,H1,H1,_,300,H1,H1,0,H1,H2,_,M5,300,M6,M7,H1,0,M7,H1,_,H3,700,H6,700,H5,_,H4,H3,_,H3,H2,_,
     M6,700,M7,H1,_,700,H1,0,H2,H1,_,H1,M7,300,H1,0,H2,_,H1,0,M7,H1,300,H1,
     M5,M6,M7,H1,0,M7,H1,_,M5,300,M6,M6,_,M5,0,M4,M3,_,300,M3,M3,0,M3,M2,_,300,M5,M6,M7,H1,0,M7,H1,_,M5,300,M6,M6,_,M6,0,H1,H1,_,300,H1,H1,0,H1,H2,_,M5,300,M6,M7,H1,0,M7,H1,_,H3,700,H6,700,H5,_,H4,H3,_,H3,H2,_,
     M6,700,M7,H1,_,700,H1,0,H2,H1,_,H1,M7,300,H1,0,H2,_,H1,0,M7,H1,300,H1,
     M5,M6,M7,H1,0,M7,H1,_,M5,300,M6,M6,_,M5,0,M4,M3,_,300,M3,M3,0,M3,M2,_,300,M5,M6,M7,H1,0,M7,H1,_,M5,300,M6,M6,_,M6,0,H1,H1,_,300,H1,H1,0,H1,H2,_,M5,300,
     M6,M7,H1,0,M7,H1,_,H3,700,H6,700,H5,_,H4,H3,_,H3,H2,_,M6,700,M7,H1,_,700,H1,0,H2,H1,_,H1,M7,300,H1,0,H2,_,H1,700,M7,H1,_,_,_,
     400,M3,M3,0,M6,M6,_,_,400,M1,M2,0,M3,M3,_,400,_,_,_,_,_,_,_,_,M3,M3,0,M6,M6,_,_,400,_,M5,M5,M4,M3,_,_,_,_,_,_,_,_,
     M3,M3,M6,_,M1,M2,M3,_,_,_,_,_,_,_,M3,M3,M1,0,M4,300,M4,M4,_,400,M3,M1,_,_,_,_,_,
  };
  for (auto i : trivial)
  {
    switch (i)
    {
      case 500:
      case 400:
      case 300:
        sleep = i;//Sleep(i/2);
        continue;
      case 0:
        sleep = 150;
        continue;
      case 700:
        Sleep(180);
        continue;
      case 0XFF:
        Sleep(300);
        continue;
    }
    voice = (volume << 16) + (i << 8) + 0x90;
    midiOutShortMsg(handle, voice);
    //cout << voice << endl;
    Sleep(sleep);
  }
  midiOutClose(handle);
}
// 孤勇者
void GYZ(void)
{
  midiOutOpen(&handle, 0, 0, 0, CALLBACK_NULL);
  //midiOutShortMsg(handle,32<<8+0xC0);
  int volume = 0x7f;
  int voice = 0x0;
  int sleep = 350;
  int gyz[] =
  {
     M2,L7,M1,L6,M2,L7,M1,L6,M2,L7,M1,L6,M2,L7,M1,L6,M2,L7,M1,L6,M2,L7,M1,L6,M2,L7,M1,L6,M2,L7,M1,L6,M2,L7,M1,L6,M2,L7,M1,L6,
     M3,_,_,_,_,_,0,700,M1,M2,M1,300,M3,_,_,_,_,700,0,M1,M2,M1,M2,M3,300,L6,700,0,M1,300,L6,700,0,M1,300,L6,700,0,M1,300,M2,M1,L7,_,_,_,_,_,_,_,
     M3,_,_,_,_,_,0,700,M1,M2,M1,300,M3,_,_,_,_,700,0,M1,M2,M1,M2,M3,300,L6,700,0,M1,300,L6,700,0,M1,300,L6,700,0,M1,300,M3,M2,L7,_,_,_,_,_,_,_,
     0,L6,M1,300,M6,0,700,M6,M6,M5,300,M6,0,M6,M5,M6,M5,M6,M5,700,300,M3,700,_,_,_,_,_,0,L6,M1,300,M6,0,M6,M6,M5,M6,M5,300,M7,700,0,M7,M7,M6,300,M7,0,700,300,M6,0,M3,300,_,_,_,_,
    _,0,M3,M5,M3,300,M2,700,0,M3,300,M2,700,0,M3,300,M2,700,0,M3,300,0,M5,M3,M5,M3,300,M2,700,0,M3,300,M2,700,0,M3,300,M2,_,_,0,M1,M2,300,M3,L6,M1,M3,M2,700,0,M3,M2,700,300,M1,L6,_,_,_,_,_,_,
     0,M6,M7,H1,H2,M7,H1,300,H1,0,H1,M7,H1,H2,M7,H1,300,
     H1,0,H1,H2,H3,H2,H3,H2,300,H3,0,H3,H2,300,H3,H5,H3,0,M6,M7,H1,H2,M7,H1,300,
     H1,0,H1,M7,H1,H2,M7,H1,300,H1,0,H1,H2,H3,H2,H3,H2,300,H3,0,H3,H2,300,H3,H5,H3,
     H5,H3,700,0,H5,300,H3,700,0,H5,300,0,H3,H5,H6,H3,300,H5,H5,H3,700,0,H5,300,H3,700,0,H5,H3,H5,H6,H3,300,
     H5,0,H5,H5,H3,700,H2,300,H2,0,H1,H3,_,300,H2,H2,0,H1,300,M6,700,_,_,_,_,_,_,
     0,H5,H5,H3,700,300,H2,H2,0,H1,H3,_,300,H2,H2,0,H1,M6,_,_,_,_,_,_,_,
     _,_,_,_,_,_,_,_, _,_,_,_,_,_,_,_,_,_,_,_,_,_,_,_,0,M6,M5,300,M6,700,0,M5,M6,M5,M6,M5,300,M6,0,M6,M5,M6,M5,M6,M5,700,M3,700,M3,_,_,_,_,
     0,M6,M5,300,M6,700,0,M5,M6,M5,M6,M5,300,M7,700,0,M7,M7,M6,M7,M6,700,300,M3,700,_,_,700,0,M3,M5,M3,300,M2,700,0,M3,300,M2,700,0,M3,300,M2,700,0,M3,M5,M3,M5,M3,300,M2,700,0,M3,300,M2,700,0,M3,300,M2,_,_,
     0,M1,M2,300,M3,M6,H1,H3,H2,700,0,H3,300,H2,700,300,H1,M6,_,_,_,_,_,
     0,M6,M7,H1,H2,M7,H1,300,H1,0,H1,M7,H1,H2,M7,H1,300,
     H1,0,H1,H2,H3,H2,H3,H2,300,H3,0,H3,H2,300,H3,H5,H3,0,M6,M7,H1,H2,M7,H1,300,
     H1,0,H1,M7,H1,H2,M7,H1,300,H1,0,H1,H2,H3,H2,H3,H2,300,H3,0,H3,H2,300,H3,H5,H3,
     H5,H3,700,0,H5,300,H3,700,0,H5,300,0,H3,H5,H6,H3,300,H5,H5,H3,700,0,H5,300,H3,700,0,H5,H3,H5,H6,H3,300,
     H5,0,H5,H5,H3,700,H2,300,H2,0,H1,H3,_,300,H2,H2,0,H1,300,M6,700,_,_,_,_,_,_,
     0,H5,H5,H3,700,300,H2,H2,0,H1,H3,_,300,H2,H2,0,H1,M6,_,_,_,_,_,_,_,
     L6,M1,M3,M7,_,M7,0,M7,M7,300,M6,_,_,_,_,_,_,_,_,L6,M1,M3,M7,_,M7,0,M7,M7,300,M6,_,_,_,_,_,_,_,_,
     0,M6,M7,H1,H2,M7,H1,300,H1,0,H1,M7,H1,H2,M7,H1,300,
     H1,0,H1,H2,H3,H2,H3,H2,300,H3,0,H3,H2,300,H3,H5,H3,0,M6,M7,H1,H2,M7,H1,300,
     H1,0,H1,M7,H1,H2,M7,H1,300,H1,0,H1,H2,H3,H2,H3,H2,300,H3,0,H3,H2,300,H3,H5,H3,
     H5,H3,700,0,H5,300,H3,700,0,H5,300,0,H3,H5,H6,H3,300,H5,H5,H3,700,0,H5,300,H3,700,0,H5,H3,H5,H6,H3,300,
     H5,0,H5,H5,H3,700,H2,300,H2,0,H1,H3,_,300,H2,H2,0,H1,300,M6,700,_,_,_,_,_,_,
     0,H5,H5,H3,700,300,H2,H2,0,H1,H3,_,300,H2,H2,0,H1,M6,_,_,_,_,_,_,_,
  };
  for (auto i : gyz) {
    switch (i)
    {
      case 500:
      case 400:
      case 300:
        sleep = i;//Sleep(i/2);
        continue;
      case 0:
        sleep = 175;
        continue;
      case 700:
        Sleep(175);
        continue;
      case 0XFF:
        Sleep(350);
        continue;
    }
    // if (i == 900) volume += 100;
    voice = (volume << 16) + ((i) << 8) + 0x90;
    midiOutShortMsg(handle, voice);
    //cout << voice << endl;
    Sleep(sleep);
  }
  midiOutClose(handle);
}
// 海阔天空
void HKTK(void)
{
  midiOutOpen(&handle, 0, 0, 0, CALLBACK_NULL);
  //midiOutShortMsg(handle, 34 << 8 | 0xC0);
  int volume = 0x7f;
  int voice = 0x0;
  int sleep = 400; int tmp = 0;
  int hktk[] =
  {
   X4,(H7 - 1),_,H6,_,_,_, H5,H4,H3,H2,_,(L7 - 1),M1,M4,(X7 - 1),_,_,_,_, (L7 - 1),M1,M4,(X7 - 1),_,_,_,_,(L7 - 1),M1,M5,M4,_,_,_,_,_,M4,_,M3,_,_,_,
   1000,M3,0,M2,700,300,M1,_,_,_,_,_,_,0,M3,M4,300,M5,0,M5,M5,300,_,M6,700,M5,_,_,
   0,M6,M7,300,H1,0,H1,300,H1,700,H1,H1,M7,0,M6,300,M5,700,0,M6,300,_,_,_,_,_,
   M6,M5,M5,_,_,M5,M3,_,M3,M4,M3,M2,M2,0,M3,M2,300,_,_,M3,0,M2,M2,_,300,M1,M1,0,M1,M1,300,_,_,M2,M1,M1,_,_,_,_,_,_,
   1000,M3,0,M2,700,300,M1,_,_,_,_,_,_,0,M3,M4,300,M5,0,M5,M5,300,_,M6,700,M5,_,_,
   0,M6,M7,300,H1,0,H1,300,H1,700,H1,H1,M7,0,M6,300,M5,700,0,M6,300,_,_,_,_,_,
   M6,M5,M5,_,_,M5,M3,_,M3,M4,M3,M2,M2,0,M3,M2,300,_,_,M3,0,M2,M2,_,300,M1,M1,0,M1,M1,300,_,_,M2,M1,M1,_,_,_,_,_,_,
   _,0,M6,M7,300,H1,0,H1,H1,_,300,H1,M7,M6,0,M5,300,M5,700,M5,_,0,M3,300,M2,700,M1,_,_,_,_,0,H1,H1,300,H1,0,H1,H2,_,300,H2,0,H1,300,H2,700,H3,_,_,_,H3,0,H2,300,H1,700,
   _,0,H1,H1,300,H1,0,H1,H2,300,_,_,_,0,M5,M5,300,H3,_,H2,_,H1,_,_,_,
   _,0,H1,H1,300,H1,0,H1,H2,300,_,0,H2,H2,H1,300,M7,700,H1,_,_,_,_,_,_,_,
   1000,M3,0,M2,700,300,M1,_,_,_,_,_,_,0,M3,M4,300,M5,0,M5,M5,300,_,M6,700,M5,_,_,
   0,M6,M7,300,H1,0,H1,300,H1,700,H1,H1,M7,0,M6,300,M5,700,0,M6,300,_,_,_,_,_,
   M6,M5,M5,_,_,M5,M3,_,M3,M4,M3,M2,M2,0,M3,M2,300,_,_,M3,0,M2,M2,_,300,M1,M1,0,M1,M1,300,_,_,M2,M1,M1,_,_,_,_,_,_,
   _,0,M6,M7,300,H1,0,H1,H1,_,300,H1,M7,M6,0,M5,300,M5,700,M5,_,0,M3,300,M2,700,M1,_,_,_,_,0,H1,H1,300,H1,0,H1,H2,_,300,H2,0,H1,300,H2,700,H3,_,_,_,H3,0,H2,300,H1,700,
   _,0,H1,H1,300,H1,0,H1,H2,300,_,_,_,0,M5,M5,300,H3,_,H2,_,H1,_,_,_,
   _,0,H1,H1,300,H1,0,H1,H2,300,_,0,H2,H2,H1,300,M7,700,H1,_,_,_,_,_,_,_,
   M6,M6,M7,M6,M7,H1,_,_,_,0,H1,H1,300,H2,H1,H2,H3,_,_,_,H3,H2,_,_,0,H2,H3,300,H1,_,_,_,_,_,
   _,0,M6,M7,300,H1,0,H1,H1,_,300,H1,M7,M6,0,M5,300,M5,700,M5,_,0,M3,300,M2,700,M1,_,_,_,_,0,H1,H1,300,H1,0,H1,H2,_,300,H2,0,H1,300,H2,700,H3,_,_,_,H3,0,H2,300,H1,700,
   _,0,H1,H1,300,H1,0,H1,H2,300,_,_,_,0,M5,M5,300,H3,_,H2,_,H1,_,_,_,
   _,0,H1,H1,300,H1,0,H1,H2,300,_,0,H2,H2,H1,300,M7,700,H1,_,_,_,_,_,_,_,
   _,0,H1,H1,300,H1,0,H1,H2,300,_,_,_,0,M5,M5,300,H3,_,H2,_,H1,_,_,_,
   _,0,H1,H1,300,H1,0,H1,H2,300,_,0,H2,H2,H1,300,M7,700,H1,_,_,_,_,_,_,_,
    _,0,M6,M7,300,H1,0,H1,H1,_,300,H1,M7,M6,0,M5,300,M5,700,M5,_,0,M3,300,M2,700,M1,_,_,_,_,0,H1,H1,300,H1,0,H1,H2,_,300,H2,0,H1,300,H2,700,H3,_,_,_,H3,0,H2,300,H1,700,
   _,0,H1,H1,300,H1,0,H1,H2,300,_,_,_,0,M5,M5,300,H3,_,H2,_,H1,_,_,_,
   _,0,H1,H1,300,H1,0,H1,H2,300,_,0,H2,H2,H1,300,M7,700,H1,_,_,_,_,_,_,_,
  };
  for (auto i : hktk) {
    switch (i)
    {
      case 500:
      case 400:
      case 300:
        sleep = i;//Sleep(i/2);
        continue;
      case 0:
        sleep = 200;
        continue;
      case 700:
        Sleep(200);
        continue;
      case 0XFF:
        Sleep(400);
        continue;
      case 1000:
        tmp = +5;
        continue;
    }
    // if (i == 900) volume += 100;
    voice = (volume << 16) + ((i + tmp) << 8) + 0x90;
    midiOutShortMsg(handle, voice);
    //cout << voice << endl;
    Sleep(sleep);
  }
  midiOutClose(handle);
}
//光阴的故事
void GYDGS(void)
{
  midiOutOpen(&handle, 0, 0, 0, CALLBACK_NULL);
  //midiOutShortMsg(handle, 40 << 8 | 0xC0);
  int volume = 0x7f;
  int voice = 0x0;
  int sleep = 300;int tmp = 7;
  int gy[] =
  { H1,H1,H1,H1,M7,M6,M5,M5,M5,M5,M4,M3,M4,M4,M4,M6,M5,M4,M3,_,_,M3,_,_,
    M5,M5,M5,M6,_,M5,M3,0,M3,M2,300,M3,_,0,M1,M3,300,H1,H1,M6,H1,_,0,M6,M5,300,M5,_,_,_,_,_,
    H1,H1,M6,H1,_,M6,M5,M5,0,M6,M5,300,M5,M1,M3,M5,M5,M6,M5,_,M3,M2,_,_,_,_,_,
    M5,M5,M5,M6,_,M5,M3,0,M3,M2,300,M3,_,0,M1,M3,300,H1,H1,M6,H1,_,0,M6,M5,300,M5,_,_,_,_,_,
    H1,H1,M6,H1,_,M6,M5,M5,M6,M5,M1,M3,H1,H1,H1,M6,M7,H1,H2,_,_,_,_,_,
    H2,H2,M5,H3,H2,H2,H1,H1,M6,H2,H1,H1,M5,M5,M3,M5,_,M6,M5,_,_,_,_,_,
    H2,H2,M5,H3,H2,H2,H1,H1,M6,H2,H1,H1,M5,M6,M5,H2,_,H3,H1,_,_,_,_,_,
    H1,H1,H1,M7,M6,M5,M5,M5,M5,M5,M4,M3,M4,M4,M4,M6,M5,M4,M3,_,_,M3,_,_,
    H1,H1,H1,H1,M7,M6,M5,M5,M5,M5,M4,M3,M4,M4,M4,M6,M5,M4,M3,_,_,M3,_,_,
    M5,M5,M5,M6,_,M5,M3,0,M3,M2,300,M3,_,0,M1,M3,300,H1,H1,M6,H1,_,0,M6,M5,300,M5,_,_,_,_,_,
    H1,H1,M6,H1,_,M6,M5,M5,0,M6,M5,300,M5,M1,M3,M5,M5,M6,M5,_,M3,M2,_,_,_,_,_,
    M5,M5,M5,M6,_,M5,M3,0,M3,M2,300,M3,_,0,M1,M3,300,H1,H1,M6,H1,_,0,M6,M5,300,M5,_,_,_,_,_,
    H1,H1,M6,H1,_,M6,M5,M5,M6,M5,M1,M3,H1,H1,H1,M6,M7,H1,H2,_,_,_,_,_,
    H2,H2,M5,H3,H2,H2,H1,H1,M6,H2,H1,H1,M5,M5,M3,M5,_,M6,M5,_,_,_,_,_,
    H2,H2,M5,H3,H2,H2,H1,H1,M6,H2,H1,H1,M5,M6,M5,H2,_,H3,H1,_,_,_,_,_,
    M5,M5,M5,M6,_,M5,M3,M3,M2,M3,M1,M3,H1,H1,M6,H1,_,M6,M5,_,_,_,_,_,
    H1,H1,M6,H1,_,M6,M5,M6,M5,M5,M1,M3,M5,M5,M6,M5,_,M3,M2,_,_,_,_,_,
    M5,M5,M5,M6,_,M5,M3,M3,M2,M3,M1,M3,H1,H1,M6,H1,_,M6,M5,_,_,_,_,_,
    H1,H1,M6,H1,_,M6,M5,M5,M6,M5,M1,M3,H1,H1,H1,M6,M7,H1,H2,_,_,_,_,_,
    H1,H1,H1,H1,M7,M6,M5,M5,M5,M5,M4,M3,M4,M4,M4,M6,M5,M4,M3,_,_,M3,_,_,
    M5,M5,M5,M6,_,M5,M3,0,M3,M2,300,M3,_,0,M1,M3,300,H1,H1,M6,H1,_,0,M6,M5,300,M5,_,_,_,_,_,
    H1,H1,M6,H1,_,M6,M5,M5,0,M6,M5,300,M5,M1,M3,M5,M5,M6,M5,_,M3,M2,_,_,_,_,_,
    M5,M5,M5,M6,_,M5,M3,0,M3,M2,300,M3,_,0,M1,M3,300,H1,H1,M6,H1,_,0,M6,M5,300,M5,_,_,_,_,_,
    H1,H1,M6,H1,_,M6,M5,M5,M6,M5,M1,M3,H1,H1,H1,M6,M7,H1,H2,_,_,_,_,_,
    H2,H2,M5,H3,H2,H2,H1,H1,M6,H2,H1,H1,M5,M5,M3,M5,_,M6,M5,_,_,_,_,_,
    H2,H2,M5,H3,H2,H2,H1,H1,M6,H2,H1,H1,M5,M6,M5,H2,_,H3,H1,_,_,_,_,_,
    M5,M5,M5,M6,_,M5,M3,M3,M2,M3,M1,M3,H1,H1,M6,H1,_,M6,M5,_,_,_,_,_,
    H1,H1,M6,H1,_,M6,M5,M6,M5,M5,M1,M3,M5,M5,M6,M5,_,M3,M2,_,_,_,_,_,
    M5,M5,M5,M6,_,M5,M3,M3,M2,M3,M1,M3,H1,H1,M6,H1,_,M6,M5,_,_,_,_,_,
    H1,H1,M6,H1,_,M6,M5,M5,M6,M5,M1,M3,H1,H1,H1,M6,M7,H1,H2,_,_,_,_,_,
    H1,H1,H1,H1,M7,M6,M5,M5,M5,M5,M4,M3,M4,M4,M4,M6,M5,M4,M3,_,_,M3,_,_,
  };
  for (auto i : gy) {
    switch (i)
    {
      case 0:
        sleep = 150;
        continue;
      case 700:
        Sleep(150);
        continue;
      case 0XFF:
        Sleep(300);
        continue;
      case 300:
        sleep = 300;
        continue;
    }
    //if (i == 1000) { tmp = -2;continue; }
    // if (i == 900) volume += 100;
    voice = (volume << 16) + ((i + tmp) << 8) + 0x90;
    midiOutShortMsg(handle, voice);
    //cout << voice << endl;
    Sleep(sleep);//midiOutShortMsg(handle, 0x7BB0);
  }
  midiOutClose(handle);
}

//千本樱
//midiOutShortMsg(handle,0<<8 | 0xC1); //通道1的乐器为 大钢琴
//midiOutShortMsg(handle,0<<8 | 0xC2); //通道2的乐器为 大钢琴
//midiOutShortMsg(handle,0<<8 | 0xC3); //通道3的乐器为 大钢琴
void QBY_Th1(void);
void QBY_Th1(void)
{
  int stb = 240 , sta = 240 , sleep = 240 , voice = 0x0 , gao = 0x7f , tmp = 0;
  //规定240毫秒为半拍 
  int th1[] =
  {  
    H2,700,H2,700,H1,H2,700,H2,700,H1,H2,700,H2,700,H1,H2,_,H4,_, H2,700,H2,700,H1,H2,700,H2,700,H1,      //3
    H2,_,H6,_,H5,_,H6,_,  
    H5,H6,0,H2,H1,H2,H1,300,H5,H6,0,H2,H1,H2,H1,300, H5,H6,0,H2,H1,H2,H1,300,H4,400,H3,H4,H3,300,H2,H1,//3
    H5,H6,0,H2,H1,H2,H1,300,H5,H6,0,H2,H1,H2,H1,300,H5,H6,Y1,Y4,0,Y3,Y4,Y3,Y2,300,Y1,H6,          //2
    H5,H6,0,H2,H1,H2,H1,300,H5,H6,0,H2,H1,H2,H1,300,H5,H6,0,H2,H1,H2,H1,300,H4,400,H3,H4,H3,300,H2,H1,
    H5,H6,0,H2,H1,H2,H1,300,H5,H6,0,H2,H1,H2,H1,300,H5,H6,Y1,Y4,0,Y3,Y4,Y3,Y2,300,Y1,H6,          //重复
    H5,H6,0,H2,H1,H2,H1,300,H5,H6,0,H2,H1,H2,H1,300,H5,H6,0,H2,H1,H2,H1,00,H4,400,H3,H4,H3,300,H2,H1,
    H2,0,H1,H2,300,H4,0,H2,H4,300,H5,0,H5,H6,Y1,Y4,H6,Y1,300,
    Y4,400,Y3,Y4,Y3,300,Y2,Y1,Y2,_,Y2,Y4,
  500,H5,H6,0,H2,H1,H2,H1,300,H5,H6,0,H2,H1,H2,H1,300,
    H5,H6,0,H2,H1,H2,H1,300,H4,400,H3,H4,H3,300,H2,H1,
    H5,H6,0,H2,H1,H2,H1,300,H5,H6,0,H2,H1,H2,H1,300,
    H5,H6,Y1,Y4,0,Y3,Y4,Y3,Y2,300,Y1,H6,
    H5,H6,0,H2,H1,H2,H1,300,H5,H6,0,H2,H1,H2,H1,300,
    H5,H6,0,H2,H1,H2,H1,300,H4,400,H3,H4,H3,300,H2,H1,
    H5,0,H6,Y1,Y2,Y1,H6,H5,300,H2,H4,H5,H6,
    H2,700,H2,700,H1,H2,_,_,_,600,
  H2,_,H2,700,0,H1,300,H2,H4,H4,H5,
  H2,_,H2,700,0,H1,300,H2,H1,M6,H1,
  H2,_,H2,700,0,H1,300,H2,H4,H5,H6,
  H6,_,800,H5,H6,H5,300,H4,_,H2,_,
  H2,_,H2,700,0,H1,300,H2,H4,H4,H5,
  H2,_,H2,700,0,H1,300,H2,H1,H1,M6,
  H2,_,H2,700,0,H1,300,H1,H2,H4,H5,
  H6,_,800,H5,H6,H5,300,H4,_,H2,_,
  H4,_,H3,_,H2,_,H1,_,
  H1,0,H1,H2,300,M6,M5,M6,_,_,_,
  M6,H1,H2,_,H5,_,H3,_,
  H4,_,H3,H1,H2,_,_,_,
  H4,_,H3,_,H2,_,H1,_,
  H1,0,H1,H2,300,M6,M5,M6,_,M6,H1,
  H2,H2,_,H2,H4,_,H5,_,
  H3,_,_,_,_,_,H2,H4,
  H5,700,H5,700,H6,H6,_,_,H6,
  Y1,Y2,H5,H4,H6,_,H2,H4,
  H5,700,H5,700,H6,H6,_,_,H6,
  (H7 - 1),H6,H5,H4,H4,_,H2,H4,
  H5,700,H5,700,H6,H6,_,_,H6,
  Y1,Y2,H5,H4,H6,_,H2,H4,
  (H7 - 1),_,H6,_,H5,_,H4,_,
  H5,H6,H3,H1,H2,_,H2,H4,
  H5,700,H5,700,H6,H6,_,_,H6,
  Y1,Y2,H5,H4,H6,_,H2,H4,
  H5,700,H5,700,H6,H6,_,_,H6,
  (H7 - 1),H6,H5,H4,H4,_,H2,H4,
  H5,700,H5,700,H6,H6,_,_,H6,
  Y1,Y2,H5,H4,H6,_,H2,H4,
  (H7 - 1),_,H6,_,H5,_,H4,_,
  H5,H4,H6,Y1,Y2,_,_,_,
  H5,H6,0,H2,H1,H2,H1,300,H5,H6,0,H2,H1,H2,H1,300, H5,H6,0,H2,H1,H2,H1,300,H4,400,H3,H4,H3,300,H2,H1,//3
    H5,H6,0,H2,H1,H2,H1,300,H5,H6,0,H2,H1,H2,H1,300,H5,H6,Y1,Y4,0,Y3,Y4,Y3,Y2,300,Y1,H6,          //2
    H5,H6,0,H2,H1,H2,H1,300,H5,H6,0,H2,H1,H2,H1,300,H5,H6,0,H2,H1,H2,H1,300,H4,400,H3,H4,H3,300,H2,H1,
    H5,H6,0,H2,H1,H2,H1,300,H5,H6,0,H2,H1,H2,H1,300,H5,H6,Y1,Y4,0,Y3,Y4,Y3,Y2,300,Y1,H6,          //重复
    H5,H6,0,H2,H1,H2,H1,300,H5,H6,0,H2,H1,H2,H1,300,H5,H6,0,H2,H1,H2,H1,00,H4,400,H3,H4,H3,300,H2,H1,
    H2,0,H1,H2,300,H4,0,H2,H4,300,H5,0,H5,H6,Y1,Y4,H6,Y1,300,
    Y4,400,Y3,Y4,Y3,300,Y2,Y1,Y2,_,Y2,Y4,
  500,H5,H6,0,H2,H1,H2,H1,300,H5,H6,0,H2,H1,H2,H1,300,
    H5,H6,0,H2,H1,H2,H1,300,H4,400,H3,H4,H3,300,H2,H1,
    H5,H6,0,H2,H1,H2,H1,300,H5,H6,0,H2,H1,H2,H1,300,
    H5,H6,Y1,Y4,0,Y3,Y4,Y3,Y2,300,Y1,H6,
    H5,H6,0,H2,H1,H2,H1,300,H5,H6,0,H2,H1,H2,H1,300,
    H5,H6,0,H2,H1,H2,H1,300,H4,400,H3,H4,H3,300,H2,H1,
    H5,0,H6,Y1,Y2,Y1,H6,H5,300,H2,H4,H5,H6,
    H2,700,H2,700,H1,H2,_,_,_,600,
  H2,_,H2,700,0,H1,300,H2,H4,H4,H5,
  H2,_,H2,700,0,H1,300,H2,H1,M6,H1,
  H2,_,H2,700,0,H1,300,H2,H4,H5,H6,
  H6,_,800,H5,H6,H5,300,H4,_,H2,_,
  H2,_,H2,700,0,H1,300,H2,H4,H4,H5,
  H2,_,H2,700,0,H1,300,H2,H1,H1,M6,
  H2,_,H2,700,0,H1,300,H1,H2,H4,H5,
  H6,_,800,H5,H6,H5,300,H4,_,H2,_,
  H4,_,H3,_,H2,_,H1,_,
  H1,0,H1,H2,300,M6,M5,M6,_,_,_,
  M6,H1,H2,_,H5,_,H3,_,
  H4,_,H3,H1,H2,_,_,_,
  H4,_,H3,_,H2,_,H1,_,
  H1,0,H1,H2,300,M6,M5,M6,_,M6,H1,
  H2,H2,_,H2,H4,_,H5,_,
  H3,_,_,_,_,_,H2,H4,
  H5,700,H5,700,H6,H6,_,_,H6,
  Y1,Y2,H5,H4,H6,_,H2,H4,
  H5,700,H5,700,H6,H6,_,_,H6,
  (H7 - 1),H6,H5,H4,H4,_,H2,H4,
  H5,700,H5,700,H6,H6,_,_,H6,
  Y1,Y2,H5,H4,H6,_,H2,H4,
  (H7 - 1),_,H6,_,H5,_,H4,_,
  H5,H6,H3,H1,H2,_,H2,H4,
  H5,700,H5,700,H6,H6,_,_,H6,
  Y1,Y2,H5,H4,H6,_,H2,H4,
  H5,700,H5,700,H6,H6,_,_,H6,
  (H7 - 1),H6,H5,H4,H4,_,H2,H4,
  H5,700,H5,700,H6,H6,_,_,H6,
  Y1,Y2,H5,H4,H6,_,H2,H4,
  (H7 - 1),_,H6,_,H5,_,H4,_,
  H5,H4,H6,Y1,Y2,_,_,_,
  Y2,Y2,Y2,Y2,Y2,Y2,0,Y2,Y1,300,H6,
  H5,H5,H5,H5,H5,H5,0,H5,H4,300,H2,
  Y2,Y2,Y2,Y2,Y2,Y2,0,Y2,Y1,300,H6,
  M5,0,M6,M5,M6,H1,H2,H4,H6,Y1,Y2,Y4,300,Y3,0,H2,H4,300,
  0,H6,H4,H2,H6,H6,H6,H4,H2,H6,H4,H2,H6,H6,H6,H4,H2,300,
  0,(H7-1),H5,(H3+1),(H7-1), (H7 - 1), (H7 - 1),H5,(H3+1), (H7 - 1), H5, (H3 + 1), (H7 - 1), (H7 - 1), (H7 - 1), H5, (H3 + 1),300,
  0, (H7 - 1), H4, H2, (H7 - 1), (H7 - 1), (H7 - 1), H4, H2, 0, (H7 - 1), H4, H2, (H7 - 1), (H7 - 1), (H7 - 1), H4, H2,
    0, H5, H3, H1, H5, H5, H5, H3, H1, H6, H3, H1, H6, H6, H6, H3, H1, 300,
    0, H6, H4, H2, H6, Y1, H6, H4, H2, H5, H4, H2, H6, Y4, Y2, H6, H4, 300,
    0, (H7 - 1), H4, H2, (H7 - 1), Y2, H7, H4, H2, (H7 - 1), H4, H2, (H7 - 1), Y4, Y3, Y2, H7, 300,
    0, Y2, (H7 + 1), H4, (H7 + 1), Y4, (H7 + 1), Y2, Y4, (Y7 + 1), Y4, Y2, H7, H7, H5, H2, M7, 300,
    H1, _, 0, M1, M3, M5, H1, 300, (H2 - 1), _, 0, (M2 - 1), M4, (M6 - 1), H2, 300,
    0, H5, H6, H4, H6, H5, H4, H3, H2, H3, H2, H1, H2, H2, H1, M6, M5, 300,
    0, M6, M5, M4, M6, M5, M4, M3, M4, 300, M2, _, _, _,
    M2, M3, M4, M6, 0, M5, M6, H2, H3, H4, H3, H2, H4,300,
    H5, H4, 400, Y1, H6, Y1, H6, Y1, H6, 300, Y1, _, _, _,
    H4, 0, H2, (M7 - 1), M4, M7, H2, H4, 300, H5, 0, H3, H1, M5, H1, H3, H5, 300,
    H6, 700, (H5 + 1), 700, 0, H6, H5, 300, H6, _, _, _,
    H4, _, H3, _, H2, _, H1, _,
    H1, 0, H1, H2, 300, M6, M5, M6, _, _, _,
    M6, H1, H2, _, H5, _, H3, _,
    H4, _, H3, H1, H2, _, _, _,
    H4, _, H3, _, H2, _, H1, _,
    H1, 0, H1, H2, 300, M6, M5, M6, _, M6, H1,
    H2, H2, _, H2, H4, _, H5, _,
    H3, _, _, _, _, _, H2, H4,
    H5, 700, H5, 700, H6, H6, _, _, H6,
    Y1, Y2, H5, H5, H4, H6, _, H2, H4,
    H5, 700, H5, 700, H6, H6, _, _, H6,
    (H7 - 1), H6, H5, H4, H4, _, H2, H4,
    H5, 700, H5, 700, H6, H6, _, _, H6,
    Y1, Y2, H5, H5, H4, H6, _, H2, H4,
    (H7 - 1), _, H6, _, H5, _, H4, _,
    H5, H6, H5, H6, H6, _, H3, H5,
    H6, 700, H6, 700, H7, H7, _, _, H7,
    Y2, Y3, H6, H5, H7, _, H3, H5,
    H6, 700, H6, 700, H7, H7, _, _, H7,
    Y1, H7, H6, H5, H5, _, H3, H5, H6, 700, H6, 700, H7, H7, _, _, H7,
    Y2, Y3, H6, H5, H7, _, H3, H5,
    Y1, _, H7, _, H6, _, H5, _,
    H6, H5, H7, Y2, Y3, _, H3, H5,
    H6, H7, 0, H3, H2, H3, H2, 300, H6, H7, 0, H3, H2, H3, H2, 300,
    H6, H7, 0, H3, H2, H3, H2, 300, H5, 400, (H4 + 1), H5, (H4+1), 300, H3, H2,
    H6, H7, 0, H3, H2, H3, H2, 300, H6, H7, 0, H3, H2, H3, H2, 300,
    H6, H7, Y2, Y5, 0, (Y4 + 1), Y5, (Y4+1), Y3, 300, Y2, H7,
    H6, H7, 0, H3, H2, H3, H2, 300, H6, H7, 0, H3, H2, H3, H2, 300,
    H6, H7, 0, H3, H2, H3, H2, 300, H5, 400, (H4 + 1), H5, (H4+1), 300, H3, H2,
    H3, 0, H2, H3, 300, H5, 0, H3, H5, 300, H6, 0, H6, H7, Y2, Y5, H7, Y2, 300,
    Y5, 400, (Y4 + 1), Y5, (Y4+1), 300, Y3, Y2, Y3, _, Y3, Y5,
    500, H6, H7, 0, H3, H2, H3, H2, 300, H6, H7, 0, H3, H2, H3, H2, 300,
    H6, H7, 0, H3, H2, H3, H2, 300, H5, 400, (H4+1), H5, (H4+1), 300, H3, H2,
    H6, H7, 0, H3, H2, H3, H2, 300, H6, H7, 0, H3, H2, H3, H2, 300,
    H6, H7, Y2, Y5, 0, (Y4 + 1), Y5, (Y4+1), Y3, 300, Y2, H7,
    H6, H7, 0, H3, H2, H3, H2, 300, H6, H7, 0, H3, H2, H3, H2, 300,
    H6, H7, 0, H3, H2, H3, H2, 300, H5, 400, (H4 + 1), H5, (H4+1), 300, H3, H2,
    H6, 0, H7, Y2, Y3, Y2, H7, H6, 300,H3,H5,H6,H7,
    H3, 700, H3, 700, H2, H3, _, _, _,
    H3, 700, H3, 700, H2, H3, _, _, _,
  }; 
  for (auto i : th1)
  {
    switch (i)
    {
      case 0:
        sleep = sta/2;//换节奏为四分之一拍 
        continue;
      case 300:
        sleep = sta;//换节奏为半拍 
        continue;
      case 700:
        Sleep(sta/2);//休眠四分之一拍 
        continue;
      case _:
        Sleep(stb);//休眠半拍 
        continue;
      case 400:
        sleep = sta/3;//换节奏为六分之一拍
        continue;
      case 500:
        tmp = 12;//升高八度
        continue;
      case 600:
        tmp = 0; //还原
        continue;
      case 800:
        sleep = (sta * 2) / 3;
        continue;
    }
    voice = (gao << 16) + ((i + tmp) << 8) + 0x90;//赋值语句，决定音量，音调和音色；  
    midiOutShortMsg(handle, voice);
    //cout << ans << endl;ans++;
    Sleep(sleep);
  }
  midiOutClose(handle);
}
void QBY_Th2(void);
void QBY_Th2(void)
{
  int stb = 240 , sta = 240 , sleep = 240 , voice = 0x0 , gao = 0x7f , tmp = 0;
  int th2[] =
  {
  M6,700,M6,700,M5,M6,700,M6,700,M5,M6,700,M6,700,M5,M6,_,H1,_, M6,700,M6,700,M5,M6,700,M6,700,M5,
  M6,_,H4,_,H3,_,H4,750,
  };
  for (auto i : th2)
  {
    switch (i)
    {
      case 0:
        sleep = sta / 2;
        continue;
      case 300:
        sleep = sta;
        continue;
      case 700:
        Sleep(sta / 2);
        continue;
      case 0XFF:  // 你需要使用具体的值来替换下划线，作为休眠半拍的情况
        Sleep(stb);
        continue;
      case 750:
        Sleep(6000000);
        continue;
    }
    voice = (gao << 16) + ((i + tmp) << 8) + 0x91;//赋值语句，决定音量，音调和音色；  
    midiOutShortMsg(handle, voice);
    // cout << ans2 << endl;ans++;
    Sleep(sleep);
  }
  midiOutClose(handle);
}
void QBY_Th3(void);
void QBY_Th3(void)
{
  int stb = 240 , sta = 240 , sleep = 240 , voice = 0x0 , zhong =0x40 , tmp = 0;
  int th3[] =
  {
    M2,700,M2,700,M2,M2,700,M2,700,M2,M2,700,M2,700,M2, M2,700,M2,700,M2,M2,700,M2,700,M2,M2,700,M2,700,M2,
    M2,_,M2,_,M1,_,M1,_,_,(L7 - 1),_,(L7 - 1),_,M1,_,M1,750,  
  };
  for (auto i : th3)
  {
    switch (i)
    {
      case 0:
        sleep = sta / 2;
        continue;
      case 300:
        sleep = sta;
        continue;
      case 700:
        Sleep(sta / 2);
        continue;
      case 0XFF:
        Sleep(stb);
        continue;
      case 750:
        Sleep(6000000);
        continue;
    }
    voice = (zhong << 16) + ((i + tmp) << 8) + 0x92;//赋值语句，决定音量，音调和音色；  
    midiOutShortMsg(handle, voice);
    //cout << ans << endl;ans++;
    Sleep(sleep);
  }
  midiOutClose(handle);
}
void QBY_Th4(void);
void QBY_Th4(void)
{
  int stb = 240 , sta = 240 , sleep = 240 , voice = 0x0 , zhong = 0x40 , tmp = 0;
  int th4[] =
  {
    L6,700,L6,700,L6,L6,700,L6,700,L6,L6,700,L6,700,L6,   L6,700,L6,700,L6,L6,700,L6,700,L6,L6,700,L6,700,L6,
    L6,_,L6,_,L5,_,L5,_,_,(L7 - 1),_,(L7 - 1),_,M1,_,M1, _,M2,_,M2,_,M2,_,M2,
    _,(L7 - 1),_,(L7 - 1),_,M1,_,M1,  _,M2,_,M2,_,M2,_,M2,
    _,(L7 - 1),_,(L7 - 1),_,M1,_,M1, _,M2,_,M2,_,M2,_,M2,  _,(L7 - 1),_,(L7 - 1),_,M1,_,M1,  _,M2,_,M2,_,M2,_,M2, //重复
    _,(L7 - 1),_,(L7 - 1),_,M1,_,M1, _,M2,_,M2,_,M2,_,M2,
    _,(L7 - 1),_,(L7 - 1),_,M1,_,M1,
    _,M2,_,M2,_,M2,_,M2,
    _,(L7 - 1),_,(L7 - 1),_,M1,_,M1,
    _,M2,_,M2,_,M2,_,M2,
    _,(L7 - 1),_,(L7 - 1),_,M1,_,M1,
    _,M2,_,M2,_,M2,_,M2,
    _,(L7 - 1),_,(L7 - 1),_,M1,_,M1,
    _,M2,_,M2,_,M2,_,M2,
    _,(L7 - 1),_,(L7 - 1),_,M1,_,M1,
    _,M2,_,M2,_,M2,_,M2,
    750,
  };
  for (auto i : th4)
  {
    switch (i)
    {
      case 0:
        sleep = sta / 2;
        continue;
      case 300:
        sleep = sta;
        continue;
      case 700:
        Sleep(sta / 2);
        continue;
      case 0XFF:
        Sleep(stb);
        continue;
      case 750:
        Sleep(6000000);
        continue;
    }
    voice = (zhong << 16) + ((i + tmp) << 8) + 0x93;//赋值语句，决定音量，音调和音色；  
    midiOutShortMsg(handle, voice);
    //cout << ans << endl;ans++;
    Sleep(sleep);
  }
  midiOutClose(handle);
}
void QBY_Th5(void);
void QBY_Th5(void)
{
  int stb = 240 , sta = 240 , sleep = 240 , voice = 0x0 , zhong = 0x40 , tmp = 0;
  int th5[] =
  {
  L2,700,L2,700,L2,L2,700,L2,700,L2,L2,700,L2,700,L2, L2,700,L2,700,L2,L2,700,L2,700,L2,L2,700,L2,700,L2,
  L2,_,L2,_,L1,_,L1,_,  (X7 - 1),L4,(X7 - 1),L4,L1,L5,L1,L5, L2,L6,L2,L6,L2,L6,L2,L6,
  (X7 - 1),L4,(X7 - 1),L4,L1,L5,L1,L5,  L2,L6,L2,L6,L2,L6,L2,L6,
  (X7 - 1),L4,(X7 - 1),L4,L1,L5,L1,L5,  L2,L6,L2,L6,L2,L6,L2,L6,(X7 - 1),L4,(X7 - 1),L4,L1,L5,L1,L5,  L2,L6,L2,L6,L2,L6,L2,L6,//重复
  (X7 - 1),L4,(X7 - 1),L4,L1,L5,L1,L5,  L2,L6,L2,L6,L2,L6,L2,L6,
  (X7 - 1),L4,(X7 - 1),L4,L1,L5,L1,L5,
  L2,L6,L2,L6,L2,L6,L2,L6,
  (X7 - 1),L4,(X7 - 1),L4,L1,L5,L1,L5,
  L2,L6,L2,L6,L2,L6,L2,L6,
  (X7 - 1),L4,(X7 - 1),L4,L1,L5,L1,L5,
  L2,L6,L2,L6,L2,L6,L2,L6,
  (X7 - 1),L4,(X7 - 1),L4,L1,L5,L1,L5,
  L2,L6,L2,L6,L2,L6,L2,L6,
  (X7 - 1),L4,(X7 - 1),L4,L1,L5,L1,L5,
  L2,L6,L2,L6,L2,L6,L2,L6,
  750,
  };
  for (auto i : th5)
  {
    switch (i)
    {
      case 0:
        sleep = sta / 2;
        continue;
      case 300:
        sleep = sta;
        continue;
      case 700:
        Sleep(sta / 2);
        continue;
      case 0XFF:
        Sleep(stb);
        continue;
      case 750:
        Sleep(6000000);
        continue;
    }
    voice = (zhong << 16) + ((i + tmp) << 8) + 0x94;//赋值语句，决定音量，音调和音色；  
    midiOutShortMsg(handle, voice);
    //cout << ans << endl;ans++;
    Sleep(sleep);
  }
  midiOutClose(handle);
}
void QBY(void)
{
  midiOutOpen(&handle, 0, 0, 0, CALLBACK_NULL);
  //创建线程
  thread t1(QBY_Th1);
  thread t2(QBY_Th2);
  thread t3(QBY_Th3);
  thread t4(QBY_Th4);
  thread t5(QBY_Th5);
  //等待线程结束
  t1.join();
  t2.join();
  t3.join();
  t4.join();
  t5.join();
}

//打上花火
//声音指令，每8一格,最小为0x1f,最大0x7f,共十三档,对应数组_V[1]到_V[13]
const int _V[15]={0,1033,1039,1049,1051,1061,1063,1069,1087,1091,1093,1097,1103,1109,0};
map <int,int> _mp;
//双结构体记谱
struct v_spo {
  int _v1,_v2,_v3;
};
struct msc {
  v_spo v0,v1,v2;  
  int C;
};
//乐谱
msc DSHH_music[] = 
{
  {{G5s,R,R},{s,s,s},{B3,F4s,A4s},_V[2]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{C4s,G4s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5s,R,R},{R,R,R},{D4s,A4s,C5s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{F3s,C4s,A4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5s,R,R},{R,R,R},{B3,F4s,A4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{C4s,G4s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5s,R,R},{R,R,R},{D4s,A4s,C5s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{F3s,C4s,A4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5s,R,R},{A4s,R,R},{B2,F3s,A3s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{A4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{A4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{A4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{A4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{A4s,R,R},{C3s,G3s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{A4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{A4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5s,R,R},{G4s,R,R},{D3s,A3s,C4s},_V[4]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{G4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{G4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D6s,R,R},{G4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{G4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{G4s,R,R},{F2s,C2s,A2s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5s,R,R},{G4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{G4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5s,R,R},{A4s,R,R},{B2,F3s,A3s},_V[5]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{A4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{A4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{A4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{A4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{A4s,R,R},{C3s,G3s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{A4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{A4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5s,R,R},{G4s,R,R},{D3s,A3s,C4s},_V[6]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{G4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{G4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D6s,R,R},{G4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{G4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{G4s,R,R},{F2s,C2s,A2s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A4s,R,R},{s,s,s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{A4s,D5s,R},{F3s,A3s,R},{B2,R,R},_V[7]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F5s,R,R},{C4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{D4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5,R,R},{R,R,R},{C3s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5s,R,R},{F3,G3s,C4s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{B4,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{A4s,R,R},{F3s,A3s,R},{D3s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F5,R,R},{C4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{D4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F2s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F5s,R,R},{F3s,G3s,C4s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{D5s,R,R},{F3s,A3s,R},{B2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F5s,R,R},{C4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F5,R,R},{D4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5s,R,R},{R,R,R},{C3s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{F3,G3s,C4s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{R,R,R},{F3s,A3s,R},{D3s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{C4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{s,s,s},{D4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F2s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A4s,R,R},{F3s,A3s,C4s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{A4s,D5s,R},{F3s,A3s,R},{B2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F5s,R,R},{C4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{D4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5,R,R},{R,R,R},{C3s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5s,R,R},{F3,G3s,C4s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{B4,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{A4s,R,R},{F3s,A3s,R},{D3s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F5,R,R},{C4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{D4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F2s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F5s,R,R},{F3s,G3s,C4s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{D5s,R,R},{F3s,A3s,R},{B2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F5s,R,R},{C4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F5,R,R},{D4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5s,R,R},{R,R,R},{C3s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5s,R,R},{F3,G3s,C4s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{R,R,R},{F3s,A3s,R},{D3s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{C4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{s,s,s},{D4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F2s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5s,R,R},{F3s,A3s,C4s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{F4s,F5s,R},{s,s,s},{B1,F2s,B2},_V[9]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F3s,A3s,C4s},0}, 
    {{s,s,s},{R,R,R},{s,s,s},0}, {{R,R,R},{R,R,R},{B2,R,R},0}, {{C5s,F5,R},{R,R,R},{F3s,A3s,C4s},0}, {{R,R,R},{R,R,R},{s,s,s},0}, 
    {{D5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5s,F5,R},{R,R,R},{C2s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F4s,F5s,R},{R,R,R},{F3s,A3s,C4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{s,s,s},{R,R,R},{D2s,A2s,D3s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5s,F5,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F3s,A3s,F4s},0}, 
    {{D5s,R,R},{R,R,R},{s,s,s},0}, {{R,R,R},{R,R,R},{D3s,R,R},0}, {{C5s,F5,R},{R,R,R},{F3s,A3s,F4s},0}, {{R,R,R},{R,R,R},{s,s,s},0}, 
    {{D5s,F5s,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5s,F5,R},{R,R,R},{F2s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A4s,C5s,R},{R,R,R},{F3s,A3s,F4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5s,R,R},{R,R,R},{F2s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{A4s,C5s,R},{R,R,R},{B1,F2s,B2},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F4s,R,R},{R,R,R},{F3s,R,R},0}, {{R,R,R},{R,R,R},{A3s,C4s,R},0}, 
    {{F4s,R,R},{R,R,R},{s,s,s},0}, {{R,R,R},{R,R,R},{B2,R,R},0}, {{D5s,R,R},{R,R,R},{F3s,A3s,C4s},0}, {{R,R,R},{R,R,R},{s,s,s},0}, 
    {{A4s,C5s,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F4s,R,R},{R,R,R},{C2s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F4,G4s,R},{R,R,R},{F3,A3s,C4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F4s,A4s,R},{R,R,R},{C2s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{R,R,R},{R,R,R},{D2s,A2s,D3s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{s,s,s},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F3s,A3s,C4s},0}, 
    {{R,R,R},{R,R,R},{s,s,s},0}, {{R,R,R},{R,R,R},{D3s,R,R},0}, {{R,R,R},{R,R,R},{F3s,A3s,C4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F4s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5s,R,R},{R,R,R},{F3s,A3s,C4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5,R,R},{R,R,R},{F4s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{F5s,R,R},{R,R,R},{B1,F2s,B2},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5,R,R},{R,R,R},{F3s,A3s,C4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F3s,A3s,C4s},0}, {{F5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F5s,R,R},{R,R,R},{C3s,C4s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{R,R,R},{R,R,R},{D2s,A2s,D3s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5,R,R},{R,R,R},{F3s,A3s,C4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F3s,A3s,C4s},0}, {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5s,A6s,R},{R,R,R},{F2s,F3s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{B5,B6,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{R,R,R},{B3,R,R},{F3s,D4s,F4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,F6s,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F5s,F6s,R},{s,s,s},{C5s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,A6s,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,G6s,R},{R,R,R},{D5s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,F6s,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F5s,F6s,R},{R,R,R},{F4s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{s,s,s},{F1s,R,R},{F2s,R,R},_V[10]}, {{R,R,R},{F1s,R,R},{F2s,R,R},0}, {{R,R,R},{F1s,R,R},{F2s,R,R},0}, {{R,R,R},{F1s,R,R},{F2s,R,R},0}, 
    {{R,R,R},{F1s,R,R},{F2s,R,R},0}, {{R,R,R},{F1s,R,R},{F2s,R,R},0}, {{R,R,R},{F1s,R,R},{F2s,R,R},0}, {{R,R,R},{F1s,R,R},{F2s,R,R},0}, 
    {{R,R,R},{F1s,R,R},{F2s,R,R},0}, {{R,R,R},{F1s,R,R},{F2s,R,R},0}, {{R,R,R},{F1s,R,R},{F2s,R,R},0}, {{R,R,R},{F1s,R,R},{F2s,R,R},0}, 
    {{A4s,A5s,R},{s,s,s},{F1s,F2s,R},0}, {{s,s,s},{R,R,R},{R,R,R},0}, {{C5s,C6s,R},{R,R,R},{s,s,s},0}, {{A4s,A5s,R},{R,R,R},{R,R,R},0}, 
  {{G4s,G5s,R},{s,s,s},{B1,F2s,B2},_V[11]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F4s,F5s,R},{R,R,R},{B2,R,R},0}, {{R,R,R},{R,R,R},{D3s,R,R},0}, 
    {{D4s,D5s,R},{R,R,R},{F3s,A3s,R},0}, {{F4s,F5s,R},{R,R,R},{s,s,s},0}, {{s,s,s},{R,R,R},{R,R,R},0}, {{G4s,G5s,R},{R,R,R},{F3s,A3s,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2s,R,R},0}, {{R,R,R},{R,R,R},{F3,G3s,C4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A4s,A5s,R},{R,R,R},{C3s,R,R},0}, {{R,R,R},{R,R,R},{F3,G3s,C4s},0}, {{C5s,C6s,R},{R,R,R},{R,R,R},0}, {{A4s,A5s,R},{R,R,R},{R,R,R},0}, 
  {{G4s,G5s,R},{s,s,s},{D2s,A2s,D3s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F4s,F5s,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D3s,R,R},0}, 
    {{C4s,C5s,R},{R,R,R},{F3s,A3s,C4s},0}, {{F4s,F5s,R},{R,R,R},{s,s,s},0}, {{s,s,s},{R,R,R},{R,R,R},0}, {{F4s,F5s,R},{R,R,R},{F3s,A3s,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1s,R,R},0}, {{R,R,R},{A2s,R,R},{F3s,A3s,C4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A4s,A5s,R},{R,R,R},{s,s,s},0}, {{R,R,R},{s,s,s},{F3s,A3s,C4s},0}, {{C5s,C6s,R},{R,R,R},{R,R,R},0}, {{A4s,A5s,R},{R,R,R},{R,R,R},0}, 
  {{G4s,G5s,R},{s,s,s},{B1,F2s,B2},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{B2,R,R},0}, {{R,R,R},{R,R,R},{D3s,R,R},0}, 
    {{A4s,A5s,R},{R,R,R},{F3s,A3s,R},0}, {{C5s,C6s,R},{R,R,R},{s,s,s},0}, {{s,s,s},{R,R,R},{R,R,R},0}, {{C5s,C6s,R},{R,R,R},{F3s,A3s,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{D5s,D6s,R},{R,R,R},{C2s,R,R},0}, {{R,R,R},{R,R,R},{F3,G3s,C4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5s,C6s,R},{R,R,R},{F3,G3s,C4s},0}, {{B4,B5,R},{R,R,R},{R,R,R},0}, {{A4s,A5s,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{R,R,R},{s,s,s},{D2s,A2s,D3s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{s,s,s},{G6s,R,R},{R,R,R},0}, {{R,R,R},{A6s,R,R},{D3s,R,R},0}, 
    {{R,R,R},{C7s,R,R},{F3s,A3s,C4s},0}, {{R,R,R},{D7s,R,R},{R,R,R},0}, {{R,R,R},{A6s,R,R},{R,R,R},0}, {{R,R,R},{G6s,R,R},{F3s,A3s,C4s},0}, 
    {{R,R,R},{A6s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F1s,F2s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A4s,A5s,R},{s,s,s},{F3s,A3s,C4s},0}, {{R,R,R},{R,R,R},{F2s,F3s,R},0}, {{C5s,C6s,R},{R,R,R},{R,R,R},0}, {{A4s,A5s,R},{R,R,R},{R,R,R},0}, 
  {{G4s,G5s,R},{s,s,s},{G1,F2s,G2},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F4s,F5s,R},{R,R,R},{G2,R,R},0}, {{R,R,R},{R,R,R},{D3s,R,R},0}, 
    {{D4s,D5s,R},{R,R,R},{F4s,A4s,R},0}, {{F4s,F5s,R},{R,R,R},{s,s,s},0}, {{s,s,s},{R,R,R},{R,R,R},0}, {{G4s,G5s,R},{R,R,R},{F4s,A4s,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2s,R,R},0}, {{R,R,R},{R,R,R},{F3,G3s,C4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A4s,A5s,R},{R,R,R},{C3s,R,R},0}, {{R,R,R},{R,R,R},{F3,G3s,C4s},0}, {{C5s,C6s,R},{R,R,R},{R,R,R},0}, {{A4s,A5s,R},{R,R,R},{R,R,R},0}, 
  {{G4s,G5s,R},{s,s,s},{D2s,A2s,D3s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F4s,F5s,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D3s,R,R},0}, 
    {{C4s,C5s,R},{R,R,R},{F3s,A3s,C4s},0}, {{F4s,F5s,R},{R,R,R},{s,s,s},0}, {{s,s,s},{R,R,R},{R,R,R},0}, {{F4s,F5s,R},{R,R,R},{F3s,A3s,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1s,R,R},0}, {{R,R,R},{A2s,R,R},{F3s,A3s,C4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F4s,F5s,R},{R,R,R},{s,s,s},0}, {{F4,F5,R},{s,s,s},{F3s,A3s,C4s},0}, {{D4s,D5s,R},{R,R,R},{R,R,R},0}, {{F4,F5,R},{R,R,R},{R,R,R},0}, 
  {{D4s,D5s,R},{s,s,s},{B1,F2s,B2},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{B2,R,R},0}, {{R,R,R},{R,R,R},{D3s,R,R},0}, 
    {{G4s,G5s,R},{R,R,R},{F3s,A3s,R},0}, {{R,R,R},{R,R,R},{s,s,s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F3s,A3s,R},0}, 
    {{F4,F5,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2s,R,R},0}, {{D4s,D5s,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F4,F5,R},{R,R,R},{F3,G3s,C4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F4,C5s,F5},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{R,R,R},{R,R,R},{B1,B2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F4s,F5s,R},{R,R,R},{F3s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F4s,C5s,F5s},{R,R,R},{C2s,C3s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{G2s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F4s,A4s,R},{R,R,R},{D2s,A2s,D3s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D3s,R,R},0}, {{R,R,R},{R,R,R},{F3s,R,R},0}, 
    {{s,s,s},{R,R,R},{A3s,R,R},0}, {{R,R,R},{R,R,R},{C4s,R,R},0}, {{R,R,R},{R,R,R},{D4s,R,R},0}, {{R,R,R},{R,R,R},{F4s,R,R},0}, 
  //Part 2
{{G5s,R,R},{B3,F4s,A4s},{s,s,s},_V[5]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{C4s,G4s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5s,R,R},{D4s,A4s,C5s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{F3s,C4s,A4s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5s,R,R},{B3,F4s,A4s},{s,s,s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{C4s,G4s,R},{A4s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{A4s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{A4s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5s,R,R},{D4s,F4s,R},{G4s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{G4s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{G4s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{G4s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{R,R,R},{G4s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{G4s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{G4s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F4s,R,R},{s,s,s},{R,R,R},0}, {{G4s,R,R},{R,R,R},{s,s,s},0}, 
  {{A4s,R,R},{A2s,D3s,F3s},{s,s,s},_V[7]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G4s,R,R},{R,R,R},{R,R,R},0}, {{F4s,R,R},{R,R,R},{R,R,R},0}, 
    {{F4s,R,R},{D5s,F5s,A5s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D4s,R,R},{s,s,s},{R,R,R},0}, {{F4,R,R},{R,R,R},{R,R,R},0}, 
    {{F4s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F4,R,R},{C3s,F3,G3s},{R,R,R},0}, {{D4s,R,R},{R,R,R},{R,R,R},0}, 
    {{C4s,R,R},{A5s,G5s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A3s,R,R},{C3s,R,R},{R,R,R},0}, {{C4s,R,R},{R,R,R},{R,R,R},0}, 
  {{D4s,R,R},{D3s,F3s,A3s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F4,R,R},{R,R,R},{R,R,R},0}, {{F4s,R,R},{R,R,R},{R,R,R},0}, 
    {{F4,R,R},{D5s,F5s,A5s},{R,R,R},0}, {{C4s,R,R},{R,R,R},{R,R,R},0}, {{C4s,R,R},{s,s,s},{R,R,R},0}, {{D4s,R,R},{R,R,R},{R,R,R},0}, 
    {{C4s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{F2s,A3s,F3s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A3s,R,R},{A4s,C5s,G5s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A3s,R,R},{F2s,R,R},{R,R,R},0}, {{C4s,R,R},{R,R,R},{R,R,R},0}, 
  {{D4s,R,R},{B2,D3s,F3s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F4,R,R},{R,R,R},{R,R,R},0}, {{F4s,R,R},{R,R,R},{R,R,R},0}, 
    {{F4,R,R},{C5s,F5s,A5s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F4s,R,R},{s,s,s},{R,R,R},0}, {{G4s,R,R},{R,R,R},{R,R,R},0}, 
    {{A4s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G4s,R,R},{C3s,F3,G3s},{R,R,R},0}, {{F4s,R,R},{R,R,R},{R,R,R},0}, 
    {{F4,R,R},{C5s,G5s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C4s,R,R},{C3s,R,R},{R,R,R},0}, {{C4s,R,R},{R,R,R},{R,R,R},0}, 
  {{R,R,R},{D3s,F3s,G3s},{s,s,s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F5s,R,R},0}, {{R,R,R},{R,R,R},{G5s,R,R},0}, 
    {{R,R,R},{F4s,A4s,R},{A5s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{G5s,R,R},0}, {{R,R,R},{F4s,A4s,R},{A5s,R,R},0}, 
    {{R,R,R},{R,R,R},{C6s,R,R},0}, {{R,R,R},{R,R,R},{D6s,R,R},0}, {{R,R,R},{F2s,R,R},{A5s,R,R},0}, {{R,R,R},{R,R,R},{G5s,R,R},0}, 
    {{s,s,s},{F4s,A4s,R},{A5s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F4s,R,R},{F2s,R,R},{R,R,R},0}, {{G4s,R,R},{R,R,R},{R,R,R},0}, 
  {{A4s,R,R},{A2s,D3s,F3s},{s,s,s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G4s,R,R},{R,R,R},{R,R,R},0}, {{F4s,R,R},{R,R,R},{R,R,R},0}, 
    {{F4s,R,R},{D5s,F5s,A5s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D4s,R,R},{s,s,s},{R,R,R},0}, {{F4,R,R},{R,R,R},{R,R,R},0}, 
    {{F4s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F4,R,R},{C3s,F3,G3s},{R,R,R},0}, {{D4s,R,R},{R,R,R},{R,R,R},0}, 
    {{C4s,R,R},{A5s,G5s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A3s,R,R},{C3s,R,R},{R,R,R},0}, {{C4s,R,R},{R,R,R},{R,R,R},0}, 
  {{D4s,R,R},{D3s,F3s,A3s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F4,R,R},{R,R,R},{R,R,R},0}, {{F4s,R,R},{R,R,R},{R,R,R},0}, 
    {{F4,R,R},{F5s,D5s,A5s},{R,R,R},0}, {{C4s,R,R},{R,R,R},{R,R,R},0}, {{C4s,R,R},{s,s,s},{R,R,R},0}, {{D4s,R,R},{R,R,R},{R,R,R},0}, 
    {{C4s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{F2s,C3s,F3s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D4s,R,R},{s,s,s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{F2s,R,R},{R,R,R},0}, {{C4s,R,R},{R,R,R},{R,R,R},0}, 
  {{R,R,R},{B2,D3s,F3s},{s,s,s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{B3,D4s,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{D5s,F5s,A5s},{R,R,R},0}, {{D4s,F4s,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F4,G4s,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{C3s,F3,G3s},{R,R,R},0}, {{F4s,A4s,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C5s,F5,G5s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F4,G4s,R},{C3s,R,R},{s,s,s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{R,R,R},{D3s,F3s,A3s},{s,s,s},0}, {{D4s,F4s,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{s,s,s},{R,R,R},{D5s,F5s,A5s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{D2s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F5s,R,R},0}, {{R,R,R},{R,R,R},{G5s,R,R},0}, {{F3s,R,R},{s,s,s},{A5s,R,R},0}, {{C4s,R,R},{R,R,R},{R,R,R},0}, 
    {{F4s,R,R},{R,R,R},{C6s,R,R},0}, {{G4s,R,R},{R,R,R},{R,R,R},0}, {{A4s,R,R},{R,R,R},{A5s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{D5s,A5s,F5s},{B1,F2s,B2},{D6s,R,R},_V[9]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{B2,R,R},{R,R,R},0}, {{R,R,R},{F3s,R,R},{R,R,R},0}, 
    {{C5s,C6s,R},{B3,D4s,R},{s,s,s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{B4,B5,R},{R,R,R},{R,R,R},0}, {{R,R,R},{B3,D4s,R},{R,R,R},0}, 
    {{A4s,A5s,R},{s,s,s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{C2s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G4s,G5s,R},{F3,G3s,C4s},{R,R,R},0}, {{A4s,A5s,R},{R,R,R},{R,R,R},0}, {{B4,B5,R},{C2s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{R,R,R},{D2s,A2s,D3s},{s,s,s},0}, {{A4s,A5s,R},{R,R,R},{R,R,R},0}, {{G4s,G5s,R},{D3s,R,R},{R,R,R},0}, {{F4s,F5s,R},{F3s,R,R},{R,R,R},0}, 
    {{R,R,R},{A3s,C4s,R},{R,R,R},0}, {{G4s,G5s,R},{R,R,R},{R,R,R},0}, {{A4s,A5s,R},{R,R,R},{R,R,R},0}, {{B4,B5,R},{A3s,C4s,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{A4s,A5s,R},{R,R,R},{R,R,R},0}, {{G4s,G5s,R},{C2s,R,R},{R,R,R},0}, {{F4s,F5s,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{F3s,A3s,C4s},{R,R,R},0}, {{D4s,D5s,R},{R,R,R},{R,R,R},0}, {{F4,F5,R},{C2s,R,R},{R,R,R},0}, {{F4s,F5s,R},{R,R,R},{R,R,R},0}, 
  {{R,R,R},{B1,F2s,B2},{R,R,R},0}, {{F4,F5,R},{R,R,R},{R,R,R},0}, {{D4s,D5s,R},{B2,R,R},{R,R,R},0}, {{C4s,C5s,R},{F3s,R,R},{R,R,R},0}, 
    {{R,R,R},{B3,D4s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{B3,D4s,R},{R,R,R},0}, 
    {{B4,D5s,R},{s,s,s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{C2s,R,R},{R,R,R},0}, {{D5s,F5s,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{F3,G3s,C4s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5s,F4,R},{C2s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{R,R,R},{D2s,A2s,D3s},{R,R,R},0}, {{A4s,C5s,R},{R,R,R},{R,R,R},0}, {{R,R,R},{D3s,R,R},{R,R,R},0}, {{R,R,R},{F3s,R,R},{R,R,R},0}, 
    {{F4s,A4s,R},{A3s,C4s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A4s,D5s,R},{A3s,C4s,R},{R,R,R},0}, 
    {{D4s,R,R},{R,R,R},{R,R,R},0}, {{F4s,R,R},{R,R,R},{R,R,R},0}, {{G4s,R,R},{F2s,R,R},{R,R,R},0}, {{A4s,R,R},{R,R,R},{R,R,R},0}, 
    {{C5s,R,R},{A3s,C4s,R},{R,R,R},0}, {{G5s,R,R},{R,R,R},{R,R,R},0}, {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{A5s,D6s,R},{B2,F3s,B3},{s,s,s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5s,C6s,R},{F4s,A3s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5s,B5,R},{F4s,A3s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F5s,A5s,R},{F4s,A3s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{F4s,A3s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F5,G5s,R},{C3s,G3s,C4s},{R,R,R},0}, {{F5s,A5s,R},{R,R,R},{R,R,R},0}, {{G5s,B5,R},{F4,G4s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{R,R,R},{D3s,A3s,D4s},{s,s,s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{F4s,A4s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F5s,A5s,R},{F4s,A4s,R},{R,R,R},0}, {{F5,G5s,R},{R,R,R},{R,R,R},0}, {{F5s,A5s,R},{F4s,A4s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{F4s,A4s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{F4s,A4s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{s,s,s},{F2s,C3s,F3s},{F4,G4s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F4,G4s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{s,s,s},{B2,F3s,B3},{F4s,A4s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F4s,A4s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F4s,A4s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5s,B5,R},{s,s,s},{F4s,A4s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F5s,A5s,R},{R,R,R},{F4s,A4s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5,G5s,R},{R,R,R},{F4s,A4s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F5s,R,R},{C3s,G3s,C4s},{F4s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{F4s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{s,s,s},{B1,B2,R},{F4s,A4s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{B2,R,R},{R,R,R},0}, {{R,R,R},{D3s,R,R},{R,R,R},0}, 
    {{R,R,R},{F3s,A3s,R},{D4s,F4s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{B2,R,R},{R,R,R},0}, {{R,R,R},{F3s,A3s,R},{D4s,F4s,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{B1,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{F3s,A3s,R},{D4s,F4s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{B1,R,R},{R,R,R},0}, {{R,R,R},{F2s,R,R},{R,R,R},0}, 
  {{s,s,s},{B1,B2,R},{D4s,F4s,G4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{B2,R,R},{R,R,R},0}, {{R,R,R},{D3s,R,R},{R,R,R},0}, 
    {{R,R,R},{F3s,A3s,R},{D4s,F4s,G4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{B2,R,R},{R,R,R},0}, {{R,R,R},{F3s,A3s,R},{D4s,F4s,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{G4s,R,R},0}, {{R,R,R},{B1,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{F3s,A3s,R},{D4s,F4s,A4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{B1,R,R},{R,R,R},0}, {{R,R,R},{F2s,R,R},{R,R,R},0}, 
  {{C5s,R,R},{C2s,C3s,R},{C4s,F4s,G4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5s,R,R},{C3s,R,R},{s,s,s},0}, {{C5s,R,R},{F3s,R,R},{R,R,R},0}, 
    {{C5s,R,R},{G3s,C4s,R},{R,R,R},0}, {{C5s,R,R},{R,R,R},{R,R,R},0}, {{C5s,R,R},{C3s,R,R},{R,R,R},0}, {{C5s,R,R},{G3s,C4s,R},{R,R,R},0}, 
    {{D5s,R,R},{R,R,R},{R,R,R},0}, {{D5s,R,R},{R,R,R},{R,R,R},0}, {{D5s,R,R},{C2s,R,R},{R,R,R},0}, {{D5s,R,R},{R,R,R},{R,R,R},0}, 
    {{F4s,F5s,R},{G3s,C4s,R},{R,R,R},0}, {{F4s,F5s,R},{R,R,R},{R,R,R},0}, {{F4s,F5s,R},{C3s,R,R},{R,R,R},0}, {{F4s,F5s,R},{R,R,R},{R,R,R},0}, 
  {{G4s,C5s,G5s},{C1s,C2s,R},{s,s,s},_V[10]}, {{G4s,G5s,R},{R,R,R},{R,R,R},0}, {{G4s,G5s,R},{C1s,R,R},{R,R,R},0}, {{G4s,G5s,R},{R,R,R},{R,R,R},0}, 
    {{A4s,C5s,A5s},{C1s,C2s,R},{R,R,R},0}, {{A4s,A5s,R},{R,R,R},{R,R,R},0}, {{A4s,A5s,R},{C1s,R,R},{R,R,R},0}, {{A4s,A5s,R},{R,R,R},{R,R,R},0}, 
    {{C5s,C6s,R},{C1s,C2s,R},{R,R,R},0}, {{C5s,C6s,R},{R,R,R},{R,R,R},0}, {{C5s,C6s,R},{C1s,R,R},{R,R,R},0}, {{C5s,C6s,R},{R,R,R},{R,R,R},0}, 
    {{A5s,A6s,R},{s,s,s},{R,R,R},0}, {{s,s,s},{R,R,R},{R,R,R},0}, {{C6s,C7s,R},{R,R,R},{R,R,R},0}, {{A5s,A6s,R},{R,R,R},{R,R,R},0}, 
  {{G5s,G6s,R},{B1,F2s,B2},{s,s,s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,F6s,R},{B2,R,R},{R,R,R},0}, {{R,R,R},{D3s,R,R},{R,R,R},0}, 
    {{D5s,D6s,R},{F3s,A3s,R},{R,R,R},0}, {{F5s,F6s,R},{s,s,s},{R,R,R},0}, {{s,s,s},{R,R,R},{R,R,R},0}, {{G5s,G6s,R},{F3s,A3s,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{C2s,R,R},{R,R,R},0}, {{R,R,R},{F3,G3s,C4s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5s,A6s,R},{C3s,R,R},{R,R,R},0}, {{R,R,R},{F3,G3s,C4s},{R,R,R},0}, {{C6s,C7s,R},{R,R,R},{R,R,R},0}, {{A5s,A6s,R},{R,R,R},{R,R,R},0}, 
  {{G5s,G6s,R},{D2s,A2s,D3s},{R,R,R},_V[11]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,F6s,R},{R,R,R},{R,R,R},0}, {{R,R,R},{D3s,R,R},{R,R,R},0}, 
    {{C5s,C6s,R},{F3s,A3s,R},{R,R,R},0}, {{F5s,F6s,R},{s,s,s},{R,R,R},0}, {{s,s,s},{R,R,R},{R,R,R},0}, {{F5s,F6s,R},{F3s,A3s,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{A1s,R,R},{R,R,R},0}, {{R,R,R},{F3s,A3s,C4s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5s,A6s,R},{s,s,s},{R,R,R},0}, {{R,R,R},{F3s,A3s,C4s},{R,R,R},0}, {{C6s,C7s,R},{R,R,R},{R,R,R},0}, {{A5s,A6s,R},{R,R,R},{R,R,R},0}, 
  {{G5s,G6s,R},{B1,F2s,B2},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{B2,R,R},{R,R,R},0}, {{R,R,R},{D3s,R,R},{R,R,R},0}, 
    {{A5s,A6s,R},{F3s,A3s,C4s},{R,R,R},0}, {{C6s,C7s,R},{s,s,s},{R,R,R},0}, {{s,s,s},{R,R,R},{R,R,R},0}, {{C6s,C7s,R},{F3s,A3s,C4s},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{D6s,D7s,R},{C2s,R,R},{R,R,R},0}, {{R,R,R},{F3,G3s,C4s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,C7s,R},{F3,G3s,C4s},{R,R,R},0}, {{B5,B6,R},{R,R,R},{R,R,R},0}, {{A5s,A6s,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{R,R,R},{D2s,A2s,D3s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5s,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{D3s,R,R},{R,R,R},0}, 
    {{C6s,R,R},{F3s,A3s,C4s},{R,R,R},0}, {{D6s,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{G5s,R,R},{F3s,A3s,C4s},{R,R,R},0}, 
    {{A5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{F1s,F2s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5s,A6s,R},{F3s,A3s,C4s},{R,R,R},0}, {{R,R,R},{F3s,R,R},{R,R,R},0}, {{C6s,C7s,R},{F2s,R,R},{R,R,R},0}, {{A5s,A6s,R},{R,R,R},{R,R,R},0}, 
  {{G5s,G6s,R},{B1,F2s,B2},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,F6s,R},{B2,R,R},{R,R,R},0}, {{R,R,R},{D3s,R,R},{R,R,R},0}, 
    {{D5s,D6s,R},{F3s,A3s,R},{R,R,R},0}, {{F5s,F6s,R},{s,s,s},{R,R,R},0}, {{s,s,s},{R,R,R},{R,R,R},0}, {{G5s,G6s,R},{F3s,A3s,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{C2s,R,R},{R,R,R},0}, {{R,R,R},{F3,G3s,C4s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5s,A6s,R},{C3s,R,R},{R,R,R},0}, {{R,R,R},{F3,G3s,C4s},{R,R,R},0}, {{C6s,C7s,R},{R,R,R},{R,R,R},0}, {{A5s,A6s,R},{R,R,R},{R,R,R},0}, 
  {{G5s,G6s,R},{D2s,A2s,D3s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,F6s,R},{R,R,R},{R,R,R},0}, {{R,R,R},{D3s,R,R},{R,R,R},0}, 
    {{C5s,C6s,R},{F3s,A3s,R},{R,R,R},0}, {{F5s,F6s,R},{s,s,s},{R,R,R},0}, {{s,s,s},{R,R,R},{R,R,R},0}, {{F5s,F6s,R},{F3s,A3s,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{A1s,R,R},{R,R,R},0}, {{R,R,R},{F3s,A3s,C4s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F5s,F6s,R},{s,s,s},{R,R,R},0}, {{F5,F6,R},{F3s,A3s,C4s},{R,R,R},0}, {{D5s,D6s,R},{R,R,R},{R,R,R},0}, {{F5,F6,R},{R,R,R},{R,R,R},0}, 
  {{D5s,D6s,R},{B1,F2s,B2},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{B2,R,R},{R,R,R},0}, {{R,R,R},{D3s,R,R},{R,R,R},0}, 
    {{G5s,G6s,R},{F3s,A3s,R},{R,R,R},0}, {{R,R,R},{s,s,s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{F3s,A3s,R},{R,R,R},0}, 
    {{F5,F6,R},{R,R,R},{R,R,R},0}, {{R,R,R},{C2s,R,R},{R,R,R},0}, {{D5s,D6s,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F5,F6,R},{F3,G3s,C4s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5,C6s,F6},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{R,R,R},{B1,B2,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,F6s,R},{R,R,R},{R,R,R},0}, {{R,R,R},{F2s,R,R},{R,R,R},0}, 
    {{F5s,C6s,F6s},{C2s,C3s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{G2s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{F5s,A5s,R},{D2s,A2s,D3s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{D2s,R,R},{R,R,R},0}, {{R,R,R},{D3s,R,R},{R,R,R},0}, 
    {{F3s,A3s,C4s},{D2s,R,R},{R,R,R},0}, {{R,R,R},{D3s,R,R},{R,R,R},0}, {{R,R,R},{A2s,R,R},{R,R,R},0}, {{R,R,R},{D2s,R,R},{R,R,R},0}, 
  {{s,s,s},{B1,F2s,B2},{s,s,s},_V[9]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{C5s,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{C4s,F4s,C5s},{R,R,R},0}, {{A5s,R,R},{G4s,R,R},{R,R,R},0}, {{G5s,R,R},{F4s,R,R},{R,R,R},0}, {{F5s,R,R},{G4s,R,R},{R,R,R},0}, 
    {{C6s,R,R},{G4s,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{G5s,R,R},{B2,F3s,C4s},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{A3s,R,R},{R,R,R},0}, {{A5s,R,R},{B2,G3s,R},{R,R,R},0}, {{G5s,R,R},{F3s,R,R},{R,R,R},0}, {{F5s,R,R},{G3s,R,R},{R,R,R},0}, 
  {{s,s,s},{B1,F2s,B2},{G3s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{C5s,R,R},{s,s,s},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{C4s,F4s,C5s},{R,R,R},0}, {{A5s,R,R},{G4s,R,R},{R,R,R},0}, {{G5s,R,R},{F4s,R,R},{R,R,R},0}, {{F5s,R,R},{G4s,R,R},{R,R,R},0}, 
    {{C6s,R,R},{G4s,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{G5s,R,R},{B2,F3s,C4s},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{A3s,R,R},{R,R,R},0}, {{A5s,R,R},{B2,G3s,R},{R,R,R},0}, {{G5s,R,R},{F3s,R,R},{R,R,R},0}, {{F5s,R,R},{G3s,R,R},{R,R,R},0}, 
  {{s,s,s},{C2s,G2s,C3s},{G3s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{C5s,R,R},{s,s,s},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{C4s,F4,A4s},{R,R,R},0}, {{B5,R,R},{G4s,R,R},{R,R,R},0}, {{A5s,R,R},{F4s,R,R},{R,R,R},0}, {{G5s,R,R},{G4s,R,R},{R,R,R},0}, 
    {{C6s,R,R},{G4s,R,R},{R,R,R},0}, {{B5,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{C3s,F3,C4s},{R,R,R},0}, {{G5s,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{A3s,R,R},{R,R,R},0}, {{B5,R,R},{C3s,G3s,R},{R,R,R},0}, {{A5s,R,R},{F3s,R,R},{R,R,R},0}, {{G5s,R,R},{G3s,R,R},{R,R,R},0}, 
  {{s,s,s},{C2s,G2s,C3s},{s,s,s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{D5s,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{F4,A4s,C5s},{R,R,R},0}, {{B5,R,R},{A4s,R,R},{R,R,R},0}, {{A5s,R,R},{A4s,R,R},{R,R,R},0}, {{G5s,R,R},{C5s,R,R},{R,R,R},0}, 
    {{C6s,R,R},{C5s,R,R},{R,R,R},0}, {{B5,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{C3s,F3,D4s},{R,R,R},0}, {{G5s,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{C4s,R,R},{R,R,R},0}, {{B5,R,R},{C3s,A3s,R},{R,R,R},0}, {{A5s,R,R},{C3s,A3s,R},{R,R,R},0}, {{G5s,R,R},{C3s,C4s,R},{R,R,R},0}, 
  {{s,s,s},{D2s,A2s,C3s},{C4s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{C5s,R,R},{s,s,s},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{D4s,F4s,A4s},{R,R,R},0}, {{B5,R,R},{F4s,R,R},{R,R,R},0}, {{A5s,R,R},{F4s,R,R},{R,R,R},0}, {{G5s,R,R},{G4s,R,R},{R,R,R},0}, 
    {{C6s,R,R},{G4s,R,R},{R,R,R},0}, {{B5,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{C3s,F3s,C4s},{R,R,R},0}, {{G5s,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{A3s,R,R},{R,R,R},0}, {{B5,R,R},{C3s,F3s,R},{R,R,R},0}, {{A5s,R,R},{C3s,F3s,R},{R,R,R},0}, {{G5s,R,R},{C3s,G3s,R},{R,R,R},0}, 
  {{s,s,s},{D2s,A2s,C3s},{G3s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{C5s,R,R},{s,s,s},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, 
    {{D6s,R,R},{D4s,F4s,A4s},{R,R,R},0}, {{C6s,R,R},{F4s,R,R},{R,R,R},0}, {{B5,R,R},{F4s,R,R},{R,R,R},0}, {{A5s,R,R},{G4s,R,R},{R,R,R},0}, 
    {{D6s,R,R},{G4s,R,R},{R,R,R},0}, {{C6s,R,R},{R,R,R},{R,R,R},0}, {{B5,R,R},{C3s,F3s,C4s},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, 
    {{D6s,R,R},{A3s,R,R},{R,R,R},0}, {{C6s,R,R},{C3s,F3s,R},{R,R,R},0}, {{B5,R,R},{C3s,F3s,R},{R,R,R},0}, {{A5s,R,R},{C3s,G3s,R},{R,R,R},0}, 
  {{s,s,s},{F2,C3s,F3},{G3s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{C5s,R,R},{s,s,s},0}, {{G5s,R,R},{R,R,R},{R,R,R},0}, 
    {{F6,R,R},{C4s,F4,A4s},{R,R,R},0}, {{D6s,R,R},{F4s,R,R},{R,R,R},0}, {{C6s,R,R},{F4s,R,R},{R,R,R},0}, {{G5s,R,R},{G4s,R,R},{R,R,R},0}, 
    {{F6,R,R},{G4s,R,R},{R,R,R},0}, {{D6s,R,R},{R,R,R},{R,R,R},0}, {{C6s,R,R},{F3s,F4s,R},{R,R,R},0}, {{G5s,R,R},{G3s,G4s,R},{R,R,R},0}, 
    {{F6,R,R},{A3s,A4s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{B3,B4,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{s,s,s},{C2s,G2s,C3s},{s,s,s},_V[10]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5s,F5,C6s},{G3s,G4s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5s,F5,C6s},{G3s,G4s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5s,F5,C6s},{C2s,C3s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5s,F5,C6s},{C2s,C3s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5s,F5,C6s},{C2s,C3s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5s,F5,C6s},{C2s,C3s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  //Part 3
{{G5s,R,R},{s,s,s},{B3,F4s,A4s},_V[5]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{C4s,G4s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5s,R,R},{R,R,R},{D4s,A4s,C5s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{F3s,C4s,A4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5s,R,R},{R,R,R},{B3,F4s,A4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{C4s,G4s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5s,R,R},{R,R,R},{D4s,A4s,C5s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5s,R,R},{R,R,R},{A3s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{C4s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5s,R,R},{D4s,R,R},{B2,F3s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{F4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{G4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{F4,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{C4s,R,R},{C3s,F3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{B3,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5s,R,R},{A3s,R,R},{D3s,F3s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{C4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{F4,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D6s,R,R},{F4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{F2s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5s,R,R},{F4s,R,R},{F3s,A3s,D4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{F4,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5s,R,R},{D4s,R,R},{B2,F3s,R},_V[6]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{F4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{F4,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{C4s,R,R},{C3s,F3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{G3s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{C4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5s,R,R},{R,R,R},{D3s,F3s,A3s},_V[7]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{s,s,s},{F2s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A4s,R,R},{A3s,R,R},{F3s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5s,R,R},{C4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{s,s,s},{D4s,R,R},{B2,F3s,R},_V[8]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5s,C6s,R},{F4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{G4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5s,D6s,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{F4,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5s,C6s,R},{C4s,R,R},{C3s,F3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{B3,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{s,s,s},{A3s,R,R},{D3s,F3s,R},_V[9]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{C4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5s,C6s,R},{F4,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{F4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5s,D6s,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{F2s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5s,C6s,R},{F4s,R,R},{F3s,A3s,D4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{F4,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{s,s,s},{D4s,R,R},{B2,F3s,R},_V[10]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5s,C6s,R},{F4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5s,D6s,R},{F4,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{C4s,R,R},{C3s,F3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5s,F6,R},{R,R,R},{G3s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{C4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{C6s,G6s,R},{s,s,s},{C2s,C3s,R},_V[11]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,F6s,R},{R,R,R},{C2s,C3s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,F6,R},{R,R,R},{C2s,C3s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{s,s,s},{A4s,R,R},{s,s,s},0}, {{R,R,R},{s,s,s},{R,R,R},0}, {{R,R,R},{C5s,R,R},{R,R,R},0}, {{R,R,R},{A4s,R,R},{R,R,R},0}, 
  {{s,s,s},{G4s,R,R},{B1,B2,R},_V[12]}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{C6s,R,R},{F4s,R,R},{R,R,R},0}, {{G5s,R,R},{R,R,R},{R,R,R},0}, 
    {{A5s,R,R},{D4s,R,R},{F3s,B3,R},0}, {{F5s,R,R},{F4s,R,R},{R,R,R},0}, {{G5s,R,R},{R,R,R},{R,R,R},0}, {{D5s,R,R},{G4s,R,R},{R,R,R},0}, 
    {{F5s,R,R},{R,R,R},{R,R,R},0}, {{C5s,R,R},{R,R,R},{R,R,R},0}, {{D5s,R,R},{R,R,R},{C2s,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{A4s,R,R},{G3s,C4s,F4},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{C5s,R,R},{R,R,R},0}, {{R,R,R},{A4s,R,R},{R,R,R},0}, 
  {{s,s,s},{G4s,R,R},{D2s,D3s,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{C6s,R,R},{F4s,R,R},{R,R,R},0}, {{G5s,R,R},{R,R,R},{R,R,R},0}, 
    {{A5s,R,R},{C4s,R,R},{F3s,A3s,R},0}, {{F5s,R,R},{F4s,R,R},{R,R,R},0}, {{G5s,R,R},{R,R,R},{R,R,R},0}, {{D5s,R,R},{F4s,R,R},{R,R,R},0}, 
    {{F5s,R,R},{R,R,R},{R,R,R},0}, {{C5s,R,R},{R,R,R},{R,R,R},0}, {{D5s,R,R},{R,R,R},{A1s,A2s,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, 
    {{C5s,F5s,R},{F4s,R,R},{A4s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5s,R,R},{R,R,R},{R,R,R},0}, {{A4s,R,R},{R,R,R},{s,s,s},0}, 
  {{s,s,s},{G4s,R,R},{B1,B2,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{C6s,R,R},{R,R,R},{R,R,R},0}, {{G5s,R,R},{R,R,R},{R,R,R},0}, 
    {{A5s,R,R},{F4s,A4s,R},{s,s,s},0}, {{F5s,R,R},{F4s,C5s,R},{R,R,R},0}, {{G5s,R,R},{R,R,R},{R,R,R},0}, {{D5s,R,R},{C5s,R,R},{F4s,R,R},0}, 
    {{A5s,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{D5s,R,R},{R,R,R},0}, {{G5s,R,R},{R,R,R},{C2s,R,R},0}, {{D6s,R,R},{R,R,R},{R,R,R},0}, 
    {{C5s,R,R},{C5s,R,R},{C4s,F4,G4s},0}, {{B4,R,R},{B4,R,R},{R,R,R},0}, {{A4s,R,R},{A4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{s,s,s},{s,s,s},{D2s,D3s,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{C6s,R,R},{R,R,R},{R,R,R},0}, {{G5s,R,R},{R,R,R},{R,R,R},0}, 
    {{A5s,R,R},{R,R,R},{D3s,F3s,A3s},0}, {{C6s,R,R},{R,R,R},{R,R,R},0}, {{D6s,R,R},{R,R,R},{R,R,R},0}, {{F6s,R,R},{R,R,R},{D3s,F3s,A3s},0}, 
    {{F6,R,R},{R,R,R},{R,R,R},0}, {{C6s,R,R},{R,R,R},{R,R,R},0}, {{D6s,R,R},{R,R,R},{F1s,F2s,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, 
    {{F4s,C6s,R},{R,R,R},{A4s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{C5s,R,R},{R,R,R},0}, {{R,R,R},{A4s,R,R},{s,s,s},0}, 
  {{s,s,s},{G4s,R,R},{B1,B2,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{C6s,R,R},{F4s,R,R},{R,R,R},0}, {{G5s,R,R},{R,R,R},{R,R,R},0}, 
    {{A5s,R,R},{D4s,R,R},{F3s,B3,R},0}, {{F5s,R,R},{F4s,R,R},{R,R,R},0}, {{G5s,R,R},{R,R,R},{R,R,R},0}, {{D5s,R,R},{G4s,R,R},{R,R,R},0}, 
    {{F5s,R,R},{R,R,R},{R,R,R},0}, {{C5s,R,R},{R,R,R},{R,R,R},0}, {{D5s,R,R},{R,R,R},{C2s,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{A4s,R,R},{G3s,C4s,F4},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{C5s,R,R},{R,R,R},0}, {{R,R,R},{A4s,R,R},{R,R,R},0}, 
  {{s,s,s},{G4s,R,R},{D2s,D3s,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{C6s,R,R},{F4s,R,R},{R,R,R},0}, {{G5s,R,R},{R,R,R},{R,R,R},0}, 
    {{A5s,R,R},{C4s,R,R},{F3s,A3s,R},0}, {{F5s,R,R},{F4s,R,R},{R,R,R},0}, {{G5s,R,R},{R,R,R},{R,R,R},0}, {{D5s,R,R},{F4s,R,R},{R,R,R},0}, 
    {{F5s,R,R},{R,R,R},{R,R,R},0}, {{C5s,R,R},{R,R,R},{R,R,R},0}, {{D5s,R,R},{R,R,R},{A1s,A2s,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, 
    {{s,s,s},{F4s,R,R},{A3s,C4s,R},0}, {{R,R,R},{F4,R,R},{R,R,R},0}, {{R,R,R},{D4s,R,R},{R,R,R},0}, {{R,R,R},{F4,R,R},{R,R,R},0}, 
  {{s,s,s},{D4s,R,R},{B1,B2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{B2,R,R},0}, {{R,R,R},{R,R,R},{D3s,R,R},0}, 
    {{R,R,R},{G4s,G5s,R},{F3s,A3s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F3s,A3s,R},0}, 
    {{R,R,R},{F4,F5,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2s,R,R},0}, {{R,R,R},{D4s,D5s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{F4,F5,R},{F3,G3s,C4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{F4,C5s,F5},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{s,s,s},{R,R,R},{B1,B2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{F4s,F5s,R},{F2s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{F4s,G4s,F5s},{C2s,C3s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{G2s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{C4s,F4s,A4s},{D2s,A2s,D3s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{C4s,R,R},{R,R,R},0}, {{R,R,R},{G4s,R,R},{R,R,R},0}, 
    {{R,R,R},{C5s,R,R},{F3s,A3s,R},0}, {{R,R,R},{G5s,R,R},{D3s,R,R},0}, {{R,R,R},{C6s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2s,R,R},0}, 
  {{D6s,R,R},{D5s,F5s,A5s},{B1,F2s,B2},_V[13]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{B2,R,R},0}, {{R,R,R},{R,R,R},{D3s,R,R},0}, 
    {{s,s,s},{C5s,C6s,R},{F3s,A3s,R},0}, {{R,R,R},{D5s,D6s,R},{R,R,R},0}, {{R,R,R},{F5s,F6s,R},{D3s,R,R},0}, {{R,R,R},{R,R,R},{F3s,A3s,R},0}, 
    {{R,R,R},{G5s,G6s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2s,G2s,C3s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{A5s,A6s,R},{G3s,C4s,R},0}, {{R,R,R},{R,R,R},{C3s,R,R},0}, {{R,R,R},{F6s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{s,s,s},{F5s,A5s,F6s},{D2s,A2s,D3s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D3s,R,R},0}, {{R,R,R},{R,R,R},{F3s,R,R},0}, 
    {{R,R,R},{A5s,A6s,R},{A3s,C4s,R},0}, {{R,R,R},{G5s,G6s,R},{R,R,R},0}, {{R,R,R},{F5s,F6s,R},{F3s,R,R},0}, {{R,R,R},{R,R,R},{A3s,C4s,R},0}, 
    {{R,R,R},{G5s,G6s,R},{s,s,s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1s,A2s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{C6s,C7s,R},{F3s,A3s,R},0}, {{R,R,R},{R,R,R},{A2s,R,R},0}, {{R,R,R},{A6s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{A6s,R,R},{A5s,C6s,F6s},{B1,F2s,B2},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{B2,R,R},0}, {{R,R,R},{R,R,R},{D3s,R,R},0}, 
    {{s,s,s},{F5s,F6s,R},{F3s,A3s,R},0}, {{R,R,R},{F5,F6,R},{R,R,R},0}, {{R,R,R},{C5s,C6s,R},{D3s,R,R},0}, {{R,R,R},{R,R,R},{F3s,A3s,R},0}, 
    {{R,R,R},{D5s,D6s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2s,G2s,C3s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{C5s,C6s,R},{G3s,C4s,R},0}, {{R,R,R},{R,R,R},{C3s,R,R},0}, {{R,R,R},{A5s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{C6s,R,R},{C5s,F5s,G5s},{D2s,A2s,D3s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{s,s,s},{F4s,R,R},{D3s,R,R},0}, {{R,R,R},{G4s,R,R},{F3s,R,R},0}, 
    {{R,R,R},{A4s,R,R},{A3s,C4s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{G4s,R,R},{F3s,R,R},0}, {{R,R,R},{A4s,R,R},{A3s,C4s,R},0}, 
    {{R,R,R},{B4,R,R},{s,s,s},0}, {{R,R,R},{G4s,R,R},{R,R,R},0}, {{R,R,R},{A4s,R,R},{F1s,F2s,R},0}, {{R,R,R},{B4,R,R},{R,R,R},0}, 
    {{R,R,R},{C5s,R,R},{A3s,C4s,R},0}, {{R,R,R},{D5s,R,R},{F3s,R,R},0}, {{R,R,R},{A4s,R,R},{F2s,R,R},0}, {{R,R,R},{G4s,R,R},{R,R,R},0}, 
  {{D6s,R,R},{D5s,F5s,A5s},{B1,F2s,B2},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{B2,R,R},0}, {{R,R,R},{R,R,R},{D3s,R,R},0}, 
    {{s,s,s},{C5s,C6s,R},{F3s,A3s,R},0}, {{R,R,R},{D5s,D6s,R},{R,R,R},0}, {{R,R,R},{F5s,F6s,R},{D3s,R,R},0}, {{R,R,R},{R,R,R},{F3s,A3s,R},0}, 
    {{R,R,R},{G5s,G6s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2s,G2s,C3s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{A5s,A6s,R},{G3s,C4s,R},0}, {{R,R,R},{R,R,R},{C3s,R,R},0}, {{R,R,R},{F6s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{s,s,s},{F5s,A5s,F6s},{D2s,A2s,D3s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D3s,R,R},0}, {{R,R,R},{R,R,R},{F3s,R,R},0}, 
    {{R,R,R},{A5s,A6s,R},{A3s,C4s,R},0}, {{R,R,R},{G5s,G6s,R},{R,R,R},0}, {{R,R,R},{F5s,F6s,R},{F3s,R,R},0}, {{R,R,R},{R,R,R},{A3s,C4s,R},0}, 
    {{R,R,R},{G5s,G6s,R},{s,s,s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1s,A2s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{C6s,C7s,R},{F3s,A3s,R},0}, {{R,R,R},{R,R,R},{A2s,R,R},0}, {{R,R,R},{D6s,R,R},{R,R,R},0}, {{R,R,R},{F6s,R,R},{R,R,R},0}, 
  {{D7s,R,R},{D6s,F6s,A6s},{B1,F2s,B2},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{B2,R,R},0}, {{R,R,R},{R,R,R},{D3s,R,R},0}, 
    {{R,R,R},{R,R,R},{F3s,A3s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{s,s,s},{A5s,A6s,R},{D3s,R,R},0}, {{R,R,R},{R,R,R},{F3s,A3s,R},0}, 
    {{R,R,R},{G5s,F6,G6s},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2s,G2s,C3s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{G3s,C4s,R},0}, {{R,R,R},{R,R,R},{C3s,R,R},0}, {{R,R,R},{F5s,F6s,R},{R,R,R},0}, {{R,R,R},{G5s,G6s,R},{R,R,R},0}, 
  {{A6s,R,R},{A5s,D6s,F6s},{B1,B2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F2s,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C2s,C3s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{s,s,s},{G5s,G6s,R},{G2s,R,R},0}, {{R,R,R},{F5s,F6s,R},{R,R,R},0}, 
    {{F6s,R,R},{F5s,G5s,D6s},{D2s,A2s,D3s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{s,s,s},{F4s,R,R},{R,R,R},0}, {{R,R,R},{G4s,R,R},{R,R,R},0}, 
    {{R,R,R},{A4s,R,R},{D3s,R,R},0}, {{R,R,R},{G4s,R,R},{F3s,R,R},0}, {{R,R,R},{A4s,R,R},{A3s,R,R},0}, {{R,R,R},{C5s,R,R},{C4s,R,R},0}, 
  {{s,s,s},{F4s,A4s,D5s},{B3,R,R},_V[10]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{C5s,R,R},{B3,R,R},0}, {{R,R,R},{D5s,R,R},{C4s,R,R},0}, {{R,R,R},{F5s,R,R},{C4s,R,R},0}, {{R,R,R},{s,s,s},{s,s,s},0}, 
    {{R,R,R},{G5s,R,R},{F4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{C5s,F5,A5s},{F3,G3s,C4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{F5s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{s,s,s},{A4s,D5s,F5s},{D3s,F3s,A3s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{A5s,R,R},{F4s,R,R},0}, {{R,R,R},{G5s,R,R},{F4,R,R},0}, {{R,R,R},{F5s,R,R},{D4s,R,R},0}, {{R,R,R},{s,s,s},{s,s,s},0}, 
    {{R,R,R},{G5s,R,R},{F4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{F5,G5s,C6s},{A2s,F4,G3s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{A5s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{s,s,s},{F5s,A5s,R},{B2,F3s,A3s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{F5s,R,R},{D4s,R,R},0}, {{R,R,R},{F5,R,R},{C4s,R,R},0}, {{R,R,R},{C5s,R,R},{A3s,R,R},0}, {{R,R,R},{s,s,s},{s,s,s},0}, 
    {{R,R,R},{D5s,R,R},{B3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C4s,R,R},{F4,C5s,R},{C3s,F3,G3s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{A4s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{s,s,s},{D4s,A4s,C5s},{D3s,F3s,A3s},_V[11]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{F5s,R,R},{R,R,R},0}, {{R,R,R},{G5s,R,R},{R,R,R},0}, 
    {{R,R,R},{A5s,R,R},{F4s,A4s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{G5s,R,R},{R,R,R},0}, {{R,R,R},{A5s,R,R},{F4s,A4s,R},0}, 
    {{R,R,R},{B5,R,R},{R,R,R},0}, {{R,R,R},{G5s,R,R},{R,R,R},0}, {{R,R,R},{A5s,R,R},{F2s,F3s,R},0}, {{R,R,R},{B5,R,R},{R,R,R},0}, 
    {{R,R,R},{C6s,R,R},{A3s,C4s,R},0}, {{R,R,R},{D6s,R,R},{F3s,R,R},0}, {{R,R,R},{A5s,R,R},{F2s,R,R},0}, {{R,R,R},{G5s,R,R},{R,R,R},0}, 
  {{R,R,R},{D4s,F4s,D5s},{B1,F2s,B2},_V[12]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{B2,R,R},0}, {{R,R,R},{R,R,R},{D3s,R,R},0}, 
    {{R,R,R},{C4s,C5s,R},{F3s,A3s,R},0}, {{R,R,R},{D4s,D5s,R},{R,R,R},0}, {{R,R,R},{F4s,F5s,R},{D3s,R,R},0}, {{R,R,R},{R,R,R},{F3s,A3s,R},0}, 
    {{R,R,R},{G4s,G5s,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2s,G2s,C3s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{A4s,A5s,R},{G3s,C4s,R},0}, {{R,R,R},{R,R,R},{C3s,R,R},0}, {{R,R,R},{F5s,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  
  {{R,R,R},{F4s,A4s,F5s},{D2s,A2s,D3s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D3s,R,R},0}, {{R,R,R},{R,R,R},{F3s,R,R},0}, 
    {{R,R,R},{A4s,A5s,R},{A3s,C4s,R},0}, {{R,R,R},{G4s,G5s,R},{R,R,R},0}, {{R,R,R},{F4s,F5s,R},{F3s,R,R},0}, {{R,R,R},{R,R,R},{A3s,A4s,R},0}, 
    {{R,R,R},{G4s,G5s,R},{s,s,s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1s,A2s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{C5s,C6s,R},{F3s,F4s,R},0}, {{R,R,R},{R,R,R},{A2s,R,R},0}, {{R,R,R},{D5s,R,R},{R,R,R},0}, {{R,R,R},{F5s,R,R},{R,R,R},0}, 
  
  {{R,R,R},{D5s,F5s,A5s},{B1,F2s,B2},_V[13]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{D5s,D6s,R},{B2,R,R},0}, {{R,R,R},{D5s,D6s,R},{D3s,R,R},0}, 
    {{R,R,R},{D5s,D6s,R},{F3s,A3s,R},0}, {{R,R,R},{D5s,D6s,R},{R,R,R},0}, {{R,R,R},{D5s,D6s,R},{D3s,R,R},0}, {{R,R,R},{D5s,D6s,R},{F3s,A3s,R},0}, 
    {{R,R,R},{F5,F6,R},{R,R,R},0}, {{R,R,R},{F5,F6,R},{R,R,R},0}, {{R,R,R},{F5,F6,R},{C2s,G2s,C3s},0}, {{R,R,R},{F5,F6,R},{R,R,R},0}, 
    {{R,R,R},{F5,F6,R},{F3,G3s,C4s},0}, {{R,R,R},{F5,F6,R},{C3s,R,R},0}, {{R,R,R},{F5s,F6s,R},{R,R,R},0}, {{R,R,R},{G5s,G6s,R},{R,R,R},0}, 
  {{R,R,R},{A5s,C6s,A6s},{B1,B2,R},0}, {{R,R,R},{A5s,C6s,A6s},{R,R,R},0}, {{R,R,R},{A5s,C6s,A6s},{F2s,R,R},0}, {{R,R,R},{A5s,C6s,A6s},{R,R,R},0}, 
    {{R,R,R},{A5s,C6s,A6s},{C2s,C3s,R},0}, {{R,R,R},{A5s,C6s,A6s},{R,R,R},0}, {{R,R,R},{G5s,G6s,R},{G2s,R,R},0}, {{R,R,R},{F5s,F6s,R},{R,R,R},0}, 
    {{R,R,R},{F5s,F6s,R},{D2s,A2s,D3s},0}, {{R,R,R},{F5s,A5s,F6s},{R,R,R},0}, {{R,R,R},{F5s,A5s,F6s},{D3s,R,R},0}, {{R,R,R},{F5s,A5s,F6s},{F3s,R,R},0}, 
    {{R,R,R},{F5s,A5s,F6s},{A3s,R,R},0}, {{R,R,R},{F5s,A5s,F6s},{C4s,R,R},0}, {{R,R,R},{F5s,A5s,F6s},{D4s,R,R},0}, {{R,R,R},{F5s,A5s,F6s},{F4s,R,R},0}, 
  {{G5s,R,R},{s,s,s},{B3,F4s,A4s},_V[5]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{C4s,G4s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5s,R,R},{R,R,R},{D4s,A4s,C5s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{F3s,C4s,A4s},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5s,R,R},{R,R,R},{B3,F4s,A4s},_V[4]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{C4s,G4s,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5s,R,R},{R,R,R},{D4s,A4s,C5s},_V[3]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{C6s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{F5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{A5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
};
void DSHH_MakeSound_0 (msc);
void DSHH_MakeSound_1 (msc);
void DSHH_MakeSound_2 (msc);
void DSHH_init (void)
{ //预处理指令
  _mp[R] = PA;
  _mp[P] = PA;
  _mp[s] = PA;
  _mp[0] = PA;
  _mp[ _V[1] ] = 0x1f;
  for(int i=2;i<=13;i++)
  {
    _mp[ _V[i] ] = _mp[ _V[i-1] ] + 8;
  }
}
void DSHH_MakeSound_0 (v_spo _m)
{  //第零通道
  int volume = 0x7F; // 音量
  //特判由休止符造成的停止发声 
  if( _m._v1 == s ){
    //与else语句的区别是停止后就不发声,打算用于休止符
    midiOutShortMsg ( handle, 0x7BB0 ); //midiOut短消息B类
  }
  //开始发声
  else {
    //发出新的声音之前先停止上一个声音
    midiOutShortMsg ( handle, 0x7BB0 ); //midiOut短消息B类
    //定义声音变量voice并发声
    if ( _m._v1 != R )
    {  // "_v1" 当然是不用判断的，但是为了保证队形整齐还是这么写了
      int voice = (volume << 16) | ( (_m._v1) << 8) | 0x90; //音量|音高|通道
      midiOutShortMsg ( handle, voice ); //midiOut短消息9类//演奏
    }
    if ( _m._v2 != R )
    {
      int voice = (volume << 16) | ( (_m._v2) << 8) | 0x90; //音量|音高|通道
      midiOutShortMsg ( handle, voice ); //midiOut短消息9类//演奏
    }
    if ( _m._v3 != R )
    {
      int voice = (volume << 16) | ( (_m._v3) << 8) | 0x90; //音量|音高|通道
      midiOutShortMsg ( handle, voice ); //midiOut短消息9类//演奏
    }
  }
}
void DSHH_MakeSound_1 (v_spo _m)
{  //第一通道
  int volume = 0x7F; // 音量

  //特判由休止符造成的停止发声 
  if( _m._v1 == s ){
    //与else语句的区别是停止后就不发声,打算用于休止符
    midiOutShortMsg ( handle, 0x7BB1 ); //midiOut短消息B类
  }
  //开始发声
  else {
    //发出新的声音之前先停止上一个声音
    midiOutShortMsg ( handle, 0x7BB1 ); //midiOut短消息B类
    //定义声音变量voice并发声
    if ( _m._v1 != R ) {  // "_v1" 当然是不用判断的，但是为了保证队形整齐还是这么写了
      int voice = (volume << 16) | ( (_m._v1) << 8) | 0x91; //音量|音高|通道
      midiOutShortMsg ( handle, voice ); //midiOut短消息9类//演奏
    }
    if ( _m._v2 != R ) {
      int voice = (volume << 16) | ( (_m._v2) << 8) | 0x91; //音量|音高|通道
      midiOutShortMsg ( handle, voice ); //midiOut短消息9类//演奏
    }
    if ( _m._v3 != R ) {
      int voice = (volume << 16) | ( (_m._v3) << 8) | 0x91; //音量|音高|通道
      midiOutShortMsg ( handle, voice ); //midiOut短消息9类//演奏
    }
  }
}
void DSHH_MakeSound_2 (v_spo _m)
{  //第二通道
  //特判由休止符造成的停止发声 
  int volume = 0x7F; // 音量
  if( _m._v1 == s ){
    //与else语句的区别是停止后就不发声,打算用于休止符
    midiOutShortMsg ( handle, 0x7BB2 ); //midiOut短消息B类
  }
  //开始发声
  else {
    //发出新的声音之前先停止上一个声音
    midiOutShortMsg ( handle, 0x7BB2 ); //midiOut短消息B类
    //定义声音变量voice并发声
    if ( _m._v1 != R ) {  // "_v1" 当然是不用判断的，但是为了保证队形整齐还是这么写了
      int voice = (volume << 16) | ( (_m._v1) << 8) | 0x92; //音量|音高|通道
      midiOutShortMsg ( handle, voice ); //midiOut短消息9类//演奏
    }
    if ( _m._v2 != R ) {
      int voice = (volume << 16) | ( (_m._v2) << 8) | 0x92; //音量|音高|通道
      midiOutShortMsg ( handle, voice ); //midiOut短消息9类//演奏
    }
    if ( _m._v3 != R ) {
      int voice = (volume << 16) | ( (_m._v3) << 8) | 0x92; //音量|音高|通道
      midiOutShortMsg ( handle, voice ); //midiOut短消息9类//演奏
    }
  }
}
void DSHH_Music(void)
{
  int volume = 0x2F; // 音量
  int stime  = 150 ; // 音时
  int cnt = 0; // 小节计时器
  midiOutOpen (&handle, 0, 0, 0, CALLBACK_NULL); //打开MIDI设备

  midiOutShortMsg (handle, 0 << 8 | 0xC0); //midiOut短消息C类 //声明乐器(0:大钢琴)、通道0(右手一声部)
  midiOutShortMsg (handle, 0 << 8 | 0xC1); //midiOut短消息C类 //声明乐器(0:大钢琴)、通道1(右手二声部)
  midiOutShortMsg (handle, 0 << 8 | 0xC2); //midiOut短消息C类 //声明乐器(0:大钢琴)、通道2(左手一声部)
  //遍历乐谱
  for (auto i : DSHH_music) {
    msc m=i;
    cnt --; // 四分之一小节过去了
    //处理指令
    volume = 0x7f; //调节音量
    //分通道发声
    //因为同一通道里的音同时开始和停止,所以只判断 "_v1" 的值即可 
    if ( m.v0._v1 != R ) DSHH_MakeSound_0 ( m.v0 );
    if ( m.v1._v1 != R ) DSHH_MakeSound_1 ( m.v1 );
    if ( m.v2._v1 != R ) DSHH_MakeSound_2 ( m.v2 );
    //保持音时
    Sleep ( stime ); // 四分之一小节
  }
  midiOutClose (handle); //关闭MIDI
}
//勾指起誓
void gzqs(void)
{
  HMIDIOUT handle;
  midiOutOpen(&handle, 0, 0, 0, CALLBACK_NULL);
  midiOutShortMsg(handle, 2 << 8 | 0xCC);
  midiOutShortMsg(handle, 0x7BBC);
  int volume = 0x7f;
  int voice = 0x0;
  double normalsleep = 705.8; //一拍的时长
  double sleep = normalsleep;
  int gzqs[] = {
    -8,//前奏使用1/8拍作为基准
    X6,_,L3,_,M1,_,M6,_,H5,_,_,_,H1,_,_,_,X4,_,L1,_,L6,_,M4,_,H1,_,_,_,H5,_,_,_,X5,_,L2,_,L7,_,M5,_,H1,_,_,_,H5,_,_,_,L1,_,L5,_,M3,_,_,_,M2,M3,M2,_,M1,_,_,_,
    X6,_,L3,_,M1,_,M6,_,H5,_,_,_,H1,_,_,_,X4,_,L1,_,L6,_,M4,_,H1,_,_,_,M2,_,M1,_,_,_,L2,_,L5,_,M5,_,H1,_,_,_,M7,_,_,_,M5,_,_,_,_,M2,_,L5,_,L2,_,L7,_,L5,
    X6,_,L3,_,M1,_,M6,_,H5,_,_,_,H1,_,_,_,X4,_,L1,_,L6,_,M4,_,H1,_,_,_,H5,_,_,_,X5,_,L2,_,L7,_,M5,_,H1,_,_,_,H5,_,_,_,L1,_,L5,_,M3,_,_,_,M2,M3,M2,_,M1,_,_,_,
    X6,_,L3,_,M1,_,M6,_,H5,_,_,_,H1,_,_,_,X4,_,L1,_,L6,_,M4,_,H1,_,_,_,M2,_,M1,_,_,_,L2,_,L5,_,M5,_,H3,H4,H3,_,H2,_,H1,_,H2,H3,H1,H2,H1,M5,M3,M2,L5,_,_,_,M1,_,_,_,
    -4,//以1/4拍做基准
    M2,_,M1,_,M1,_,M1,_,M3,_,M1,_,M1,_,M1,_,M2,_,M3,M2,M2,_,M1,_,M3,_,_,_,L5,_,M1,_,M2,_,M1,_,M1,_,M2,M3,M2,_,M1,_,M1,_,_,M1,M2,_,M2,M3,M2,_,M1,_,M1,_,_,_,L5,_,M1,_,
    M2,_,M1,_,M1,_,M2,M3,M2,_,M1,_,M1,_,_,_,M1,_,M2,M3,M2,_,M1,_,M3,_,_,_,L5,_,M1,_,M2,_,M1,_,M1,_,M2,M3,M2,_,M1,_,M1,_,_,_,M2,_,M2,M3,M2,_,M1,_,M1,_,_,_,M2,_,M1,_,
    M5,_,M1,_,M1,_,M1,M5,M2,_,M1,_,M1,_,_,_,M2,_,M1,M1,M1,_,M5,_,M3,_,_,_,M1,_,M5,_,M5,_,M1,_,M1,_,M1,M5,M2,_,M1,_,M1,_,_,_,M2,_,M1,M1,M1,_,M2,_,M1,_,_,_,M2,_,M1,_,
    M5,_,M1,_,M1,_,M5,M5,M2,_,M1,_,M1,_,_,_,M2,_,M1,_,M1,_,M5,M3,M3,_,_,_,M2,_,M1,_,M5,_,M1,_,M1,_,M1,M5,M2,_,M1,_,M1,_,_,_,M2,_,M1,M1,M1,_,M2,_,M1,_,_,_,
    -8,//间奏
    H2,H3,H2,_,H1,_,M7,_,
    H1,_,_,_,H5,_,_,_,H5,_,_,_,H2,_,H1,_,H1,_,_,_,H5,_,_,_,H5,_,_,_,H2,_,H1,_,H1,_,_,_,H2,_,H1,_,H1,_,_,_,H2,_,H1,_,H1,_,_,_,H2,_,_,_,H2,_,_,_,H1,_,M7,_,H1,_,H7,_,H5,_,H2,_,H1,_,M7,_,M5,_,M2,_,
    H2,_,_,_,H3,_,_,_,H2,_,_,_,H2,_,H1,_,H1,_,M5,_,H1,_,H3,_,H2,_,H1,_,H1,_,_,_,M6,_,_,_,H5,_,_,_,H5,_,_,_,H2,_,H1,_,M5,_,_,_,H5,_,_,_,H5,_,_,_,M5,_,M3,_,M2,_,M5,_,H1,_,H2,_,H3,_,M5,_,H1,_,H3,_,H2,_,M5,_,H1,_,H3,_,H2,H3,H2,H1,M5,_,H1,_,
    M2,_,M5,_,H1,_,M5,_,H2,_,M5,_,H3,_,M5,_,H2,_,H1,_,M5,_,M2,_,M1,_,M4,_,H5,_,M1,_,
    -2,
    // Case 1
    H2,H1,H1,H2,H1,_,L5,M1,
    // 从头开始
    -4,//以1/4拍做基准
    M2,_,M1,_,M1,_,M1,_,M3,_,M1,_,M1,_,M1,_,M2,_,M2,M3,M2,_,M1,_,M3,_,_,_,L5,_,M1,_,M2,_,M1,_,M1,_,M2,M3,M2,_,M1,_,M1,_,_,M1,M2,_,M2,M3,M2,_,M1,_,M1,_,_,_,L5,_,M1,_,
    M2,_,M1,_,M1,_,M2,M3,M2,_,M1,_,M1,_,_,_,M1,_,M2,M3,M2,_,M1,_,M3,_,_,_,L5,_,M1,_,M2,_,M1,_,M1,_,M2,M3,M2,_,M1,_,M1,_,_,_,M2,_,M2,M3,M2,_,M1,_,M1,_,_,_,M2,_,M1,_,
    M5,_,M1,_,M1,_,M1,M5,M2,_,M1,_,M1,_,_,_,M2,_,M1,M1,M1,_,M5,_,M3,_,_,_,M1,_,M5,_,M5,_,M1,_,M1,_,M1,M5,M2,_,M1,_,M1,_,_,_,M2,_,M1,M1,M1,_,M2,_,M1,_,_,_,M2,_,M1,_,
    M5,_,M1,_,M1,_,M5,M5,M2,_,M1,_,M1,_,_,_,M2,_,M1,_,M1,_,M5,M3,M3,_,_,_,M2,_,M1,_,M5,_,M1,_,M1,_,M1,M5,M2,_,M1,_,M1,_,_,_,M2,_,M1,M1,M1,_,M2,_,M1,_,_,_,
    -8,//间奏
    H2,H3,H2,_,H1,_,M7,_,
    H1,_,_,_,H5,_,_,_,H5,_,_,_,H2,_,H1,_,H1,_,_,_,H5,_,_,_,H5,_,_,_,H2,_,H1,_,H1,_,_,_,H2,_,H1,_,H1,_,_,_,H2,_,H1,_,H1,_,_,_,H2,_,_,_,H2,_,_,_,H1,_,M7,_,H1,_,H7,_,H5,_,H2,_,H1,_,M7,_,M5,_,M2,_,
    H2,_,_,_,H3,_,_,_,H2,_,_,_,H2,_,H1,_,H1,_,M5,_,H1,_,H3,_,H2,_,H1,_,H1,_,_,_,M6,_,_,_,H5,_,_,_,H5,_,_,_,H2,_,H1,_,M5,_,_,_,H5,_,_,_,H5,_,_,_,M5,_,M3,_,M2,_,M5,_,H1,_,H2,_,H3,_,M5,_,H1,_,H3,_,H2,_,M5,_,H1,_,H3,_,H2,H3,H2,H1,M5,_,H1,_,
    M2,_,M5,_,H1,_,M5,_,H2,_,M5,_,H3,_,M5,_,H2,_,H1,_,M5,_,M2,_,M1,_,M4,_,H5,_,M1,_,
    -2,
    // Case 2
    H2,H1,H1,H2,H1,_,1000,1000,
    -4,
    M5,_,M1,_,M1,_,M1,M5,M2,_,M1,_,M1,_,_,_,M2,_,M1,M1,M1,_,M5,_,M3,_,_,_,M1,_,M5,_,M5,_,M1,_,M1,_,M1,M5,M2,_,M1,_,M1,_,_,_,M2,_,M1,M1,M1,_,M2,_,M1,_,_,_,M2,_,M1,_,
    M5,_,M1,_,M1,_,M5,M5,M2,_,M1,_,M1,_,_,_,M2,_,M1,_,M1,_,M5,M3,M3,_,_,_,M2,_,M1,_,M5,_,M1,_,M1,_,M1,M5,M2,_,M1,_,M1,_,_,_,M2,_,M1,M1,M1,_,M2,_,M1,_,_,_,1000,1000,1000,1000,
  };
  for (auto i : gzqs)
  {
    switch (i)
    {
      case -8: // 切换为1/8拍为基准
        sleep = normalsleep / 8.0;
        continue;
      case -4: // 切换为1/4拍为基准
        sleep = normalsleep / 4.0;
        continue;
      case -2: // 切换为1/2拍为基准
        sleep = normalsleep / 2.0;
        continue;
      case -1: // 切换为1拍为基准
        sleep = normalsleep;
        continue;
      case 1000:
        Sleep(sleep);
        continue;
      case 2000:
        Sleep(sleep / 2.0);
        continue;
      case 4000:
        Sleep(sleep / 4.0);
        continue;
      case 8000:
        Sleep(sleep / 8.0);
        continue;
      case _:
        Sleep(sleep);
        continue;
    }
    voice = (volume << 16) + ((i) << 8) + 0x9C;
    midiOutShortMsg(handle, voice);
    //cout << voice << endl;
    Sleep(sleep);
  }
  midiOutClose(handle);
}
//Burn The House Down
msc BDHT_music[] = 
{
  {{E5,A4,R},{S,S,S},{S,S,S},_V[6]}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A4,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E4,A4,C5},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{E5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A4,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{C5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{E5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A4,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{C5,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{E5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A4,R,R},{R,R,R},{G1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E4,A4,C5},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{E5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A4,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{C5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{E5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A4,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{C5,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{E5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A4,R,R},{R,R,R},{G1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,C5,E4},{R,R,R},{A1,R,R},_V[9]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E6,E5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{E6,E5,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5,A4,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{C4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E6,E5,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{E6,E5,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{S,S,S},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{D4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E6,E5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{E6,E5,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5,A4,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{R,R,R},{F2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{F4,D4,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E6,E5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{E6,E5,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,E5,C5},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A4,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E4,A4,C5},{R,R,R},{A2,A1,R},P}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{E5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A4,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{C5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{E5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A4,R,R},{R,R,R},{A3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{C5,R,R},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,R,R},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{E5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A4,R,R},{R,R,R},{D4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E4,A4,C5},{R,R,R},{A2,A1,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{E5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A4,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{C5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{E5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A4,R,R},{R,R,R},{A3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{C5,R,R},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,R,R},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{E5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A4,R,R},{R,R,R},{D4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,C5,E4},{R,R,R},{A2,A1,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E6,E5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{E6,E5,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5,A4,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E6,E5,R},{S,S,S},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{E6,E5,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{D5,A4,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{S,S,S},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{S,S,S},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{D5,A4,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{S,S,S},{D3,D2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{A4,F4,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{S,S,S},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E6,E5,R},{S,S,S},{D3,D2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{E6,E5,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5,A4,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{E5,E4,R},{F3,F2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{D7,D6,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E6,E5,R},{R,R,R},{F3,F2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F2,R,R},0}, {{E6,E5,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{D7,D6,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,E5,C5},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{S,S,S},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{A6,A5,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{A2,A1,R},_V[12]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{S,S,S},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,C5,E4},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,C5,E4},{S,S,S},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,A4,D4},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,C5,E4},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,C5,E4},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,G4,D4},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{D3,D2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,D5,G4},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,D5,E4},{R,R,R},{C4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,D5,E4},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,D5,G4},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,D4,R},{R,R,R},{C4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{D5,A4,D4},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,D4,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,D4,R},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,C4,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5,C4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F4,C4,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,C4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{A2,A1,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,C5,E4},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,C5,E4},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,A4,D4},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,C5,E4},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,C5,E4},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,G4,D4},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{D3,D2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,D5,G4},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,D5,E4},{R,R,R},{C4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,D5,E4},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,D5,G4},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,D4,R},{R,R,R},{C4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{D5,A4,D4},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,D4,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,D4,R},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,C4,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5,C4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F4,C4,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,C4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,C5,E4},{R,R,R},{A2,A1,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E6,E5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{E6,E5,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5,A4,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E6,E5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{E6,E5,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{S,S,S},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{R,R,R},{D3,D2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{C4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E6,E5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{E6,E5,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5,A4,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{D5,A4,D4},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,D4,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,D4,R},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,C4,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5,C4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F4,C4,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,C4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},P}, 
  //Part 2
{{S,S,S},{S,S,S},{A1,R,R},_V[9]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{B1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{B1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D4,D5,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{E5,A4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A4,R,R},{R,R,R},{G1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E4,A4,C5},{R,R,R},{A2,A1,R},P}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{E5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A4,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{C5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{E5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A4,R,R},{R,R,R},{A3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{C5,R,R},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,R,R},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{E5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A4,R,R},{R,R,R},{D4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E4,A4,C5},{R,R,R},{A2,A1,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{E5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A4,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{C5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{E5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A4,R,R},{R,R,R},{A3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{C5,R,R},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,R,R},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{E5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A4,R,R},{R,R,R},{D4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,C5,E4},{R,R,R},{A2,A1,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E6,E5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{E6,E5,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5,A4,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E6,E5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{E6,E5,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{S,S,S},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{R,R,R},{D3,D2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E6,E5,R},{R,R,R},{D3,D2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{E6,E5,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5,A4,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{R,R,R},{F3,F2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E6,E5,R},{R,R,R},{F3,F2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F2,R,R},0}, {{E6,E5,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,E5,C5},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{S,S,S},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{A2,A1,R},_V[12]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,C5,E4},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,C5,E4},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,A4,D4},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,C5,E4},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,C5,E4},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,G4,D4},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{D3,D2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,D5,G4},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,D5,E4},{R,R,R},{C4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,D5,E4},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,D5,G4},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,D4,R},{R,R,R},{C4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{D5,A4,D4},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,D4,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,D4,R},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,C4,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5,C4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F4,C4,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,C4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{A2,A1,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,C5,E4},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,C5,E4},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,A4,D4},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,C5,E4},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,C5,E4},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,G4,D4},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{D3,D2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,D5,G4},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,D5,E4},{R,R,R},{C4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,D5,E4},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,D5,G4},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,D4,R},{R,R,R},{C4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{D5,A4,D4},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,D4,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,D4,R},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,C4,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5,C4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F4,C4,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,C4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,C5,E4},{R,R,R},{A2,A1,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E6,E5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{E6,E5,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5,A4,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E6,E5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{E6,E5,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{S,S,S},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{R,R,R},{D3,D2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{C4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E6,E5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{E6,E5,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5,A4,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{D5,A4,D4},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,D4,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,D4,R},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,C4,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5,C4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F4,C4,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,C4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  //Part 3
{{S,S,S},{S,S,S},{A3,A2,R},_V[9]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{A3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,R,R},{R,R,R},{B3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,R,R},{R,R,R},{B3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,R,R},{R,R,R},{C4,R,R},0}, {{S,S,S},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{C4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,R,R},{R,R,R},{E4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{E4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{D5s,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{D5,R,R},{R,R,R},{D4,R,R},0}, {{S,S,S},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{D4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,R,R},{R,R,R},{E4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{E4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{C5,D5,R},{R,R,R},{F4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,R,R},{R,R,R},{F4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,R,R},{R,R,R},{F4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{R,R,R},{F4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,R,R},{S,S,S},{F4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{E2,R,R},{F4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,R,R},{E2,R,R},{F4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{A4,R,R},{S,S,S},{A2,A1,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G4,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A4,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E4,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D4,R,R},{R,R,R},{B2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C4,R,R},{R,R,R},{B2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{D4,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{E4,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E4,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C4,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C4,R,R},{R,R,R},{E3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C4,R,R},{R,R,R},{E3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{A4,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G4,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G4,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A4,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E4,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D4,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C4,R,R},{R,R,R},{E3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D4,R,R},{R,R,R},{E3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{D4,R,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C4,R,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C4,R,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C4,R,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{C4,R,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{S,S,S},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C4,C5,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C4,C5,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{A5,A4,R},{R,R,R},{A0,A1,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{R,R,R},{A1,A2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{A1,A2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A1,A2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{R,R,R},{A1,A2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A1,A2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,D4,R},{R,R,R},{B1,B2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,C4,R},{R,R,R},{B1,B2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{D5,D4,R},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,E4,R},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,E4,R},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,C4,R},{R,R,R},{E3,E2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,C4,R},{R,R,R},{E3,E2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{A5,A4,R},{R,R,R},{D3,D2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{R,R,R},{D3,D2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{D3,D2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,D4,R},{R,R,R},{D3,D2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{D5,D4,R},{R,R,R},{D3,D2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,D4,R},{R,R,R},{D3,D2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,D4,R},{R,R,R},{E3,E2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,D4,R},{R,R,R},{E3,E2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{D5,D4,R},{R,R,R},{F3,F2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F3,F2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5,C4,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F3,F2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,C4,R},{R,R,R},{F3,F2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{F3,F2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F3,F2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F3,F2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F3,F2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},P}, 
  {{S,S,S},{R,R,R},{A2,R,R},_V[3]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G4,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E4,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G4,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E4,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G4,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D4,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G4,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E4,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G4,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E4,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G4,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D4,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G4,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E4,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G4,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E4,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G4,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D4,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{D4,R,R},{R,R,R},{F2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D4,R,R},{R,R,R},{F2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D4,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C4,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E4,R,R},{R,R,R},{F2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C4,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C4,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{A2,R,R},_V[4]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,E4,R},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{R,R,R},{S,S,S},_V[5]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,D4,R},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{C2,R,R},_V[6]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,E4,R},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{R,R,R},{S,S,S},_V[7]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,D4,R},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{S,S,S},{R,R,R},{D2,R,R},_V[8]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{E5,E4,R},{R,R,R},{D4,F3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{R,R,R},{S,S,S},_V[9]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,D4,R},{R,R,R},{D4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5,D5,G4},{R,R,R},{F2,R,R},_V[10]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,D5,G4},{R,R,R},{F2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,D5,G4},{R,R,R},{F4,C4,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{A5,E5,A4},{R,R,R},{S,S,S},_V[11]}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,G5,C5},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F4,C4,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6,G5,C5},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},_V[13]}, 
  {{E5,C5,E4},{R,R,R},{A2,A1,R},P}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E6,E5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{E6,E5,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5,A4,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{R,R,R},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E6,E5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{E6,E5,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{S,S,S},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,C5,E4},{R,R,R},{D3,D2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{D4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E6,E5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D3,R,R},0}, {{E6,E5,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5,A4,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{G5,D5,G4},{S,S,S},{F3,F2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,D5,G4},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,D5,G4},{R,R,R},{F4,C4,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,C5,G4},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{A5,E5,A4},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,G5,C5},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F4,C4,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C6,G5,C5},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,C5,E4},{S,S,S},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A2,A1,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{E5,E4,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E6,E5,R},{E5,E4,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{E6,E5,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{G5,G4,R},{A3,E3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5,A4,R},{R,R,R},{A2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{D5,D4,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,E4,R},{S,S,S},{C3,C2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{E5,E4,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E6,E5,R},{E5,E4,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C2,R,R},0}, {{E6,E5,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{G5,G4,R},{C4,G3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{S,S,S},{R,R,R},{C3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{D5,D4,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{C4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,C5,E4},{S,S,S},{D3,D2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{R,R,R},{D4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{G5,G4,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{A5,A4,R},{E5,E4,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E6,E5,R},{E5,E4,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D3,R,R},0}, {{E6,E5,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C6,C5,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{G5,G4,R},{D4,A3,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{A5,A4,R},{R,R,R},{D3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{G5,G4,R},{D5,D4,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{D4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{D5,G4,D4},{S,S,S},{F3,F2,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,G4,D4},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{D5,G4,D4},{R,R,R},{F4,C4,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,G4,C4},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{E5,A4,E4},{S,S,S},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{C5,G4,E4},{C4,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{F4,C4,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F3,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{C5,G4,E4},{C4,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{F4,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},P}, 
  {{S,S,S},{S,S,S},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{C2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{D2,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{G1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
  {{R,R,R},{R,R,R},{A1,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{S,S,S},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
    {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, {{R,R,R},{R,R,R},{R,R,R},0}, 
};
//核心函数
void BDHT_MakeSound_0 (msc);
void BDHT_MakeSound_1 (msc);
void BDHT_MakeSound_2 (msc);
void BDHT_init(void)
{
  _mp[R] = PA;
  _mp[P] = PA;
  _mp[S] = PA;
  _mp[0] = PA;
  _mp[ _V[1] ] = 0x1f;
  for(int i=2;i<=13;i++)
  {
    _mp[ _V[i] ] = _mp[ _V[i-1] ] + 8;
  }
}
void BDHT_MakeSound_0 (v_spo _m) {  //第零通道
  int  volume = 0x7f;
  // 踏板 // 默认为抬起(0),踩下(1)时将声音停止改为每16单位(一小节)一次
  //特判由休止符造成的停止发声 
  if( _m._v1 == S )
  {
    //与else语句的区别是停止后就不发声,打算用于休止符
    if ( !pedal ) // 当踏板被踩下时不进行常规停止
    {
      midiOutShortMsg ( handle, 0x7BB0 ); //midiOut短消息B类
    }
  }
  //开始发声
  else {
    //发出新的声音之前先停止上一个声音
    if ( !pedal ) // 当踏板被踩下时不进行常规停止
    {
      midiOutShortMsg ( handle, 0x7BB0 ); //midiOut短消息B类
    }
    //定义声音变量voice并发声
    if ( _m._v1 != R )
    {  // "_v1" 当然是不用判断的，但是为了保证队形整齐还是这么写了
      int voice = (volume << 16) | ( (_m._v1) << 8) | 0x90; //音量|音高|通道
      midiOutShortMsg ( handle, voice ); //midiOut短消息9类//演奏
    }
    if ( _m._v2 != R )
    {
      int voice = (volume << 16) | ( (_m._v2) << 8) | 0x90; //音量|音高|通道
      midiOutShortMsg ( handle, voice ); //midiOut短消息9类//演奏
    }
    if ( _m._v3 != R )
    {
      int voice = (volume << 16) | ( (_m._v3) << 8) | 0x90; //音量|音高|通道
      midiOutShortMsg ( handle, voice ); //midiOut短消息9类//演奏
    }
  }
}
void BDHT_MakeSound_1 (v_spo _m) {  //第一通道
  int  volume = 0x7f;
  //特判由休止符造成的停止发声 
  if( _m._v1 == S )
  {
    //与else语句的区别是停止后就不发声,打算用于休止符
    if ( !pedal ) // 当踏板被踩下时不进行常规停止
      midiOutShortMsg ( handle, 0x7BB1 ); //midiOut短消息B类
  }
  //开始发声
  else {
    //发出新的声音之前先停止上一个声音
    if ( !pedal ) // 当踏板被踩下时不进行常规停止
      midiOutShortMsg ( handle, 0x7BB1 ); //midiOut短消息B类
    //定义声音变量voice并发声
    if ( _m._v1 != R )
    {  // "_v1" 当然是不用判断的，但是为了保证队形整齐还是这么写了
      int voice = (volume << 16) | ( (_m._v1) << 8) | 0x91; //音量|音高|通道
      midiOutShortMsg ( handle, voice ); //midiOut短消息9类//演奏
    }
    if ( _m._v2 != R )
    {
      int voice = (volume << 16) | ( (_m._v2) << 8) | 0x91; //音量|音高|通道
      midiOutShortMsg ( handle, voice ); //midiOut短消息9类//演奏
    }
    if ( _m._v3 != R )
    {
      int voice = (volume << 16) | ( (_m._v3) << 8) | 0x91; //音量|音高|通道
      midiOutShortMsg ( handle, voice ); //midiOut短消息9类//演奏
    }
  }
}
void BDHT_MakeSound_2 (v_spo _m) {  //第二通道
  //特判由休止符造成的停止发声 
  int  volume = 0x7f;

  if ( _m._v1 == S)
  {
    //与else语句的区别是停止后就不发声,打算用于休止符
    if ( !pedal ) // 当踏板被踩下时不进行常规停止
      midiOutShortMsg ( handle, 0x7BB2 ); //midiOut短消息B类
  }
  //开始发声
  else {
    //发出新的声音之前先停止上一个声音
    if ( !pedal ) // 当踏板被踩下时不进行常规停止
      midiOutShortMsg ( handle, 0x7BB2 ); //midiOut短消息B类
    //定义声音变量voice并发声
    if ( _m._v1 != R )
    {  // "_v1" 当然是不用判断的，但是为了保证队形整齐还是这么写了
      int voice = (volume << 16) | ( (_m._v1) << 8) | 0x92; //音量|音高|通道
      midiOutShortMsg ( handle, voice ); //midiOut短消息9类//演奏
    }
    if ( _m._v2 != R )
    {
      int voice = (volume << 16) | ( (_m._v2) << 8) | 0x92; //音量|音高|通道
      midiOutShortMsg ( handle, voice ); //midiOut短消息9类//演奏
    }
    if ( _m._v3 != R )
    {
      int voice = (volume << 16) | ( (_m._v3) << 8) | 0x92; //音量|音高|通道
      midiOutShortMsg ( handle, voice ); //midiOut短消息9类//演奏
    }
  }
}
//
void BDHT_Music(void);
void BDHT_Music(void)
{
  int cnt = 10 , stime  = 77 , volume = 0x7f;
  midiOutOpen (&handle, 0, 0, 0, CALLBACK_NULL); //打开MIDI设备

  midiOutShortMsg (handle, 0 << 8 | 0xC0); //midiOut短消息C类 //声明乐器(1:明亮的钢琴)、通道0(右手一声部)
  midiOutShortMsg (handle, 0 << 8 | 0xC1); //midiOut短消息C类 //声明乐器(1:明亮的钢琴)、通道1(右手二声部)
  midiOutShortMsg (handle, 0 << 8 | 0xC2); //midiOut短消息C类 //声明乐器(0:大钢琴)、通道2(左手一声部)
  //遍历乐谱
  for (auto i : BDHT_music)
  {
    msc m=i;
    cnt --; // 四分之一小节过去了
    //分通道发声
    //因为同一通道里的音同时开始和停止,所以只判断 "_v1" 的值即可 
    if ( m.v0._v1 != R ) 
      BDHT_MakeSound_0 ( m.v0 );
    if ( m.v1._v1 != R )
      BDHT_MakeSound_1 ( m.v1 );
    if ( m.v2._v1 != R )
      BDHT_MakeSound_2 ( m.v2 );
    //保持音时
    Sleep ( stime ); // 四分之一小节
    //处理指令
    if ( m.C == P )  pedal = !pedal; //改变踏板状态
    if ( _mp[m.C] != PA ) volume = _mp[ m.C ]; //调节音量

    // 处理小节结束
    if ( cnt == 0 )
    {
      cnt = 16;
      // printf("One Bar Has Passed ...\n"); // 一小节过去了
      if ( pedal )
      { // 处理踏板
        midiOutShortMsg ( handle, 0X7BB0 ); // 0X7B是结束指令,B0是通道
        midiOutShortMsg ( handle, 0X7BB1 );
        midiOutShortMsg ( handle, 0X7BB2 );
      }
    }
  }
  midiOutClose (handle); //关闭MIDI
}
//晴天
void QT(void)
{
	HMIDIOUT handle;
	midiOutOpen(&handle, 0, 0, 0, CALLBACK_NULL);
	// midiOutShortMsg(handle, 2 << 8 | 0xC0);
	int volume = 0x7f;
	int voice = 0x0;
	int sleep = 350;
  DWORD wind[] = {
    500,L6,700,M1,700,M5,700,M1,700,L4,700,L5,700,M5,700,M1,500,L1,400,L5,M5,M1,L1,M5,L7,M5,_,L6,M1,M5,M1,L4,L5,M5,M1,L1,L5,M5,M1,L1,M5,L7,M5,_,_,_,
		300,M5,M5,M1,_,M1,_,M2,M3,_,_,M5,M5,M1,M1,M2,M3,0,M2,M1,_,_,_,500,300,
		300,M5,M5,M1,_,M1,_,M2,M3,_,500,M3,_,300,M2,M3,M4,M3,M2,M4,M3,M2,_,500,300,
		300,L5,M1,M1,M3,M4,M3,M2,_,M1,M2,_,300,M3,M3,M3,M3,_,M2,M3,M2,M1,300,
		400,L5,M1,_,M2,M3,M4,M3,M2,M1,M2,_,M3,M3,M3,M3,0,M2,M3,0,M2,M1,_,_,500,300,
		300,L7,300,M1,300,M1,300,M1,300,M1,L7,M1,M1,_,_,M1,M1,M1,L7,M1,M1,_,_,M1,M1,M1,L7,M1,M1,_,M1,M1,M1,M5,M5,M5,_,M5,M5,M5,M5,0,M5,M5,_,_,_,500,300,
		300,M5,M5,M5,_,M5,M4,M3,M3,0,500,300,_,_,_,
		300,M1,M1,M1,M1,L6,_,L7,M1,M5,M4,M3,M1,M1,_,_,
		300,M1,M1,M1,M1,_,M3,M1,_,_,L6,L7,M1,M5,M4,M3,M1,M2,_,_,_,
		400,_,_,_,_,M3,M2,M4,M3,_,_,M1,M5,M7,L7,M7,M5,M1,_,_,M1,M6,M6,_,_,M6,M5,M5,_,M5,M4,M3,M2,M3,M4,M3,_,_,
		400,M3,M4,M5,M3,_,_,M4,M5,M7,H2,M7,H1,H1,_,_,
		400,H1,H1,M5,M5,M6,M5,M4,_,M2,M3,M4,M5,M6,M1,M6,_,0,M7,M7,_,_,500,300,
		400,M3,M2,M4,M3,_,M1,M5,M7,H1,M7,M1,M1,_,M1,M6,M6,_,M6,M5,M5,_,M5,M4,M3,M2,M3,M4,M3,_,_,
		400,M3,M4,M5,M3,_,M4,M5,M7,H2,M7,H1,H1,_,_,
		400,H1,H1,M5,M5,M6,M5,M4,M2,M3,M4,M5,M6,M1,M6,M7,_,M7,_,_,
		300,M3,M2,M4,M3,_,M1,M5,M7,H1,M7,H2,H1,_,_,
		300,M1,M6,M6,_,M6,M5,M5,_,M5,M4,M3,M2,M3,M4,M3,_,_,_,
		300,M3,M4,M5,M3,_,M4,M5,M7,H2,M7,H1,H1,_,_,
		500,H1,H1,M5,M5,M6,M5,M4,L6,L7,M1,M2,M3,M2,_,_,
		500,M3,_,M1,_,_,_,
  };
	for (DWORD i : wind)
  {
    switch (i)
    {
    case 0:
      sleep = 175;
      continue; 
    case 700:
      Sleep(175);
      continue;
    case 300:
      sleep = 350;
      continue;
    case 0XFF:
      Sleep(350);
			continue;
    }
		// if (i == 900) volume += 100;
		voice = (volume << 16) + ((i) << 8) + 0x90;
    midiOutShortMsg(handle, voice);
    Sleep(sleep);
  }
  midiOutClose(handle);
}

//unravel
void unravel(void)
{
  HMIDIOUT handle;
  midiOutOpen(&handle, 0, 0, 0, CALLBACK_NULL);
  int volume = 0x7f;
  int voice;
  const int speed = 134;
  float four_note = (60.0 / speed) * 1000 , two_note = four_note * 2 , eight_note = four_note / 2 , sixteen_note = eight_note / 2 , _32_note = sixteen_note / 2 , _20_note = four_note / 5 , _24_note = four_note / 6;
  int test[1] = {};
  int notes[] =
  {
    //part 1
    A6s, _8,
    G5, C7, _4, A6s, _4, A6, _8, G6, _8, A5s, _8, C7, _8,
    D5s, _8, A6s, _4, A6, _4, G6, _8, G5, _8, G6, _8,
    F5, F6, _4, _8, D6s, _8, D6s, _8, _16, F6, _16, A5, _8, D6, _8,
    G5, _2, _4, Rest, _8, D5, D6, _8, -1,
    D3s, D5, A5s, D6, _8, A3s, _8, G4, D5, D6, _8, D3s, D5, A5s, D6, _8, A3s, _8, F4, D6, D7, _8, A4s, D6, A6s, D7, _8, D5, _8,
    G3, _8, D4, C5, _8, A4s, D5, _8, G3, _8, D4, C5, _8, A4s, D5, _8, G3, _8, D4, A5s, A6s, _8,
    F3, A5, C6, A6, _8, C4, _8, A4, A5, A6, _8, F3, A5, C6, A6, _8, C4, _8, F4, A5s, A6s, _8, A4s, A5s, A6s, _8, C5, _8,
    G3, _8, D4, A4, _8, G4, A4s, _8, G3, _8, D4, A4, _8, G4, A4s, _8, G3, _8, D4, A6s, _8,
    D3s, C7, _8, A3s, C6, _8, G4, D6, A6s, _8, D3s, A5s, _8, A3s, A5, A6, _8, G4, A5s, G6, _8, D3s, G5, _8, A3s, C7, _8,
    G3, C6, _8, D4, D6, A6s, _8, A4s, A5s, _8, G3, A5, A6, _8, D4, A5s, _8, A4s, G5, G6, _8, G3, _8, D4, G6, _8,
    F3, A5, F6, _8, C4, A5s, _8, A4, F5, _8, F3, D6s, _8, C4, A5, D6s, _8, A4, _16, A5s, F6, _16, F3, _8, C4, F5, D6, _8,
    G3, _8, D4, A5, _8, A4s, A5s, _8, G3, _8, D4, A5, _8, A4s, A5s, _8, G3, _8, D4, D5, D6, _8,
    D3s, D5, A5s, D6, _8, A3s, _8, G4, D5, D6, _8, D3s, D5, A5s, D6, _8, A3s, _8, G4, D6, D7, _8, D3s, D6, A6s, D7, _8, A3s, _8,
    G3, F4, _8, D4, C5, _8, A4s, D5, _8, G3, F4, _8, D4, C5, _8, A4s, D5, _8, G3, F4, _8, D4, A5s, A6s, _8,
    F3, A5, C6, A6, _8, C4, _8, A4, A5, A6, _8, F3, A5, C6, A6, _8, C4, _8, A4, A5s, A6s, _8, F3, A5s, A6s, _8, F3, _8,
    //part 2
    G3, D4, G4, _16, G3, _16, G3, _16, D4, G4, _16, G3, _16, G3, _16, D4, G4, _16, G3, _16, D4, G4, _16, G3, _16, G3, _16, D4, G4, _16, D4, G4, _16, G3, _16, G3, _8, -1,
    A4s, D6, _16, G4, D5, _16, A4, G5, _16, A4s, C6, _16, G4, D5, _16, A4, G5, _16, A4s, A5s, _16, G4, D5, _16, A4s, D6, _16, G4, D5, _16, A4, G5, _16, A4s, C6, _16, G4, D5, _16, A4, G5, _16, A4s, A5s, _8, -1,
    G2, D3, G3, A3, A3s, D4, G4, _16, G2, D3, G3, _16, G2, D3, G3, _16, A3, A3s, D4, G4, _16, G2, D3, G3, _16, G2, D3, G3, _16, A3, A3s, D4, G4, _16, G2, D3, G3, _16, A3, A3s, D4, G4, _16, G2, D3, G3, _16, G2, D3, G3, _16, A3, A3s, D4, G4, _16, A3, A3s, D4, G4, _16, G2, D3, G3, _16, G2, D3, G3, _8, -1,
    G1, G2, D5, D6, _16, A5s, A6s, _16, G3, _16, A3s, D4, G4, D5, D6, _16, G5, G6, _16, D6, _16, G2, A5s, _16, D3, G3, G5, _16, F2, F3, _16, F2, F3, _16, D4, A4s, D5, _16, F3, D4, _16, C4, A4s, C5, _16, F3, D4, _16, D4, A4s, D5, _16, F2, F3, _16,
    D2s, D3s, D5, D6, _16, A5s, A6s, _16, G3, _16, A3s, D4s, G4, D5, D6, _16, G5, G6, _16, D6, _16, D2s, A5s, _16, A2s, D3s, G5, _16, D2, D3, _16, D2, D3, _16, D4, F4s, A4, D5, _16, A3, D4, _16, A4s, D5, A5s, _16, A3, D4, _16, A4, D5, A5, _16, D2, D3, _16,
    G1, G2, D5, D6, _16, A5s, A6s, _16, G3, _16, A3s, D4, G4, D5, D6, _16, G5, G6, _16, D6, _16, G2, A5s, _16, D3, G3, G5, _16, F2, F3, _16, F2, F3, _16, D4, A4s, D5, _16, F3, D4, _16, C4, A4s, C5, _16, F3, D4, _16, D4, A4s, D5, _16, F2, F3, _16,
    D2s, D3s, D5, D6, _16, A5s, A6s, _16, G3, _16, A3s, D4s, G4, D5, D6, _16, G5, G6, _16, D6, _16, D2s, A5s, _16, A2s, D3s, G5, _16, D2, D3, _16, D2, D3, _16, D4, F4s, A4, D5, _16, A3, D4, _16, A4s, D5, A5s, _16, A3, D4, _16, A4, D5, A5, _16, D2, D3, _16,
    G2, G3, D4, G4, A4s, _16, G3, D4, _8, G3, D4, G4, _16, G3, D4, _16, -1, _16, G3, D4, C5, _8, G3, D4, G4, A4s, _16, G3, D4, _8, G3, D4, G4, _16, G3, D4, _16, -1, _16, G3, D4, C5, A5, _8,
    //part 3
    G3, D4, A4, A4s, D5, A5s, _8, _16, A5s, _8, _16, A4, A4s, D5, A5s, _4, G4, _8, A4s, D5, A5s, _8, D6, _8, -1,
    D3s, D5, D5s, G5, D6, _8, _16, C6, _8, _16, A4s, D5, D5s, G5, C6, _4, D4s, _8, G4, A4s, _8, A5s, _8, -1,
    F3, C4, C5, F5, C6, _8, _16, A5s, _8, _16, A4s, C5, F5, A5, _4, F4, F5, _8, A4s, C5, _8, D5, _8,
    A3s, F4, A4, A4s, _4, _8, F4, A4, A4s, _4, _8, A3, _8, A5, _8, -1,
    G3, D4, A4, A4s, D5, A5s, _8, A5s, _16, A5s, _16, _8, A4, A4s, D5, _4, G4, A5s, _8, A4s, D5, _8, D6, _8, -1,
    D3s, A3s, D5, D5s, G5, D6, _8, _16, C6, _8, _16, A4s, D5, D5s, G5, C6, _4, D4s, A5s, _8, G4, A4s, _4, -1,
    F3, C4, D5, F5, A5s, D6, _4, C6, _8, A4, C5, D5, F5, C6, _4, F4, _8, A4, C5, A5, _8, A5s, _8,
    A3s, F4, A4s, D5, _4, _8, D4, _8, C4, _4, A3, _8, F4, _8, -1,
    G2, F4, _16, G3, _16, -1, F3, D4, _16, -1, G3, D4, _16, -1, D3, _16, -1, F3, _16, -1, G3, D4, A4, _16, A3, _16, -1, A3s, C4, A4s, _16, G3, _16, -1, F3, D4, A4, _16, -1, G3, D4, A4, _16, -1, D3, _16, -1, G3, _16, -1, F3, F4, _16, G3, _16, -1,
    G2, F4, _16, G3, _16, -1, F3, D4, _16, -1, G3, D4, _16, -1, D3, _16, -1, F3, _16, -1, G3, D4, A4, _16, A3, _16, -1, A3s, C4, A4s, _16, G3, _16, -1, F3, D4, A4, _16, -1, G3, D4, A4, _16, -1, D3, _16, -1, G3, _16, -1, F3, F4, _16, G3, _16, -1,
    G2, F4, _16, G3, _16, -1, F3, D4, _16, -1, G3, D4, _16, -1, D3, _16, -1, F3, _16, -1, G3, D4, F4, A4, D5, _16, A3, _16, A3s, C4, F4, A4s, C5, _8, -1, _16, G2, G3, D4, F4, A4, D5, _8, -1, _16, G2, G3, D4, F4, A4, D5, _8,
    _4, -1, _8, G3, _24, D4, _24, F4, _24, A4s, D5, F5, A5s, D6, _4, F2, F3, C5, F5, A5, C6, _4, -1,
    //part 4
    D1s, D2s, D5, G5, A5s, D6, _8, D2s, _16,A2s, D3s, C5, D5s, G5, C6, _8, D2s, _16, A2s, D3s, C5, D5s, G5, C6, _8, D4s, C5, D5s, G5, C6, _16, A3s, _16, G3, _16, D3s, A4s, D5s, G5, A5s, _16, A2s, _16, D2s, _16, D1s, A4, C5, F5, A5, _8,
    F1, F2, _8, F2, A4s, D5, F5, A5s, _16, C3, F3, _8, F2, _16, C3, F3, A4, C5, F5, A5, _8, F4, _16, C4, _16, A3, A4, C5, F5, _16, F3, _16, C3, _16, F2, _16, F1, _8, -1,
    G1, G2, D5, G5, A5s, D6, _8, G2, _16, D3, G3, C5, F5, A5, C6, _8, G2, _16, D3, G3, C5, F5, A5, C6, _8, G4, _16, D4, _16, A3s, A4s, D5, G5, A5s, _16, G3, _16, D3, _16, G2, _16, G1, A4s, A5s, _8, -1,
    D1, D2, A4, D5, F5, A5, _8, D2, _16, A2, D3, A4s, D5, F5, A5s, _8, D2, _16, A2, D3, F5, A5, D6, F6, _8, D4, _16, A3, _16, F3, A4, D5, F5, A5, _16, D3, _16, A2, _16, D2, _16, D1, A4s, A5s, _8, -1,
    D1s, D2s, G5, A5s, D6s, G6, _8, D2s, _16, A2s, D3s, F5, A5s, D6, F6, _8, D2s, _16, A2s, D3s, D5, F5, A5s, D6, _8, D4s, _16, A3s, _16, G3, A4s, D5, F5, A5s, _16, D3s, _16, A2s, _16, D2s, _16, D1s, A4s, A5s, _8, -1,
    F1, F2, A4s, C5, F5, A5s, _8, F2, _16, C3, F3, _16, A4, A5, _16, F2, _16, C3, F3, G4, C5, F5, G5, _8, F4, _16, C4, _16, A3, A4, A5, _16, F3, _16, C3, _16, F2, _16, F1, A4s, D5, G5, A5s, _8,
    G1, G2, _8, G2, _16, D3, G3, _8, G2, _16, D3, G3, _8, G4, _16, D4, _16, A3s, _16, G3, _16, D3, _16, G2, _16, G1, A4s, _8, -1,
    D2, D3, A4, _16, F4, _16, D3, D4, _16, A3, A4s, _16, F4, _16, D3, D4, _16, A3, A4, _16, F4, _16, D4, A4, _16, A3, _16, F3, F4, _16, D3, _16, A2, _16, F2, _16, D2, D4, D5, _8, -1,
    D2s, D5, G5, A5s, D6, _16, D3s, _16, A2s, C5, C6, _16, D2s, C5, A5s, G5, C6, _16, D1s, _16, D2s, _16, A2s, C5, C6, _16, D3s, _16, D2s, C5, A5s, G5, C6, _16, D3s, _16, A2s, A4s, A5s, _16, D2s, A4s, D5s, G5, A5s, _16, D1s, _16, D2s, _16, A2s, A4s, A5s, _16, D3s, _16, -1,
    F2, A4, C5, F5, A5, _16, F3, _16, C3, _16, F2, A4s, A5s, _16, F1, _16, F2, _16, C3, A4, C5, F5, A5, _16, F3, _16, F2, _16, F3, _16, C3, F4, A4, C5, F5, _16, F2, _16, F1, _16, F2, _16, C3, D4, D5, _16, F3, _16, -1,
    G2, D5, G5, A5s, D6, _16, G3, _16, D3, C5, C6, _16, G2, C5, F5, A5, C6, _16, G1, _16, G2, _16, D3, C5, C6, _16, G3, _16, G2, C5, F5, A5, C6, _16, G3, _16, D3, A4s, A5s, _16, G2, A4s, D5, G5, A5s, _16, G1, _16, G2, _16, D3, A4s, A5s, _16, G3, _16, -1,
    D2, A4, D5, F5, A5, _16, D3, _16, A2, _16, D2, A4s, A5s, _16, D1, _16, D2, _16, A2, F5, A5, D6, F6, _16, D3, _16, D2, _16, D3, _16, A2, A4, D5, F5, A5, _16, D2, _16, D1, _16, D2, _16, A2, A4s, A5s, _16, D3, _16, -1,
    D1s, G5, A5s, D6s, G6, _16, D2s, _16, D1s, _16, D2s, F5, A5s, D6, F6, _16, A2s, _16, D3s, _16, A3s, D5, D6, _16, D4s, _16, G4, A4s, D5, F6, A5s, _16, D4s, _16, A3s, _16, D3s, _16, D2s, _8, A4s, A5s, _8, -1,
    F1, F2, A4s, C5, F5, A5s, _4, A4, A5, _8, A3, C4, F4, G4, C5, F5, G5, _4, A4, A5, _8, F2, F3, _8, A4s, D5, G5, A5s, _8,
    //part 5
    D2s, D3s, _16, D4, _16, G4, _16, D3s, D4, _16, G4, _16, D4, _16, D3s, G4, _16, D4, _16, G3, A3s, D5, _16, D4, _16, G4, _16, A4s, _16, D4, _16, G4, _16, A4s, _16, D4, _16, -1,
    G2, G3, D5, _16, D4, _16, F4, _16, G3, A4s, _16, D4, _16, F4, _16, G3, A4s, _16, D4, _16, A3s, D4, D5, _16, D4, _16, F4, _16, A4s, _16, D4, _16, F4, _16, A4s, _16, D4, _16, -1,
    F2, F3, C5, _16, C4, _16, F4, _16, F3, A4s, _16, C4, _16, F4, _16, F3, A4s, _16, C4, _16, A3, C4, C5, _16, C4, _16, F4, _16, A4s, _16, C4, _16, F4, _16, A4s, A5s, _8, -1,
    G2, G3, D6, _16, F5, _16, D5, _16, G3, C6, _16, F5, _16, D5, _16, G3, C6, _16, F5, _16, A3s, D4, D5, _16, F5, _16, A5, _16, F5, _16, D5, _16, F5, _16, A5s, _16, G5, _16,
    D2s, D3s, D5, _16, G5, _16, D5, _16, D3s, G5, _16, D5, _16, G5, _16, D3s, D5, _16, G5, _16, A3s, G4, D6, _16, D5, _16, G5, _16, A5s ,_16, D5, _16, G5, _16, A5s, _16, D5, _16, -1,
    G2, G3, D6, _16, D5, _16, F5, _16, G3, A5s, _16, D5, _16, F5, _16, G3, A5s, _16, D5, _16, D4, A4s, D6, _16, D5, _16, F5, _16, A5s, _16, D5, _16, F5, _16, A5s, _16, D5, _16, -1,
    F2, F3, C6, _16, C5, _16, F5, _16, F3, A5s, _16, C5, _16, F5, _16, F3, A5s, _16, C5, _16, C4, A4, C6, _16, C5, _16, F5, _16, A5s, _16, C5, _16, F5, _16, A5s, _16, C5, _16, -1,
    G2, G3, A5, _16, D5, _16, A4s, _16, G3, D5, _16, A4s, _16, D5, _16, G3, A4s, _16, D5, _16, G4, A5s, _16, A4, _16, A4s, _16, D5, _16, G5, _8, A5s, A6s, _8, -1,
    //part 6
    D3s, C6, C7, _16, F4, _16, D4s, A5s, A6s, _16, F4, C6, C7, _16, A3s, _16, G4, _16, A4, A5s, A6s, _16, A4s, _16, F5, C6, C7, _16, D5, _16, C5, A5s, A6s, _16, D5, C6, C7, _16, D4s, _16, A4s, _16, A4, A5s, A6s, _16, A4s, _16, -1,
    G3, A5, A6, _16, F4, _16, D4, A5, A6, _16, F4, A5, A6, _16, A3s, _16, G4, _16, A4, A5, A6, _16, A4s, _16, F5, A5, A6, _16, D5, _16, C5, A5, A6, _16, D5, A5, A6, _16, G4, _16, A4s, _16, A4, A5s, A6s, _16, A4s, _16, -1,
    F3, C6, C7, _16, F4, _16, C4, A5s, A6s, _16, F4, C6, C7, _16, A3s, _16, F4, _16, A4s, A5s, A6s, _16, C5, _16, F5, C6, C7, _16, C5, _16, A4s, A5s, A6s, _16, C5, C6, C7, _16, F4, _16, A4s, _16, A4, A5s ,A6s, _16, A4s, _16, -1,
    G3, A5, A6, _16, F4, _16, D4, A5, A6, _16, F4, A5, A6, _16, A3s, _16, G4, _16, A4, A5, A6, _16, A4s, _16, F5, A5, A6, _16, D5, _16, C5, A5, A6, _16, D5, A5, A6, _16, G4, _16, A4s, _16, A4, A5s, _16, A4s, _16, -1,
    D3s, C5, D5s, G5, C6, _16, D4s, _16, G3, A3s, A4s, A5s, _16, D3s, C5, D5s, G5, C6, _16, D2s, _16, D2s, _16, G3, A3s, A5s, A6s, _16, D4s, _16, D3s, C6, D6s, G6, C7, _16, D4s, _16, G3, A3s, A5s, A6s, _16, D3s, C6, D6s, G6, C7, _16, D2s, _16, D3s, _16, G3, A3s, A4s, A5s, _16, D4s, _16, -1,
    G3, C5, F5, C6, _16, G4, _16, A3s, D4, A4s, A5s, _16, G3, C5, F5, C6, _16, G2, _16, G3, _16, A3s, D4, A5s, A6s, _16, G4, _16, G3, C6, F6, C7, _16, G4, _16, A3s, D4, A5s, A6s, _16, G3, C6, F6, C7, _16, G2, _16, G3, _16, A3s, D4, A4s, A5s, _16, G4, _16, -1,
    F3, C5, F5, C6, _16, F4, _16, A3, C4, A4s, A5s, _16, F3, C5, F5, C6, _16, F2, _16, F3, _16, A3, C4, A5s, A6s, _16, F4, _16, F3, C6, F6, C7, _16, F4, _16, A3, C4, _16, F3, A5s, A6s, _16, F2, _16, F3, _16, A3, C4, C6, F6, C7, _16, F4, _16,
    G3, _16, G4, _16, A3s, D4, A5s, A6s, _16, G3, _16, G2, _4, G3, A3s, D4, G5, A5, A5s, D6, G6, _8, _16, G3, A3s, D4, G5, A5, A5s, D6, G6, _8, _16, G3, A3s, D4, G5, A5, A5s, D6, G6, _8,
    //part 7
    D1s, D2s, _20, _20, D3, _20, G3, _20, D2s, A3, _20, A3s, _20, D4, _20, D2s, G4, _20, A4, _20, A4s, _20, A2s, D3s, G3, D5, _24, D4, _24, G4, _24, A4, _24, D2s, A4s, _24, D5, _24, G5, _24, A5, _24, D2s, A5s, _24, D6, _24, G6, _24, A6, _24, -1,
    F1, F2, A6s, _20, C7, _20, A6s, _20, F6, _20, F2, C6, _20, A5s, _20, C6, _20, F2, A5s, _20, F5, _20, C5, _20, F3, A3, C4, A5, _20, F5, _20, C5, _20, A4s, _20, F2, A4, _20, F4, _20, C4, _20, F2, A3s, _20, A3, _20, _20, -1,
    G1, G2, D5, G5, A5s, D6, _20, _20, D3, _20, G3, _20, G2, A3, _20, A3s, _20, D4, _20, G2, G4, _20, A4, _20, A4s, _20, D3, G3, A3s, D5, _24, D4, _24, G4, _24, A4, _24, G2, A4s, _24, D5, _24, G5, _24, A5, _24, G2, A5s, _24, D6, _24, G6, _24, A6, _24, -1,
    D1, D2, C7, _20, D7, _20, C7, _20, A6s, _20, D2, F6, _20, C6, _20, D6, _20, D2, C6, _20, A5s, _20, F5, _20, F3, A3, C4, C6, _20, A5s, _20, A5, _20, F5, _20, D2, C5, _20, A4s, _20, A4, _20, D2, F4, _20, C4, _20, _20 ,-1,
    D1s, D2s, G5, A5, A5s, D6, G6, _20, _20, D3, _20, G3, _20, D2s, A3, _20, A3s, _20, D4, _20, D2s, G4, _20, A4, _20, A4s, _20, A2s, D3s, G3, D5, _24, D4, _24, G4, _24, A4, _24, D2s, A4s, _24, D5, _24, G5, _24, A5, _24, D2s, A5s, _24, D6, _24, G6, _24, A6, _24, -1,
    F1, F2, A6s, _20, C7, _20, A6s, _20, F6, _20, F2, C6, _20, A5s, _20, C6, _20, F2, A5s, _20, F5, _20, C5, _20, F3, A3, C4, A5, _20, F5, _20, C5, _20, A4s, _20, F2, A4, _20, F4, _20, C4, _20, F2, A3s, _20, A3, _20, _20, -1,
    G1, G2, D5, G5, A5s, D6, _20, _20, D3, _20, G3, _20, G2, A3, _20, A3s, _20, D4, _20, G2, G4, _20, A4, _20, A4s, _20, D3, G3, A3s, D5, _24, D4, _24, G4, _24, A4, _24, G2, A4s, _24, D5, _24, G5, _24, A5, _24, G2, A5s, _24, D6, _24, G6, _24, A6, _24, -1,
    D1, D2, C7, _20, D7, _20, C7, _20, A6s, _20, D2, F6, _20, C6, _20, D6, _20, D2, C6, _20, A5s, _20, F5, _20, F3, A3, C4, C6, _20, A5s, _20, A5, _20, F5, _20, D2, C5, _20, A4s, _20, A4, _20, D2, F4, _20, C4, _20, _20, -1,
    D2s, D6, _16, A2s, G5, _16, F3, D5, _16, G3, A5s, _16, D3s, G5, _16, G3, D5, _16, A3s, G5, _16, D4, D5, _16, D2s, D6, _16, A2s, G5, _16, F3, D5, _16, G3, A5s, _16, D3s, G5, _16, G3, D5, _16, A3s, G5, _16, D4, D5, _16, -1,
    F2, C6, _16, C3, F5, _16, G3, C5, _16, A3, A5, _16, F3, F5, _16, A3, C5, _16, A3s, F5, _16, C4, C5, _16, F2, C6, _16, C3, F5, _16, G3, C5, _16, A3, A5, _16, F3, F5, _16, A3, C5, _16, A3s, F5, _16, C4, C5, _16, -1,
    G2, A6s, _16, D3, D6, _16, G3, A5s, _16, A3, A6s, _16, G3, D6, _16, A3s, A5s, _16, C4, A6s, _16, D4, A5s, _16, G2, A6s, _16, D3, D6, _16, G3, A5s, _16, A3, A6, _16, G3, D6, _16, A3s, A5s, _16, C4, F6, _16, D4, A5s, _16, -1,
    D2, D6, _16, A2, F5, _16, D3, D5, _16, F3, D6, _16, D3, F5, _16, F3, D5, _16, A3, D6, _16, D4, D5, _16, D2, D6, _16, A2, F5, _16, D3, D5, _16, F3, C6, _16, D3, F5, _16, A3, D5, _16, D4, D6, _8, -1,
    D1s, D2s, A5s, D6, _32, A6s, _32, D6, _32, A6s, _32, D2s, D3s, D6, _32, A6s, _32, D6, _32, A6s, _32, D2s, D3s, D6, _32, A6s, _32, D6, _32, A6s, _32, D2s, D3s, D6, _32, A6s, _32, D6, _32, A6s, _32, D2s, D3s, A6s, _32, D6s, _32, D6, _32, A5s, _32, A5s, _32, D5s, _32, D5, _32, A4s, _32, A4s, _32, D4s, _32, D4, _32, A3s, _32, A3s, _32, D3s, _32, D3, _32, A2s, _32, -1,
    F1, F2, A5s, D6, _32, A6s, _32, D6, _32, A6s, _32, F2, F3, D6, _32, A6s, _32, D6, _32, A6s, _32, F2, F3, D6, _32, A6s, _32, D6, _32, A6s, _32, F2, F3, D6, _32, A6s, _32, D6, _32, A6s, _32, F2, F3, A6s, _32, D6s, _32, D6, _32, A5s, _32, A5s, _32, D5s, _32, D5, _32, A4s, _32, A4s, _32, D4s, _32, D4, _32, A3s, _32, A3s, _32, D3s, _32, D3, _32, A2s, _32, -1,
    G1, G2, A5s, D6, _32, A6s, _32, D6, _32, A6s, _32, G2, G3, D6, _32, A6s, _32, D6, _32, A6s, _32, G2, G3, D6, _32, A6s, _32, D6, _32, A6s, _32, G2, G3, D6, _32, A6s, _32, D6, _32, A6s, _32, G2, G3, A6s, _32, D6s, _32, D6, _32, A5s, _32, A5s, _32, D5s, _32, D5, _32, A4s, _32, A4s, _32, D4s, _32, D4, _32, A3s, _32, A3s, _32, D3s, _32, D3, _32, A2s, _32, -1,
    D1, D2, C6, F6, _32, C7, _32, F6, _32, C7, _32, D2, D3, F6, _32, C7, _32, F6, _32, C7, _32, D2, D3, F6, _32, C7, _32, F6, _32, C7, _32, D2, D3, F6, _32, C7, _32, F6, _32, C7, _32, D2, D3, C7, _32, A6s, _32, F6, _32, C6, _32, C6, _32, A5s, _32, F5, _32, C5, _32, C5, _32, A4s, _32, F4, _32, C4, _32, C4, F4, _32, A3s, _32, F3, _32, C3, _32, -1,
    //part 8
    G2, F4, _16, G3, _16, -1, F3, D4, _16, -1, G3, D4, _16, -1, D3, _16, -1, F3, _16, -1, G3, D4, A4, _16, -1, A3, _16, -1, A3s, C4, A4s, _16, -1, G3, _16, -1, F3, D4, A4, _16, -1, G3, D4, A4, _16, -1, D3, _16, -1, G3, _16, -1, F3, F4, _16, -1, G3, _16, -1,
    D2s, F4, _16, G3, _16, -1, F3, D4, _16, -1, G3, D4, _16, -1, D3, _16, -1, F3, _16, -1, G3, D4, A4, _16, -1, A3, _16, -1, A3s, C4, A4s, _16, -1, G3, _16, -1, F3, D4, A4, _16, -1, G3, D4, A4, _16, -1, D3, _16, -1, G3, _16, -1, F3, F4, _16, -1, G3, _16, -1,
    F2, F4, _16, G3, _16, -1, F3, D4, _16, -1, G3, D4, _16, -1, D3, _16, -1, F3, _16, -1, G3, D4, A4, _16, -1, A3, _16, -1, A3s, C4, A4s, _16, -1, G3, _16, -1, F3, D4, A4, _16, -1, G3, D4, A4, _16, -1, D3, _16, -1, G3, _16, -1, F3, F4, _16, -1, G3, _16, -1,
    G2, F4, _16, G3, _16, -1, F3, D4, _16, -1, G3, D4, _16, -1, D3, _16, -1, F3, _16, -1, G3, D4, A4, _16, -1, A3, _16, -1, A3s, C4, A4s, _16, -1, G3, _16, -1, F3, D4, A4, _16, -1, G3, D4, A4, _16, -1, D3, _16, -1, G3, _16, -1, F3, F4, _16, -1, G3, _16, -1,
    G2, D4, F4, D5, _16, G3, A4, _16, -1, A3s, D4, A4s, _16, -1, A3s, D4, F4, _16, -1, G3, _16, -1, A3, _16, -1, A3s, D4, D5, _16, -1, G3, A4, _16, -1, A3, C4, A4s, _16, -1, G3, F4, _16, -1, A3s, D4, _16, -1, A3s, D4, _16, -1, G3, D5, _16, -1, A3, A4, _16, -1, D4, F4, A4s, _16, -1, G3, _16, -1,
    D2s, D4, F4, D5, _16, D3s, A4, _16, -1, A3s, D4, A4s, _16, -1, A3s, D4, F4, _16, -1, G3, _16, -1, A3, _16, -1, A3s, D4, D5, _16, -1, G3, A4, _16, -1, A3, C4, A4s, _16, -1, G3, F4, _16, -1, A3s, D4, _16, -1, A3s, D4, _16, -1, G3, D5, _16, -1, A3, A4, _16, -1, D4, F4, A4s, _16, -1, G3, _16, -1,
    F2, D4, F4, D5, _16, F3, A4, _16, -1, A3s, D4, A4s, _16, -1, A3s, D4, F4, _16, -1, G3, _16, -1, A3, _16, -1, A3s, D4, D5, _16, -1, G3, A4, _16, -1, A3, C4, A4s, C5, _16, F4, _16, G3, _16, A3s, D4, D5, _8, G2, _16, G3, D4, F4, A4s, D5, _8,
    _8, D5s, D6s, _8, D5, D6, _8, G4, _24, A4, _24, A4s, _24, D5, D6, D7, _4, C6, C7, _4, -1,
    D3s, A3s, D4s, D7, _16, G6, _16, D6s, _16, D4s, C7, _16, G6, _16, D6s, _16, D4s, C7, _16, D6s, _16, A4s, D5s, G5, C7, _16, G6, _16, D6s, _16, A6s, _16, G6, _16, D6s, _16, A6s, _16, D6s, _16, -1,
    F3, C4, F4, A6, _16, F6, _16, C6, _16, F4, A6s, _16, F6, _16, C6, _16, F4, A6, _16, C6, _16, C5, F5, A5, C6, _16, C6, _16, F6, _16, C6, _16, C6, _16, C6, _16, F6, _16, A6, _16, -1,
    G3, D4, G4, D7, _16, G6, _16, D6, _16, G4, C7, _16, G6, _16, D6, _16, G4, C7, _16, D6, _16, D5, G5, A5s, C7, _16, G6, _16, D6, _16, A6s, _16, G6, _16, D6, _16, A6s, _16, D6, _16, -1,
    D3, A3, D4, A6, _16, F6, _16, D6, _16, D4, A6s, _16, F6, _16, D6, _16, D4, F7, _16, D6, _16, D5, F5, A5, D6, _16, D6, _16, A6, _16, D6, _16, D6, _16, D6, _16, F6, _16, A6s, _16, -1,
    D3s, A3s, D4s, G7, _16, A6s, _16, G6, _16, D4s, F7, _16, A6s, _16, G6, _16, D4s, D7, _16, D6s, _16, A4s, D5s, G6, D6s, _16, D6s, _16, A6s, _16, D6s, _16, D6s, _16, D6s, _16,A6s, _16, D6s, _16, -1,
    F3, C4, F4, A6s, _16, F6, _16, C6, _16, F4, C6, _16, A6, _16, C6, _16, F4, G6, _16, C6, _16, C5, F5, A5, C6, _16, C6, _16, A6, _16, C6, _16, C6, _16, C6, _16, A5s, D6, A6s, _8,
    G3, D4, _16, G4, _16, A4s, _16, D4, _16, G4, _16, A4s, _16, D4, _16, G4, _16, D5, _16, D4, _16, G4, _16, A4s, _16, D4, _16, G4, _16, A4s, A5s, _16, D4, _16, -1,
    D3, A3, D5, F5, A5, _16, D4, _16, F4, _16, A3, A5s, _16, D4, _16, F4, _16, A3, A5, _16, D4, _16, D5, _16, A4, _16, F4, F5, _16, D4, _16, A3, _16, F3, _16, D3, D5, _8, -1,
    D3s, A3s, D5s, G5, D6, _16, D4s, _16, D4s, C6, _16, D4s, D5s, G5, C6, _16, G4, A4s, _16, D4s, _16, D4s, C6, _16, D4s, _16, D3s, A3s, D5s, G5, C6, _16, D4s, _16, D4s ,A5s, _16, D4s, D5s, G5, A5s, _16, G4, A4s, _16, D4s, _16, D4s, A5s, _16, D4s, _16, -1,
    F3, C4, C5, F5, A5, _16, F4, _16, F4, _16, F4, A5s, _16, A4, C5, _16, F4, _16, F4, C5, F5, A5, _16, F4, _16, F3, C4, _16, F4, _16, F4, F5, _16, F4, _16, A4, C5, _16, F4, _16, F4, D5, _16, F4, _16, -1,
    G3, D4, F5, A5s, D6, _16, G4, _16, G4, C6, _16, G4, F5, A5s, C6, _16, A4s, D5, _16, G4, _16, G4, C6, _16, G4, _16, G3, D4, F5, A5s, C6, _16, G4, _16, G4, A5s, _16, G4, F5, A5s, _16, A4s, D5, _16, G4, _16, G4, A5s, _16, G4, _16, -1,
    D3, A3, D5, F5, A5, _16, D4, _16, D4, _16, D4, A5s, _16, F4, A4, _16, D4, _16, D4, A5, D6, F6, _16, D4, _16, D3, A3, _16, D4, _16, D4, A5, _16, D4, _16, F4, A4, _16, D4, _16, D4, A5s, _16, D4, _16, -1,
    D3s, A3s, A5s, D6s, G6, _16, D4s, _16, D4s, _16, D4s, F6, _16, G4, A4s, _16, D4s, _16, D4s, A5s, D6, _16, D4s, _16, D3s, A3s, _16, D4s, _16, D4s, G5, A5s, _16, D4s, _16, G4, A4s, _16, D4s, _16, D4s, A5s, _16, D4s, _16, -1,
    F3, C5, F5, A5s, _16, C4, _16, F4, _16, G4, _16, A4, A5, _16, C5, _16, F5, G5, _16, C5, _16, A4, _16, G4, _16, F4, A5, _16, C4, _16, F3, _8, A4s, D5, G5, A5s, _8,
    D2s, D3s, _16, D4, _16, G4, _16, D3s, A4s, _16, D4, _16, G4, _16, D3s, A4s, _16, D4, _16, G3, A3s, D5, _16, D4, _16, G4, _16, A4s, _16, D4, _16, G4, _16, A4s, _16, D4, _16, -1,
    F2, F3, C5, _16, C4, _16, F4, _16, F3, A4s, _16, C4, _16, F4, _16, F3, A4s, _16, C4, _16, A3, C4, C5, _16, C4, _16, F4, _16, A4s, _16, C4, _16, F4, _16, A4s, A5s, _8, -1,
    G2, G3, C6, _16, F5, _16, D5, _16, G3, A5s, _16, F5, _16, D5, _16, G3, C6, _16, F5, _16, A3s, D4, D5, _16, F5, _16, A5s, _16, F5, _16, D5, _16, F5, _16, C6, _16, F5, _16,
    D2, D3, D5, _16, F5, _16, D6, _16, D3, F5, _16, D5, _16, F5, _16, D3, D5, _16, F5, _16, F3, A3, D4, D5, _16, F5, _16, D5, _16, F5, _16, D5, _16, F5, _16, A5s, _8, -1,
    D2s, D3s, A5s, D6, G6, _16, G5, _16, G5, _16, D3s, A5s, D6, F6, _16, F5, _16, F5, _16, D3s ,F5 ,A5s, D6, _16, D5, _16, A3s, D4s, G4, D5, _16, D5, _16, D4s, D5, F5, A5s, _16, A3s, A4s, _16, G3, A4s, _16, D3s, A4s, _16, A2s, D5, F5, A5s, _16, D2s, _16, -1,
    F2, F3, A5s, D6, G6, _16, G5, _16, G5, _16, F3, A5s, D6, F6, _16, F5, _16, F5, _16, F3, F5, A5s, D6, _16, D5, _16, C4, F4, A4, D5, _16, D5, _16, F4, D5, F5, A5s, _16, C4, A4s, _16, A3, A4s, _16, F3, A4s, _16, C3, D5, F5, A5s, _16, F2, _16, -1,
    G2, G3, A5s, D6, G6, _16, G5, _16, G5, _16, G3, A5s, D6, F6, _16, F5, _16, F5, _16, G3, F5, A5s, D6, _16, D5, _16, D4, G4, A4s, D5, _16, D5, _16, G4, D5, F5, A5s, _16, D4, A4s, _16, A3s, A4s, _16, G3, A4s, _16, D3, D5, F5, A5s, _16, G2, _16, -1,
    D2, D3, A5s, D6, G6, _16, G5, _16, G5, _16, D3, A5s, D6, F6, _16, F5, _16, F5, _16, D3, F5, A5s, D6, _16, D5, _16, F3, A3, D4, D5, _16, D5, _16, D4, D5, F5, A5s, _16, A3, _16, D3, _16, A2, _16, D2, D4, D5, _8, -1,
    //part 9
    D1s, D2s, D5, G5, A5s, D6, _8, A3s, D4s, G4, _16, C5, D5s, G5, C6, _16, D2s, D3s, _8, A3s, D4s, G4, C5, D5s, G5, C6, _8, D2s, D3s, C5, D5s, G5, C6, _8, A3s, D4s, G4, _16, A4s, D5s, G5, A5s, _16, D2s, D3s, _8, A3s, D4s, G4, A4s, D5s, G5, A5s, _8, -1,
    F1, F2, A4, C5, F5, A5, _8, A3, C4, F4, _16, A4s, A5s, _16, F2, F3, _8, A3, C4, F4, A4, C5, F5, A5, _8, F2, F3, _8, A3, C4, F4, A4, C5, F5, _8, F2, F3, _8, A3, C4, F4, D5, _8, -1,
    G1, G2, D5, G5, A5s, D6, _8, A3s, D4, G4, _16, C5, F5, A5, C6, _16, G2, G3, _8, A3s, D4, G4, C5, F5, A5, C6, _8, G2, G3, C5, F5, A5, C6, _8, A3s, D4, G4, _16, A4s, D5, G5, A5s, _16, G2, G3, _8, A3s, D4, G4, A4s, D5, G5, A5s, _8, -1,
    D1, D2, A4, D5, F5, A5, _8, A3, D4, F4, _16, A4s, A5s, _16, D2, D3, _8, A3, D4, F4, F5, A5, D6, F6, _8, D2, D3, _8, A3, D4, F4, A4, D5, F5, A5, _8, D2, D3, _8, A3, D4, F4, A4s, A5s, _8, -1,
    D1s, D2s, G5, A5s, D6s, G6, _8, D2s, A2s, D3s, _16, F5, A5s, D6, F6, _16, D2s, A2s, D3s, _8, D2s, A2s, D3s, D5, D6, _8, A3s, D4s, G4, A4s, D5, F5, A5s, _4, D2s, D3s, _8, A4s, A5s, _8, -1,
    F1, F2, A4s, C5, F5, A5s, _4, A4, A5, _8, A3, C4, F4, G4, C5, F5, G5, _4, A4, A5, _8, F2, F3, _8,A4s, D5, G5, A5s, _8,
    //part 10
    D2s, D3s, _8, G4, _8, A4s, _8, A3s, D4, D5, _8, G4, _8, A4s, _8, A3s, D4, D5, _8, G4, _8, -1,
    G2, G3, C5, _8, G4, _8, A4s, _8, A3s, D4, C5, _8, G4, _8, A4s, _8, A3s, D4, C5, _8, G4, _8, -1,
    F2, F3, C5, _8, F4, _8, A4, _8, A3, C4, A4s, _8, F4, _8, A4, _8, A3, C4, A4s, _8, F4, _8, -1,
    G2, G3, C5, _8, G4, _8, A4, _8, A3s, D4, C5, _8, G4, _8, A4s, _8, A3s, D4, D5, _8, A5s, _8, -1,
    D3s, D5, F5, C6, _8, A3s, _8, G4, A5s, _8, D3s, _8, A3s, A5, _8, G4, _8, D3s, A4s, _8, A3s, D5, _8, -1,
    G3, F4, _8, D4, C5, _8, A4s, D5, _8, G3, F4, _8, D4, C5, _8, A4s, D5, _8, G3, F4, _8, D4, A5s, _8, -1,
    F3, C5, F5, C6, _8, C4, _8, A4, A5s, _8, F3, _8, C4, A5, _8, A4, _8, F3, A4s, _8, C4, C5, _8, -1,
    G3, F4, _8, D4, A4, _8, G4, A4s, _8, G3, F4, _8, D4, A4, _8, G4, A4s, _8, G3, F4, _8, D4, D5, _8, -1,
    D3s, A4s, D5, _8, A3s, _8, G4, D5, _8, D3s, D5, _8, A3s, _8, G4, D6, _8, D3s, D6, _8, A3s, _8,
    G3, F4, _8, D4, C5, _8, A4s, D5, _8, G3, F4, _8, D4, C5, _8, A4s, D5, _8, G3, F4, _8, D4, A5s, _8, -1,
    A5, _4, A5, _8, A5, _4, A5s, _8, A5s, _4, -1,
    G3, D6, _16, D4, G5, _16, G4, D5, _16, A4, C6, _16, G4, G5, _16, A4, D5, _16, A4s, A5s, _16, D5, _16, G5, _16, A5s, _16, A5, _16, A5s, _16, C6, _16, A5s, _16, A5, _16, A5s, _16, -1,
    G3, D6, _16, D4, G5, _16, G4, D5, _16, A4, C6, _16, G4, G5, _16, A4, D5, _16, A4s, A5s, _16, D5, _16, G5, _16, A5s, _16, A5, _16, A5s, _16, C6, _16, A5s, _16, A5, _16, A5s, _16, _4, _4, _4, _4,
  };
  for (auto i : notes)
  {
    switch (i)
    {
      case 0XF9:
        Sleep(two_note);
        continue;
      case 0XFF:
        Sleep(four_note);
        continue;
      case 0XFE:
        Sleep(eight_note);
        continue;
      case 0XFD:
        Sleep(sixteen_note);
        continue;
      case 0XFA:
        Sleep(_32_note);
        continue;
      case 0XFC:
        Sleep(_20_note);
        continue;
      case 0XFB:
        Sleep(_24_note);
        continue;
    }
    voice = (volume << 16) + (i << 8) + 0x94;
    midiOutShortMsg(handle, voice);
  }
  midiOutClose(handle);
}

//call of silence
void call_of_silence(void)
{
  const int eight_note = 500;
  HMIDIOUT handle;
  midiOutOpen(&handle, 0, 0, 0, CALLBACK_NULL);
  int volume = 0x7f , voice = 0x0 , sleep = eight_note;
  int notes[] =
  {
    F4s, _, A4, _,
    D2, A2, D3, F4s, C5s, _, _, _, _, -1, E2, B2, E3, E4, B4, _, _, G4s, _, A4, _, -1,
    F2s, C3s, F3s, E4, B4, _, _, _, _, _, _, C2s, G2s, C3s, E5, _, G4s, _,
    D2, A2, D3, D4, F4s, _, _, _, _, E2, B2, E3, E4, G4s, _, _, F4s, _, B4, _,
    F2s, C3s, F3s, _, A4, _, _, _, _, _, F4s, _, A4, _,
    D2, A2, D3, F4s, C5s, _, _, _, _, E2, B2, E3, E4, B4, _, _, G4s, _, A4, _,
    F2s, C3s, F3s, E4, B4, _, _, _, _, _, _, C2s, G2s, C3s, E5, _, B4, _,
    D2, A2, D3, D4, A4, _, _, _, _, E2, B2, E3, _, _, F4s, _, B4, _,
    F2s, C3s, F3s, _, A4, _, _, _, _, _, _, _,
    _, _, _, _, _, _, F3s, _, C4s, _,
    D2, A2, D3, C4s, _, _, A2, D3, 250, _, _, C4s, _, G3s, _, eight_note, E2, B2, E3, _, _, B2, E3, 250, _, _, F3s, _, A3, _,
    F2s, C3s, F3s, 1000, _, C3s, F3s, _, C3s, F3s, _, C3s, eight_note, F3s, _, C4s, _,
    D2, A2, D3, C4s, _, _, A2, D3, 250, _, _, C4s, _, G4s, _, eight_note, E2, B2, E3, _, _, B2, E3, 250, _, _, A4, _, C4s, _,
    F2s, C3s, F3s, 1000, _, C3s, F3s, _, C3s, F3s, _, C3s, F3s, eight_note, F4s, _, C5s, _,
    D2, A2, D3, C5s, _, _, A2, D3, 250, _, _, C5s, _, G4s, _, eight_note, E2, B2, E3, _, _, B2, E3, 250, _, _, A4, _, E4, _,
    F2s, C3s, F3s, 1000, _, C3s, F3s, _, C3s, F3s, _,C3s, F3s, 250, E4, _, _, C4s, _, E4, _,
    eight_note, D2, A2, D3, _, F4s, _, A2, D3, _, _, E2, B2, E3, _, _, B2, E3, B4, _, 250, A4, _, B4, _,
    F2s, C3s, F3s, eight_note, _, _, C3s, F3s, _, A4, 250, _, F4s,_,1000, C3s, F3s, _, C3s, F3s, _,
    F2s, C3s, F3s, _, _, _, eight_note, C5s, C4s, _, B4, B3, _,
    D2, A2, D3, B3, B4, _, A3, A4, _, D3, F3s, A3, A4, _, 250, D3, E4, E5, _, A2, _, eight_note, E2, B2, E3, A3, A4, _, _, E3, G3s, G4s, _, 250, E3, A3, A4, _, B2, _,
    F2s, F3s, _, _, C3s, _, F3s, _, A3, _, _, C3s, _, F3s, _, G3s, _, _, C3s, _, F3s, _, F2s, F3s, C5s, C4s, _, C3s, _, F2s, F3s, B3, B4, _, C3s, _,
    D2, A2, D3, B3, B4, _, _, A3, A4, _, D3, F3s, _, E3, E4, _, D3, _, A2, C5s, C4s, _, D2, _, E2, B2, E3, B3, B4, _, _, _, _, E3, G3s, B3, C4s, C5s, _, _, E3, A3, A4, _, B2, _,
    250,
    F2s, F3s, _, _, C3s, _, F3s, _, A3, _, _, C3s, _, F3s, _, G3s, _, _, C3s, _, F3s, _, F2s, F3s, C5s, C4s, _, C3s, _, F2s, F3s, B3, B4, _, C3s, _,
    D2, A2, D3, B3, B4, _, _, A3, A4, _, _, D3, F3s, A3, A4, _, _, D3, E4, E5, _, A2, _, E2, B2, E3, E4, E5, _, _, E4, E5, _, _, E3, G3s, B3, B4, _, _, E3, A3, A4, _, B2, _,
    F2s, F3s, _, _, C3s, _, F3s, _, A3, _, _, C3s, _, F3s, _, G3s, _, _, C3s, _, F3s, _, F3s, F4s, _, F2s, F3s, _, C3s, A3, A4, _, F2s, _,
    D2, A2, D3, B3, B4, _, _, _, _, D3, F3s, A3, B3, B4, _, _, D3, A3, A4, _, A2, _, E2, B2, E3, B3, B4, _, _, C4s, C5s, _, _, E3, G3s, B3, B4, _, _, E3, B3, B4, _, B2, _,
    eight_note, F2s, _, C3s, A3, A4, _, F3s, _, C3s, _, G3s, _, C3s, A5, _, F3s, G5s, _, 250, C3s, C5s, _, C5s, F5s, _,
    eight_note, D3, _, A3, _, D4,_, 250, A3, F5s, _, E5, G5s, _, eight_note, E3, _, B3, _, E4, _, 250, B3, B5, _, A5, _,
    eight_note, F3s, _, C4s, _, F4s, _, C4s, _, G4s, _, C4s, A5, _, F4s, G5s, _, 250, C4s, C5s, _, C5s, F5s, _,
    eight_note, D3, _, A3, _, D4, C5s, F5s, _, A3, _, E3, _, B3, A5, _, E4, G5s, _, 250, B3, E5, _, A4, _,
    eight_note, F3s, _, C4s, _, F4s, _, C4s, _, G4s, _, C4s, A5, _, F4s, G5s, _, 250, C4s, A5, _, G5s, B5, _,
    D3, _, _, A3, _, _, D4, _, _, A3, C6s, _, C6s, _, E3, _, _, B3, _, _, E4, _, _, B3, A5, _, G5s, _,
    eight_note, F3s, _, C4s, _, F4s, _, G4s, _, A4, _, _, _, _,
    _, _, 1000, F4s, F5s, _, _, _,
  };
  for (auto i : notes)
  {
    switch (i)
    {
      case 1000:
      case 250:
      case 500:
        sleep = i;
        continue;
      case 0XFF:
        Sleep(sleep);
        continue;
    }
    voice = (volume << 16) + (i << 8) + 0x94;
    midiOutShortMsg(handle, voice);
  }
  midiOutClose(handle);
}

//回家
void HOM(void)
{
  HMIDIOUT handle;
  midiOutOpen(&handle, 0, 0, 0, CALLBACK_NULL);
  // midiOutShortMsg(handle, 34 << 8 | 0xC0);
  int volume = 0x7f , voice = 0x0 , sleep = 360;
  int hom[] =
  {
   _,_,M2,M3,M3,M5,M5,_,
   _,_,M2,M3,M3,M5,M5,_,
    _,H1,_,M5,M6,_,H1,_,
    H1,_,_,0,M6,M4,300,500,M5,400,M6,M5,M4,M3,M2,M1,300,
    M1,_,M2,M3,M3,M5,M5,_,
    _,H1,_,M5,M6,_,H1,_,
    H1,_,_,0,M6,M4,300,M5,_,_,_,
    _,_,M2,M3,M3,M5,M5,_,
    _,_,M2,500,M2,300,M3,M3,M5,M5,_,
    _,_,M5,500,M5,300,M6,M6,_,_,0,M3,M1,300,
    M2,_,_,_,_,_,_,
    _,_,M2,500,M2,300,M3,M3,M5,M5,_,
    _,_,M5,500,M5,300,M6,M6,_,_,0,M3,M1,300,
    M2,_,_,_,_,M6,M7,
    H1,_,M7,H1,_,M6,M7,H1,
    H1,_,M7,H1,H1,_,0,700,M3,M6,M7,300,
    H1,_,0,H1,M7,H1,H3,300,H3,H2,H1,500,M6,300,M7,
    M7,_,_,_,M3,M6,M7,
    H1,_,M7,H1,_,M6,500,M6,300,M7,H1,
    M7,_,0,M6,M5,M3,M2,300,M1,_,_,700,0,M1,300,
    M6,M5,M6,M3,M3,M1,M3,M2,
    M2,700,0,M3,300,_,_,_,M3,M6,M7,
    H1,_,M7,H1,_,M6,500,M6,300,M7,H1,
    M7,_,0,M6,M5,M3,M2,300,M1,_,_,700,0,M1,300,
    M6,M5,M4,M3,M3,M2,M1,M2,
    M2,_,M5,M4,M3,M2,700,0,M3,300,
    0,M2,300,M1,700,500,M1,300,M2,M3,M3,M5,M5,
    M1,_,M2,M3,M3,M5,M5,_,
    _,H1,_,M5,M6,_,H1,_,
    H1,_,_,0,M6,M4,300,M5,_,_,_,
    _,_,M2,M3,M3,M5,M5,_,
    _,_,M2,M3,M3,M5,M5,_,
    _,H1,_,M5,M6,_,H1,_,
    H1,_,_,0,M6,M4,300,500,M5,400,M6,M5,M4,M3,M2,M1,300,
    M1,_,M2,M3,M3,M5,M5,_,
    _,H1,_,M5,M6,_,H1,_,
    H1,_,_,0,M6,M4,300,M5,_,_,_,
    _,_,M2,M3,M3,M5,M5,_,
    _,_,M2,500,M2,300,M3,M3,M5,M5,_,
    _,_,M5,500,M5,300,M6,M6,_,_,0,M3,M1,300,
    M2,_,_,_,_,_,_,
    _,_,M2,500,M2,300,M3,M3,M5,M5,_,
    _,_,M5,500,M5,300,M6,M6,_,_,0,M3,M1,300,
    M2,_,_,_,_,M6,M7,
    H1,_,M7,H1,_,M6,M7,H1,
    H1,_,M7,H1,H1,_,0,700,M3,M6,M7,300,
    H1,_,0,H1,M7,H1,H3,300,H3,H2,H1,500,M6,300,M7,
    M7,_,_,_,M3,M6,M7,
    H1,_,M7,H1,_,M6,500,M6,300,M7,H1,
    M7,_,0,M6,M5,M3,M2,300,M1,_,_,700,0,M1,300,
    M6,M5,M6,M3,M3,M1,M3,M2,
    M2,700,0,M3,300,_,_,_,M3,M6,M7,
    H1,_,M7,H1,_,M6,500,M6,300,M7,H1,
    M7,_,0,M6,M5,M3,M2,300,M1,_,_,700,0,M1,300,
    M6,M5,M4,M3,M3,M2,M1,M2,
    M2,_,_,M5,M4,M3,0,M1,L5,300,L4,
    L3,M1,500,M1,300,M2,M3,M3,M5,M5,_,
    M1,_,M2,M3,M3,M5,M5,_,
    _,H1,_,M5,M6,_,H1,_,
    H1,_,_,0,M6,M4,300,M5,500,M5,300,M6,M6,0,M5,M3,300,
    M5,700,0,M6,300,_,_,_,_,M6,0,M5,M3,300,
    M5,_,_,_,_,_,0,M1,L5,M1,M4,300,
    0,M3,M1,300,M2,0,M1,L6,L7,L6,L5,L6,300,L5,700,900,950,L5,L6,M1,
    0,M1,300,M4,0,M3,M2,M1,300,M2,M2,H2,M7,400,850,M6,M5,M3,300,
    M5,_,_,_,M5,_,_,800,M6,M5,M4,M3,M4,300,
    M4,700,0,M5,300,_,_,_,_,0,700,M5,H1,M5,300,
    M4,0,M3,M4,M4,M3,300,M5,M1,_,0,M1,M1,M3,M1,300,
    M2,_,0,M2,M2,M3,M4,300,M4,M3,0,M2,M3,500,M3,0,M2,M1,300,
    0,M2,M1,300,M1,M1,_,_,_,_,960,M1,M2,M3,M4,M5,M6,M7,H1,H2,300,
    H3,850,H2,H1,M7,0,H1,H2,M6,M7,970,M7,M6,M5,M3,M5,M6,0,M7,M7,980,M6,M5,M3,M5,300,
    0,M5,900,800,M3,0,M5,900,800,M3,300,H1,H1,M5,M5,700,800,M4,M3,300,
    M4,0,M3,M1,300,M1,_,_,_,0,700,L5,M1,M4,300,
    0,M3,M1,300,M3,0,M1,L5,L3,L3,L3,M1,300,M1,0,M1,L5,M1,M4,300,
    0,M3,M1,300,M3,0,M1,L5,L3,500,(M3-1),0,L3,L3,M1,300,M1,0,M1,L5,M1,M4,
    M3,M1,300,M3,M3,500,M6,0,L7,900,800,L6,300,L5,_,0,L5,L5,L6,M1,300,M1,
    800,M1,M2,M3,M1,300,M2,800,M2,M5,M3,M5,300,M6,M6,800,M7,M6,M5,M3,350,M5,M6,M7,H1,H2,(H3-1),H3,300,
    H4,700,500,(H3-1),0,H3,300,H2,0,(H1+1),H2,300,H2,500,M6,300,M7,M6,700,0,M7,300,
    H1,_,M7,H1,H1,_,0,H1,H3,H6,H7,300,
    H1,_,0,M7,H1,M7,H1,300,H1,_,0,H1,M3,M6,M7,300,
    H1,_,0,M7,H1,H2,H3,300,H3,_,350,H5,H2,H3,H4,H3,H2,H1,300,
    H2,_,_,0,H3,300,_,M3,M6,M7,
    H1,_,M7,H1,_,M6,500,M6,300,M7,H1,
    500,M6,300,M7,0,M6,M5,M3,M2,300,M1,_,M1,700,0,M1,300,
    500,M5,300,M6,M5,M4,500,M2,300,M3,_,M2,M1,M2,
    M2,700,0,M3,300,_,_,_,M3,M6,M7,
    H1,_,M7,H1,_,M6,500,M6,300,M7,H1,
    500,M6,300,M7,0,M6,M5,M3,M2,300,M1,_,M1,700,0,M1,300,
    500,M5,300,M6,M5,M4,500,M2,300,M3,_,M2,M1,M2,
    M2,M3,0,700,M5,M6,H1,500,H2,300,H3,700,0,H2,300,H1,700,0,M7,300,
    H1,_,M7,H1,H1,_,0,M7,H1,M6,M7,
    M7,_,0,M6,M5,M3,M2,300,M1,_,M1,700,0,M1,300,
    500,M5,300,M6,M5,M6,500,M2,300,M3,_,M1,500,M5,300,M6,700,800,M5,M3,
    M5,_,_,M6,_,M3,M6,M7,
    H1,_,M7,H1,H1,_,0,M7,300,H1,0,H2,300,
    H2,_,500,M6,0,M7,M6,M5,M3,300,M5,700,0,M6,300,_,M1,
    500,M5,300,M6,M5,M4,M3,_,M2,M1,M2,
    M2,700,0,M3,700,M5,M6,H1,300,500,H3,300,H4,_,0,H4,H3,H4,H5,300,
    H5,_,M2,M3,M3,M5,M5,_,
    H5,_,M2,M3,M3,M5,M5,_,
    H5,H1,_,M5,M6,_,H1,_,
    H1,_,_,_,_,_,_,_,
    _,_,M2,M3,M3,M5,M5,_,
    _,_,M2,M3,M3,M5,M5,_,
    _,_,M5,M6,M6,_,_,0,M3,M1,300,
    M2,_,_,H1,M7,0,M6,M5,300,M5,0,M3,M2,300,
    M1,_,M2,M3,M3,M5,M5,_,
    _,_,M2,M3,M3,M5,M5,_,
    _,_,M5,M6,M6,_,_,0,M3,M1,300,M2,_,_,_,_,_,_,_,
  };
    for (auto i : hom)
    {
    switch (i)
    {
      case 0XFF:
      Sleep(360);
      continue;
      case 300:
      sleep = 360;//Sleep(i/2);
      continue;
      case 0:
      Sleep(180);
      continue;
      case 700:
      Sleep(180);
      continue;
      case 400:
      sleep = 240;
      continue;
      case 500:
      sleep = 10;
      continue;
      case 800:
      sleep = 90;
      continue;
      case 900:
      Sleep(90);
      continue;
      case 850:
      sleep = 120;
      continue;
      case 950:
      sleep = 60;
      continue;
      case 960:
      sleep = 80;
      continue;
      case 970:
      sleep = 72;
      continue;
      case 980:
      sleep = 135;
      continue;
      case 350:
      sleep = 154;
      continue;
    }
    voice = (volume << 16) + ((i-5) << 8) + 0x90;
    midiOutShortMsg(handle, voice);
    Sleep(sleep);
  }
  midiOutClose(handle);
}

//童话
void th(void)
{
  HMIDIOUT handle;
  midiOutOpen(&handle, 0, 0, 0, CALLBACK_NULL);
  int volume = 0x7f;
  int voice = 0x0;
  int sleep = 300;
  int tmp =5;
  int th[] =
  {
    H3,_,_,_,_,_,H3,700,0,H2,300,H2,700,0,H1,300,H1,_,_,_,H1,700,0,M7,300,M7,700,0,M6,300,M6,_,_,_,M6,700,0,M5,300,M5,_,_,_,_,L5,M1,L7,M1,700,0,L5,300,L5,_,
    _,L5,M1,L7,M1,700,0,L5,300,L5,_,_,L5,M1,L7,M1,_,_,M1,M1,L6,L6,L5,L5,_,_,_,_,L5,M1,L7,M1,L5,L5,_,_,L5,M3,700,0,M2,300,M2,M1,M1,_,_,L5,M1,L7,M1,L6,_,L6,L6,M1,M6,M5,M5,_,_,_,_,
    M2,M2,M4,M4,M3,M3,_,_,
    M3,M2,L7,M2,700,0,M1,300,M1,0,L7,M1,300,_,
    M1,L7,M1,M4,_,_,L5,M5,M4,M3,M2,M2,_,_,_,_,
    M2,M2,M4,M4,M3,M3,_,_,M3,M3,M7,M7,M6,M7,H1,_,H1,M2,M1,M6,_,_,M6,M6,M5,M5,M5,M5,_,_,_,_,
    L5,M5,M4,M3,_,M3,0,M4,M3,300,_,_,M3,M4,M3,M4,M3,0,M2,M1,300,_,M1,M3,M5,M6,_,M6,0,M6,M5,300,M5,M2,M2,0,M4,M3,300,M3,_,_,_,_,
    M1,M3,M5,M6,_,M6,0,M6,M5,300,M5,M2,M2,M4,M3,M4,M3,0,M2,M1,300,M1,_,M2,0,M2,M3,300,L6,_,L6,M1,M1,_,L7,_,M1,_,_,_,
    _,M3,M4,M5,M6,_,_,M5,M5,_,M6,_,M5,_,M5,_,
    M5,M2,M2,M4,M4,M3,M3,_,_,
    M3,M2,L7,M2,700,0,M1,300,M1,0,L7,M1,300,_,
    M1,L7,M1,M4,_,_,L5,M5,M4,M3,M2,M2,_,_,_,_,
    M2,M2,M4,M4,M3,M3,_,_,M3,M3,M7,M7,M6,M7,H1,_,H1,M2,M1,M6,_,_,M6,M6,M5,M5,M5,M5,_,_,_,_,
    L5,M5,M4,M3,_,M3,0,M4,M3,300,_,_,M3,M4,M3,M4,M3,0,M2,M1,300,_,M1,M3,M5,M6,_,M6,0,M6,M5,300,M5,M2,M2,0,M4,M3,300,M3,_,_,_,_,
    M1,M3,M5,M6,_,M6,0,M6,M5,300,M5,M2,M2,M4,M3,M4,M3,0,M2,M1,300,M1,_,M2,0,M2,M3,300,L6,_,L6,M1,M1,_,L7,_,M1,_,_,_,
    L5,M5,M4,M3,_,M3,0,M4,M3,300,_,_,M3,M4,M3,M4,M3,0,M2,M1,300,_,M1,M3,M5,M6,_,M6,0,M6,M5,300,M5,M2,M2,0,M4,M3,300,M3,_,_,_,_,
    M1,M3,M5,M6,_,M6,0,M6,M5,300,M5,M2,M2,M4,M3,M4,M3,0,M2,M1,300,M1,_,M2,0,M2,M3,300,L6,_,L6,M1,M1,_,L7,_,M1,_,_,_,
    L5,M5,M4,M3,_,M3,0,M4,M3,300,_,_,M3,M4,M3,M4,M3,0,M2,M1,300,_,M1,M3,M5,M6,_,M6,0,M6,M5,300,M5,M2,M2,0,M4,M3,300,M3,_,_,_,_,
    M1,M3,M5,M6,_,M6,0,M6,M7,300,M7,M6,M5,M4,M3,M4,M3,0,M2,M1,300,M1,_,M2,0,M2,M3,300,L6,_,L6,M1,M1,L7,L7,M1,M1,_,_,_,_,_,M2,0,M2,M3,300,0,M3,M2,M3,M2,M1,M2,300,M1,M1,_,M2,0,M2,M3,300,L6,_,L6,M1,M1,L7,L7,M1,M1,_,_,_,_,_,_,_,M1,_,_,_,_,_,_,_,M1,_,_,_,_,_,_,_,
  };
  for (auto i : th)
  {
    switch (i)
    {
    case 300:
      sleep = 300;
      continue;
    case 0:
      sleep = 150;
      continue;
    case 0XFF:
      Sleep(300);
      continue;
    case 1000:
      tmp = +5;
      continue;
    }
    voice = (volume << 16) + ((i + tmp) << 8) + 0x90;
    midiOutShortMsg(handle, voice);
    Sleep(sleep);
  }
  midiOutClose(handle);
}

//喀秋莎
void KQS(void)
{
  HMIDIOUT handle;
  midiOutOpen(&handle, 0, 0, 0, CALLBACK_NULL);
  //midiOutShortMsg(handle, 40 << 8 | 0xC0);
  int volume = 0x7f;
  int voice = 0x0;
  int sleep = 240;int tmp = 5;
  int kqs[] =
  {
    0,M2,M1,L7,M1,M2,M3,(M4 + 1),M5,M3,_,_,M1,M3,_,_,M1,M4,_,M4,700,0,M4,300,M3,M2,M3,M1,L7,_,_,L3,L7,_,_,L3,M2,0,M2,M2,300,M1,L7,L6,_,_,_,
    M3,_,M6,700,0,M6,300,M5,_,M6,700,0,M5,300,M4,_,M3,700,0,M2,300,M3,_,L6,_,_,M4,_,M2,M3,_,_,M1,L7,0,L3,L3,300,M1,L7,L6,_,M1,L7,L6,L3,_,_,L3,_,M1,L7,L6,L3,_,_,
    H3,_,H6,_,H5,_,H6,H5,H4,_,H3,H2,H3,_,M6,_,_,H4,_,H2,H3,_,_,H1,M7,M3,H1,M7,M6,_,_,_,_,_,
    L6,_,_,_,L7,M1,_,_,_,L6,M1,_,_,L7,L6,L7,_,L3,_,L7,_,_,M1,M2,_,_,_,L7,M2,M2,M1,L7,L6,_,_,_,
    M3,_,M6,_,M5,_,M6,M5,M4,_,M3,M2,M3,_,L6,_,_,M4,_,M2,M3,_,_,_,M1,L7,L3,M1,L7,L6,_,_,_,
    L6,_,_,_,L7,M1,_,_,_,L6,M1,_,_,L7,L6,L7,_,L3,_,L7,_,_,M1,M2,_,_,_,L7,M2,M2,M1,L7,L6,_,_,_,
    M3,_,M6,_,M5,_,M6,M5,M4,_,M3,M2,M3,_,L6,_,_,M4,_,M2,M3,_,_,_,M1,L7,L3,M1,L7,L6,_,_,_,
    //L6,_,_,_,L7,M1,_,_,_,L6,M1,_,_,L7,L6,L7,_,L3,_,L7,_,_,M1,M2,_,_,_,L7,M2,M2,M1,L7,L6,_,_,_,
    H3,_,H6,_,H5,_,H6,H5,H4,_,H3,H2,H3,_,M6,_,_,H4,_,H2,H3,_,_,H1,M7,M3,H1,M7,M6,_,_,_,_,_,
    L6,_,_,_,L7,M1,_,_,_,L6,M1,_,_,L7,L6,L7,_,L3,_,L7,_,_,M1,M2,_,_,_,L7,M2,M2,M1,L7,L6,_,_,_,
    M3,_,M6,_,M5,_,M6,M5,M4,_,M3,M2,M3,_,L6,_,_,M4,_,M2,M3,_,_,_,M1,L7,L3,M1,L7,M6,_,_,_,
    M3,_,M6,_,M5,_,M6,M5,M4,_,M3,M2,M3,_,L6,_,_,M4,_,M2,M3,_,_,_,M1,L7,L3,M1,L7,M6,_,_,_,M3,_,M6,_,M5,_,M6,M5,M4,_,M3,M2,M3,_,L6,_,_,M4,_,M2,M3,_,_,_,M1,L7,L3,M1,L7,L6,_,_,_
    ,M4,_,_,_,M2,M3,_,_,_,M1,L7,L3,M1,L7,L6,_,_,_,
    H4,_,_,_,H2,H3,_,_,_,H1,M7,M3,H1,M7,M6,_,_,_,
  };
  for (auto i : kqs)
  {
    switch (i)
    {
    case 0:
      sleep = 120;
      continue;
    case 700:
      Sleep(120);
      continue;
    case 0XFF:
      Sleep(240);
      continue;
    case 1000:
      tmp = -2;
      continue;
    }
      // if (i == 900) volume += 100;
    voice = (volume << 16) + ((i + tmp) << 8) + 0x90;
    midiOutShortMsg(handle, voice);
    Sleep(sleep);//midiOutShortMsg(handle, 0x7BB0);
  }
  midiOutClose(handle);
}

//青春青春症候群

typedef struct note
{
  int pitch; // 音高
  int time; // 时长
} note;

// 谱面
note guitar_1[]{
  /*1*/{0, 4}, {0, 4},

  /*2*/{E4, 4}, {0, 8}, {E4, 8}, {0, 4}, {D4, 4},   {0, 1},   {D4, 8}, {C4, 8}, {D4, 8}, {A4, 8}, {0, 8}, {D4, 8}, {0, 8}, {C4, 8},
  /*5*/{0, 8}, {D4, 8}, {0, 8}, {E4, 16}, {F4, 16}, {E4, 8}, {D4, 8}, {C4, 8}, {A3, 8},   {D4, 8}, {C4, 8}, {D4, 8}, {A4, 8}, {0, 8}, {D4, 8}, {0, 8}, {C4, 8},
  /*7*/{0, 8}, {D4, 8}, {0, 8}, {E4, 16}, {F4, 16}, {E4, 4}, {0, 4},   {D4, 8}, {C4, 8}, {D4, 8}, {A4, 8}, {0, 8}, {D4, 8}, {0, 8}, {C4, 8},
  /*9*/{0, 8}, {D4, 8}, {0, 8}, {E4, 16}, {F4, 16}, {E4, 8}, {D4, 8}, {C4, 8}, {A3, 8},   {D4, 8}, {C4, 8}, {D4, 8}, {A4, 8}, {0, 8}, {D4, 8}, {0, 8}, {C4, 8},
  /*11*/{0, 8}, {C5, 8}, {D5, 8}, {A4, 8}, {G4, 8}, {A4, 16}, {G4, 16}, {F4, 4},
  //   <--Rhythm Checked
  //主唱开始
  /*12*/{D4, 8}, {C4, 8}, {D4, 8}, {A4, 8}, {0, 8}, {D4, 8}, {0, 8}, {C4, 8},
  /*13*/{0, 8}, {D4, 8}, {0, 8}, {E4, 16}, {F4, 16}, {E4, 8}, {D4, 8}, {C4, 8}, {A3, 8},   {D4, 8}, {C4, 8}, {D4, 8}, {A4, 8}, {0, 8}, {D4, 8}, {0, 8}, {C4, 8},
  /*15*/{0, 8}, {D4, 8}, {0, 8}, {E4, 16}, {F4, 16}, {E4, 4}, {0, 4},   {D4, 8}, {C4, 8}, {D4, 8}, {A4, 8}, {0, 8}, {D4, 8}, {0, 8}, {C4, 8},
  /*17*/{0, 8}, {D4, 8}, {0, 8}, {E4, 16}, {F4, 16}, {E4, 8}, {D4, 8}, {C4, 8}, {A3, 8},   {D4, 8}, {C4, 8}, {D4, 8}, {A4, 8}, {0, 8}, {D4, 8}, {0, 8}, {C4, 8},
  /*19*/{0, 8}, {D4, 8}, {0, 8}, {A3, 2}, {0, 8},  {F5, 8}, {D5, 16}, {F5, 32}, {D5, 32}, {C5, 8}, {D5, 4}, {C5, 8}, {A4, 8}, {G4s, 8},
  /*21*/{G4, 8}, {F4, 8}, {G4, 8}, {A4, 8}, {G4, 8}, {F4, 8}, {0, 8}, {C4, 8},
  /*22*/{G411, 8}, {G310, 8}, {G211, 8}, {G214, 4}, {G213, 8}, {G211, 8},/*欠8分之一拍*/  {A4, 16}, {A4s, 16}, {A4, 16}, {A4s, 16}, {A4, 16}, {A4s, 16}, {A4, 2}, {0, 4},/*还8分之一拍*/
  /*24*/{D4, 4}, {0, 8}, {C4s, 4}, {0, 8}, {E4, 8}, {0, 8},  {D4, 4}, {0, 8}, {C4, 8}, {D4, 8}, {D4, 8}, {0, 4},   {D4, 4}, {0, 8}, {C4s, 4}, {0, 8}, {E4, 8}, {0, 8},
  /*27*/{0, 8}, {F5, 8}, {D5, 8}, {C5, 8}, {B4, 8}, {A4, 8}, {B4, 8}, {A4, 8},
  /*28*/{D4, 4}, {0, 8}, {C4s, 4}, {0, 8}, {E4, 8}, {0, 8},  {D4, 4}, {0, 8}, {C4, 8}, {D4, 8}, {D4, 8}, {0, 4},   {G310, 8},{G310, 8}, {0, 8}, {G312, 4}, {G312, 8}, {0, 4},
  /*31*/{A2s, 8}, {C4s, 8}, {G3, 8}, {F4, 4}, {G3, 8}, {C4s, 8}, {G3, 8},  {G410,8},{0,8},{0,4},{G410,8},{0,8},{0,4},   {G33, 8}, {G33, 8}, {G33, 8}, {G33, 8}, {G37, 8}, {G37, 8},{G37, 8},{G37, 8},   {G36, 8},  {G36, 8}, {G36, 8}, {G36, 8},{G39, 8}, {G39, 8},{G39, 8},{G39, 8},
  //   <--Rhythm Checked
  /*35*/{G37, 8}, {G37, 8},{G37, 8},{G37, 8},{G37, 8},{G37, 8},{G37, 8},{G37, 8},  {G310, 8},{G310, 8},{G310, 8},{G310, 8},{G310, 8},{G310, 8},{G310, 8},{G310, 8},
  /*37*/{G312,8},{G312,8},{G312,8},{G412,4},{G312,4},{G412,8},  {G411,8},{G412,8},{G39,8},{G310,8},{0,8},{G19,4},{G18,32},{G17,32},{G16,32},{0,32},  {G23,8},{G23,8},{G23,8},{G23,8},{G23,8},{G23,8},{G23,4},  {G24,8},{G24,8},{G24,8},{G24,8},{G24,8},{G24,8},{G24,4},
  /*41*/{G33,8},{G33,8},{G33,8},{G33,8},{G37,8},{G37,8},{G37,8},{G37,8},  {G36,8},{G36,8},{G36,8},{G36,8},{G39,8},{G39,8},{G39,8},{G39,8},  {G310,8},{G310,8},{G310,8},{G310,8},{G310,8},{G310,8},{G312,8},{G312,8},  {G314,8},{G314,8},{G314,8},{G314,8},{G310,8},{G310,8},{G310,8},{G310,8},
  /*45*/{G45,8},{G45,8},{G45,8},{G45,4},{G63,8},{G45,8},{G63,8},  {G65,8},{G53,8},{G37,8},{G35,4},{G35,8},{G45,8},{G55,8},   {G26,8},{G26,8},{G26,8},{G26,8},{G210,8},{G210,8},{G210,8},{G210,8},  {G211,4},{G211,4},{0,8},{G213,4},{0,8},
  /*49*/{G113,8},{G113,8},{G113,8},{G113,8},{G113,8},{G113,8},{G113,8},{G113,8},  {G112,8},{G112,8},{G112,8},{G112,8},{G115,8},{G115,8},{G115,8},{G115,8},  {G213,8},{G213,8},{G213,8},{G213,8},{G213,8},{G213,8},{G213,8},{G213,8},   {G113,8},{G113,8},{G113,8},{G113,4},/*长度为一拍半的无头无尾滑音*/{G35,32},{G36,32},{G37,32},{G38,32},{G39,32},{G310,16},{G39,32},{G38,32},{G37,32},{G36,32},{G35,32},/*长度为一拍半的无头无尾滑音*/
  /*53*/{G35,8},{G36,8},{G37,4},{G38,8},{G39,8},{G310,4},   {G37,8},{G38,8},{G39,4},{G10,8},{G11,8},{G12,4},   {G37,8},{G39,8},{G310,8},{G28,8},{0,8},{G210,4},{0,8},  {G28,8},{G56,8},{G56,8},{G28,4},{G28,8},{G28,4},
  /*57*/{G113,8},{G113,8},{G113,8},{G113,8},{G113,8},{G113,8},{G113,8},{G113,8},  {G112,8},{G112,8},{G112,8},{G112,8},{G115,8},{G115,8},{G115,8},{G115,8},  {G213,8},{G213,8},{G213,8},{G213,8},{G213,8},{G213,8},{G213,8},{G213,8},   {G113,8},{G113,8},{G113,8},{G113,4},/*长度为一拍半的无头无尾滑音*/{G35,32},{G36,32},{G37,32},{G38,32},{G39,32},{G310,16},{G39,32},{G38,32},{G37,32},{G36,32},{G35,32},/*长度为一拍半的无头无尾滑音*/
  /*61*/{G45,8},{G45,8},{G45,8},{G45,4},{G63,8},{G45,8},{G63,8},  {G65,8},{G53,8},{G37,8},{G35,4},{G35,8},{G45,8},{G55,8},   {G26,8},{G26,8},{G26,8},{G26,8},{G210,8},{G210,8},{G210,8},{G210,8},  {G211,4},{G211,4},{0,2},
  /*65*/{G213,16},{G214,16},{G215,8},{0,8},{G45,16},{G46,16},{G47,8},{G45,8},{G35,8},{G35,4},/*借8*/  {G43,8},{G45,16},{G46,16},{G47,4},{G53,4},{G55,8},/*还8*/  {G43,8},{G44,8},{G45,4},{G32,8},{G33,8},{G35,8},{G36,8},  {G37,4},{G38,8},{G39,8},{G310,8},{G311,8},{0,4},
  /*69*/{G37,8},{G35,8},{G37,8},{G15,8},{0,8},{G37,8},{0,8},{G35,8},   {0,8},{G26,8},{0,8},{G25,8},{0,8},{G35,4},{0,8},   {G35,8},{G35,8},{0,8},{G39,8},{G39,8},{0,8},{G310,8},{G310,8},
  //OVER
  /*72*/{0,1}
};

note bass[]{
  /*1*/{0, 4}, {0, 4},

  /*2*/{C2, 4}, {0, 8}, {C2, 8}, {0, 4}, {A2s, 4},   {0, 1},   {0, 1},   {0, 1},   {0, 1},   {0, 1},   {0, 1},
  /*9*/{0, 1},   {0, 1},   {0, 1},   {0, 1},   {0, 1},   {0, 1},   {0, 1},   {0, 1},  {0, 1},   {0, 1},
  /*19*/{0, 8}, {F3, 8}, {G3, 8}, {C3, 8}, {D3, 8}, {G2, 8}, {A2, 8},{B210,8},
  /*20*/{B46, 8}, {B46, 8}, {0, 8}, {B45, 4}, {B45, 8}, {0, 8}, {B35, 4},/*借八分*/   {B212, 8}, {0, 8}, {B310, 8}, {B312, 8}, {B210, 8}, {B212, 8}, {B110, 8},/*还八分*/
  /*22*/{B311, 8}, {B212, 8}, {B311, 8}, {B310, 8}, {0, 8}, {B310, 8}, {0, 8}, {B38, 4},/*借八分*/   {B37, 8}, {0, 8}, {B35, 8}, {0, 8}, {B48, 8}, {B45, 4},/*还八分*/
  //   <--Rhythm Checked
  /*24*/{B46, 8}, {B46, 8}, {0, 8}, {B45, 4}, {B45, 8}, {0, 8}, {B33, 16},{B34,16},   {B35, 8}, {B35, 8}, {0, 8}, {B25, 8}, {0, 4}, {B35, 4},   {B46, 8}, {B46, 8}, {0, 8}, {B45, 4}, {B45, 8}, {0, 8}, {B45, 8},
  /*27*/{0, 8}, {B35, 8}, {0, 8}, {B310, 8}, {B312, 8}, {B210, 8}, {B212, 8}, {B110, 8},  {B46, 8}, {B46, 8}, {0, 8}, {B45, 4}, {B45, 8}, {0, 8}, {B35, 4},/*借八分*/
  /*29*/{B212, 8}, {0, 8}, {B210, 4}, {B310, 8}, {B312, 4},/*还八分*/   {B25, 8}, {B35, 8}, {B25, 8}, {B25, 32}, {B25, 32}, {B27, 16}, {0, 8}, {B27, 8}, {0, 8}, {B27, 8},   {B28, 8}, {B38, 8}, {B28, 4}, {B16, 8}, {B16, 8}, {B28, 4},   {0,1},
  /*33*/{B46, 4}, {B46, 8}, {B46, 8}, {B46, 8}, {B46, 8}, {B46, 8}, {B46, 8},  {B45, 8}, {B45, 8}, {B27, 8}, {B25, 4}, {B25, 8}, {B37, 8}, {B37, 8},   {B35, 8}, {B35, 8}, {B35, 8}, {B35, 8}, {B35, 8}, {B35, 8}, {B35, 8}, {B35, 8},   {B35, 8}, {B35, 8}, {B38, 8}, {B38, 8}, {B25, 8}, {B26, 8}, {B27, 4},
  //   <--Rhythm Checked
  /*37*/{B43, 4}, {B43, 8}, {B43, 4}, {B43, 8}, {B43, 8}, {B43, 8},  {B34, 8}, {B34, 8}, {B34, 8}, {B25, 4}, {B25, 8}, {B34, 8}, {B34, 8},  {0, 4}, {B40, 8}, {B40, 8}, {B41, 8}, {B41, 8}, {B45, 8}, {B45, 8},   {B36, 8}, {B36, 8}, {B38, 8}, {B38, 8}, {B310, 8}, {B28, 8}, {B310, 4},
  /*41*/{B46, 4}, {B46, 8}, {B46, 8}, {B46, 8}, {B46, 8}, {B46, 8}, {B46, 8},   {B45, 8}, {B45, 8}, {B312, 4}, {B310, 4}, {B412, 4},   {B410, 8}, {B410, 8}, {B410, 8}, {B410, 8}, {B410, 8}, {B410, 8}, {B410, 8}, {B410, 8},  {B38, 8}, {B38, 8}, {B310, 8}, {B310, 8}, {B27, 8}, {B27, 8}, {B210, 4},
  /*45*/{B43, 4}, {B43, 8}, {B43, 4}, {B43, 8}, {B43, 8}, {B43, 8},  {B45, 4}, {B45, 8}, {B45, 4}, {B45, 8}, {B45, 8}, {B45, 8},  {B46, 8}, {B46, 8}, {B46, 8}, {B46, 8}, {B46, 8}, {B46, 8}, {B46, 8}, {B46, 8},  {B48, 4}, {B48, 4}, {0, 8}, {B48, 8}, {B48, 4},
  /*49*/{B46, 4}, {B46, 8}, {B46, 8}, {B46, 8}, {B46, 8}, {B46, 8}, {B46, 8},  {B46, 8}, {B46, 8}, {B46, 8}, {B35, 4}, {B38, 8},{B25,8},{B28,8},   {B45, 4}, {B45, 8}, {B45, 8}, {B45, 8}, {B45, 8}, {B45, 8}, {B45, 8},   {B35, 8}, {B35, 8}, {B38, 8}, {B38, 8}, {B35, 8}, {B35, 8}, {B37, 16}, {B36, 16}, {B35, 32}, {B34, 32}, {B33, 32}, {0, 32},
  //   <--Rhythm Checked
  /*53*/{B43, 4}, {B43, 8}, {B43, 4}, {B43, 8}, {B43, 8}, {B43, 8},   {B34, 8}, {B34, 8}, {B34, 8}, {B25, 4}, {B25, 8}, {B34, 8}, {B34, 8},   {0, 4}, {B40, 8}, {B40, 8}, {B41, 8}, {B41, 8}, {B45, 8}, {B45, 8},  {B36, 8}, {B36, 8}, {B38, 8}, {B38, 8}, {B310, 8}, {B28, 8}, {B310, 4},
  /*57*/{B28, 8}, {B28, 8}, {B27, 8}, {B27, 8}, {B310, 8}, {B310, 8}, {B38, 8}, {B38, 8},  {B46, 8}, {B46, 8}, {B48, 8}, {B48, 8}, {B410, 8}, {B38, 8}, {B48, 4},   {B45, 8}, {B45, 8}, {B45, 8}, {B45, 8}, {B45, 8}, {B45, 8}, {B45, 8}, {B45, 8},   {0, 4}, {B40, 8}, {B40, 8}, {B41, 8}, {B41, 8}, {B45, 8}, {B45, 8},
  /*61*/{B43, 4}, {B43, 8}, {B43, 4}, {B43, 8}, {B43, 8}, {B43, 8},  {B45, 4}, {B45, 8}, {B45, 4}, {B45, 8}, {B45, 8}, {B45, 8},   {B46, 8}, {B46, 8}, {B46, 8}, {B46, 8}, {B46, 8}, {B46, 8}, {B46, 8}, {B46, 8},  {B210, 8}, {B210, 8}, {B38, 8}, {B38, 8}, {B310, 8}, {B210, 8}, {B310, 4},
  /*65*/{B46, 8}, {B46, 8}, {0, 8}, {B45, 4}, {B45, 8}, {0, 8}, {B35, 4},/*借八分*/   {B210, 32}, {B211, 32}, {B212, 8}, {B211, 32}, {B210, 32}, {B310, 8}, {B312, 8}, {B210, 8}, {B212, 8}, {B110, 8}, /*还八分*/   {B310, 8}, {B212, 8}, {B310, 8}, {B312, 4}, {B312, 4}, {B410, 8},    {B312, 8}, {B212, 4}, {B210, 4}, {B112, 8}, {B110, 16}, {B19, 16}, {B18, 32}, {B17, 32}, {B16, 32}, {0, 32},
  /*69*/{0, 1},     {0, 1},     {B20, 8}, {B20, 8}, {0, 8}, {B40, 8}, {B40, 8}, {0, 8}, {B41, 8}, {B41, 8},
  //OVER
  /*72*/{0,1}
  //   <--Rhythm Checked
};

note voice[]{
  /*1*/{0, 4}, {0, 4},

  /*2*/{0, 1},   {0, 1},   {0, 1},   {0, 1},   {0, 1},   {0, 1},   {0, 1},   {0, 1},   {0, 1},
  /*11*/{0, 2}, {0, 4}, {0, 8}, {A3, 8},   {F4, 8}, {F4, 8}, {F4, 8}, {F4, 4}, {E4, 8}, {D4, 8}, {C4, 8},
  /*13*/{D4, 4}, {C4, 4}, {A3, 4}, {0, 8}, {A3, 8},   {F4, 8}, {F4, 8}, {F4, 8}, {F4, 4}, {E4, 8}, {D4, 8}, {C4, 8},
  /*15*/{D4, 4}, {C4, 4}, {D4, 4}, {0, 8}, {A3, 8},   {F4, 8}, {F4, 8}, {F4, 8}, {F4, 4}, {E4, 8}, {D4, 8}, {C4, 8},
  /*17*/{D4, 4}, {C4, 4}, {A3, 4}, {0, 8}, {A3, 8},   {F4, 8}, {F4, 8}, {F4, 8}, {F4, 8}, {F4, 8}, {F4, 8}, {A4, 4},
  /*19*/{G4, 4}, {C4, 8}, {C4, 8}, {E4, 4}, {D4, 4},  {0, 1},   {0, 1},   {0, 1},

  /*23*/{0, 2}, {0, 4}, {0, 8}, {A3, 8},   {F4, 8}, {F4, 8}, {F4, 8}, {F4, 4}, {E4, 8}, {D4, 8}, {C4, 8},
  /*25*/{D4, 4}, {C4, 4}, {A3, 4}, {0, 8}, {A3, 8},   {F4, 8}, {F4, 8}, {F4, 8}, {F4, 4}, {E4, 8}, {D4, 8}, {C4, 8},
  /*27*/{D4, 4}, {C4, 4}, {D4, 4}, {0, 8}, {A3, 8},   {F4, 8}, {F4, 8}, {F4, 8}, {F4, 4}, {E4, 8}, {D4, 8}, {C4, 8},
  /*29*/{D4, 4}, {C4, 4}, {A3, 4}, {0, 8}, {A3, 8},   {F4, 8}, {F4, 8}, {F4, 8}, {F4, 8}, {F4, 8}, {F4, 8}, {A4, 4},
  /*31*/{G4, 4}, {C4, 8}, {C4, 8}, {E4, 4}, {D4, 4},  {0, 1},
  //高潮部分
  /*33*/{A4, 2}, {D4, 2},   {G4, 2}, {A4s, 2},   {A4, 2}, {0, 4}, {F4, 4},//打ち鳴らせ、ひ
  /*36*/{C5, 4}, {A4s, 4}, {A4, 4}, {G4, 2},  {F4, 4}, {0, 4}, {F4, 4},   {E4, 4}, {F4, 4}, {0, 4}, {F4, 4}, //かりのファズで、雷鳴を、と
  /*39*/{G4, 4}, {F4, 4}, {G4, 4}, {A4, 2},   {A4s, 4}, {A4, 8}, {G4, 4}, {0, 8},
  /*41*/{A4, 2}, {D4, 2},   {G4, 2}, {A4s, 2},   {A4, 2}, {0, 4}, {F4, 4},
  /*44*/{C5, 4}, {A4s, 4}, {A4, 4}, {G4, 2},  {F4, 4}, {0, 4}, {C4, 8}, {E4, 4},   {E4, 8}, {F4, 4}, {0, 4}, {F4, 4},
  /*46*/{G4, 4}, {F4, 4}, {G4, 4}, {F4, 4},  {G4, 4}, {A4, 4}, {G4, 4}, {F4, 4},
  //重复一遍
  /*48*/{A4, 2}, {D4, 2},   {G4, 2}, {A4s, 2},   {A4, 2}, {0, 4}, {F4, 4},
  /*51*/{C5, 4}, {A4s, 4}, {A4, 4}, {G4, 2},  {F4, 4}, {0, 4}, {F4, 4},   {E4, 4}, {F4, 4}, {0, 4}, {F4, 4},
  /*54*/{G4, 4}, {F4, 4}, {G4, 4}, {A4, 2},   {A4s, 4}, {A4, 8}, {G4, 4}, {0, 8},
  /*56*/{A4, 2}, {D4, 2},   {G4, 2}, {A4s, 2},   {A4, 2}, {0, 4}, {F4, 4},
  /*58*/{C5, 4}, {A4s, 4}, {A4, 4}, {G4, 2},  {F4, 4}, {0, 4}, {C4, 8}, {E4, 4},   {E4, 8}, {F4, 4}, {0, 4}, {F4, 4},
  /*61*/{G4, 4}, {F4, 4}, {G4, 4}, {F4, 4},   {G4, 4}, {A4, 4}, {G4, 4}, {F4, 4},
  //OVER
  /*63*/{0,1},{0,1},{0,1},{0,1},{0,1},{0,1},{0,1},{0,1},
  /*72*/{0,1}
};

note guitar_2[]{
  /*1*/{0, 4}, {0, 4},
  /*2*/{F4, 4}, {0, 8}, {F4, 8}, {0, 4}, {F4, 4},   {0,1},   {G66, 8},{G66,8},{0,8},{G65,8},{G65,8},{0,8},{G55,8},{G55,8},
  /*5*/{0,1},  {G55,8},{G55,8},{0,8},{G57,8},{G57,8},{0,8},{G53,8},{G53,8},  {0,1},  {G66, 8},{G66,8},{0,8},{G65,8},{G65,8},{0,8},{G55,8},{G55,8},
  /*9*/{0,1},  {G55,8},{G55,8},{0,8},{G53,8},{G53,8},{0,8},{G53,8},{G53,8},  {0,1},  {G66, 8},{G66,8},{0,8},{G65,8},{G65,8},{0,8},{G55,8},{G55,8},
  /*13*/{0,1},  {G55,8},{G55,8},{0,8},{G57,8},{G57,8},{0,8},{G53,8},{G53,8},  {0,1},  {G66, 8},{G66,8},{0,8},{G65,8},{G65,8},{0,8},{G55,8},{G55,8},
  /*17*/{0,1},  {G55,8},{G55,8},{0,8},{G53,8},{G53,8},{0,8},{G53,8},{G53,8},  {0,1},  {G66,8},{G66,8},{0,8},{G65,4},{G65,8},{0,8},{G55,4},/*借8*/
  /*21*/{G55,8},{G55,8},{G55,8},{G55,8},{G55,8},{G55,8},{0,8},  {G54,8},{G54,8},{0,8},{G62,8},{0,8},{G62,8},{0,8},{G61,4},/*借8*/  {G61,8},{G61,8},{G61,4},{G61,8},{G61,4},  {G66,8},{G66,8},{0,8},{G65,4},{G65,8},{0,4},
  /*25*/{G55,8},{G55,8},{0,8},{G55,4},{G55,8},{0,4},  {G66,8},{G66,8},{0,8},{G65,4},{G65,8},{0,4},  {G47,8},{G47,8},{G55,8},{G55,8},{G47,8},{G47,8},{G55,8},{G55,8},  {G66,8},{G66,8},{0,8},{G65,4},{G65,8},{0,4},
  /*29*/{G55,8},{G55,8},{0,8},{G55,4},{G55,8},{0,4},  {G63,8},{G63,8},{0,8},{G65,4},{G65,8},{0,4},  {G66,8},{G66,8},{G66,8},{G66,8},{G66,8},{G66,8},{G66,8},{G66,8},  {0,4},{G410,8},{0,8},{0,4},{G410,8},{0,8},
  /*33*/{G66,4},{G66,8},{G66,4},{G66,8},{G66,8},{G66,8},  {G65,4},{G65,8},{G65,4},{G65,8},{G65,8},{G65,8},  {G55,4},{G55,8},{G55,4},{G55,8},{G55,8},{G55,8},   {G55,4},{G55,8},{G55,4},{G55,8},{G55,8},{G55,8},
  /*37*/{G63,4},{G63,8},{G63,4},{G63,8},{G63,8},{G63,8},  {G54,4},{G54,8},{G54,4},{G54,8},{G54,8},{G54,8},  {G55,4},{G55,8},{G55,4},{G55,8},{G55,8},{G55,8},   {G56,4},{G56,8},{G56,4},{G56,8},{G56,8},{G56,8},
  /*41*/{G66,4},{G66,8},{G66,4},{G66,8},{G66,8},{G66,8},  {G65,4},{G65,8},{G65,4},{G65,8},{G65,8},{G65,8},  {G55,4},{G55,8},{G55,4},{G55,8},{G55,8},{G55,8},   {G55,4},{G55,8},{G55,4},{G55,8},{G55,8},{G55,8},
  /*45*/{G63,4},{G63,8},{G63,4},{G63,8},{G63,8},{G63,8},  {G65,4},{G65,8},{G65,4},{G65,8},{G65,8},{G65,8},  {G66,4},{G66,8},{G66,4},{G66,8},{G66,8},{G66,8},   {G68,4},{G66,4},{0,2},
  /*49*/{G66,4},{G66,8},{G66,4},{G66,8},{G66,8},{G66,8},  {G66,4},{G66,8},{G66,4},{G66,8},{G66,8},{G66,8},  {G65,4},{G65,8},{G65,4},{G65,8},{G65,8},{G65,8},   {G55,4},{G55,8},{G55,4},{G55,8},{G55,8},{G55,8},
  /*53*/{G63,4},{G63,8},{G63,4},{G63,8},{G63,8},{G63,8},  {G54,4},{G54,8},{G54,4},{G54,8},{G54,8},{G54,8},  {G55,4},{G55,8},{G55,4},{G55,8},{G55,8},{G55,8},   {G56,4},{G56,8},{G56,4},{G56,8},{G56,8},{G56,8},
  /*57*/{G66,4},{G66,8},{G66,4},{G66,8},{G66,8},{G66,8},  {G66,4},{G66,8},{G66,4},{G66,8},{G66,8},{G66,8},  {G65,4},{G65,8},{G65,4},{G65,8},{G65,8},{G65,8},   {G55,4},{G55,8},{G55,4},{G55,8},{G55,8},{G55,8},
  /*61*/{G63,4},{G63,8},{G63,4},{G63,8},{G63,8},{G63,8},  {G65,4},{G65,8},{G65,4},{G65,8},{G65,8},{G65,8},  {G66,4},{G66,8},{G66,4},{G66,8},{G66,8},{G66,8},   {G68,4},{G66,4},{0,2},
  /*65*/{G66,8},{G66,8},{G66,8},{G65,4},{G65,8},{0,8},{G68,16},{G69,16},  {G610,8},{G610,8},{G610,8},{G610,4},{G610,8},{G610,8},{0,8},  {G63,8},{G63,8},{G63,8},{G65,4},{G65,8},{G65,8},{G64,16},{G63,32},{G62,32},  {G61,8},{G61,8},{G61,8},{G61,4},{G61,8},{G61,4},
  /*69*/{G43,8},{G42,8},{G43,8},{G21,8},{0,8},{G43,8},{0,8},{G43,8},  {0,8},{G32,8},{0,8},{G30,8},{0,8},{G43,4},{0,8},  {G55,8},{G55,8},{0,8},{G65,8},{G65,8},{0,8},{G61,8},{G61,8},
  //OVER
  /*72*/{0,1}
};

note drums[]{
  /*1*/{0, 4}, {0, 4},

  /*2*/{BS, 4}, {0, 8}, {BS, 8}, {0, 4}, {BS, 4},   {0, 1},   {BS,4},{TM,8},{TM,8},{0,8},{BS,8},{TM,4},
  /*5*/{BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,4},{TM,8},{TM,8},{0,8},{BS,8},{TM,4},   {BS, 4},{TM,8},{TL,16},{TL,16},{BS,8},{BS,8},{TM,8},{BS,8},  {BS,4},{TM,8},{TM,8},{0,8},{BS,8},{TM,4},
  /*9*/{BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,4},{TM,8},{TM,8},{0,8},{BS,8},{TM,4},   {BS, 4},{TM,8},{TL,16},{TL,16},{BS,8},{BS,8},{TM,8},{BS,8},  {BS,4},{TM,8},{TM,8},{0,8},{BS,8},{TM,4},
  /*13*/{BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,4},{TM,8},{TM,8},{0,8},{BS,8},{TM,4},   {BS, 4},{TM,8},{TL,16},{TL,16},{BS,8},{BS,8},{TM,8},{BS,8},  {BS,4},{TM,8},{TM,8},{0,8},{BS,8},{TM,4},
  /*17*/{BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,4},{TM,8},{TM,8},{0,8},{BS,8},{TM,4},   {BS,8},{BS,8},{TM,8},{BS,8},{TM,8},{BS,8},{TH,4},  {BS,8},{TL,16},{TL,16},{TL,8},{BS,4},{BS,8},{TM,8},{BS,8},
  /*21*/{0,8},{TM,8},{BS,8},{TM,8},{BS,8},{TM,8},{BS,4},   {BS,16},{TM,16},{TM,16},{TM,16},{TM,8},{BS,8},{0,8},{BS,8},{TM,8},{BS,8},   {0,8},{TL,8},{BS,8},{TL,8},{BS,8},{TM,16},{TM,16},{BS,16},{TM,16},{TH,8},   {BS,4},{TM,8},{BS,4},{BS,8},{TM,4},
  /*25*/{BS,4},{TM,8},{BS,4},{BS,8},{TM,4},  {BS,4},{TM,8},{BS,4},{BS,8},{TM,4},  {BS,4},{TM,8},{BS,4},{BS,8},{TM,8},{TM,16},{TM,16},  {BS,4},{TM,8},{BS,4},{BS,8},{TM,4},
  /*29*/{BS,4},{TM,8},{BS,4},{BS,8},{TM,4},  {BS,4},{TM,8},{BS,4},{BS,8},{TM,4},  {BS,8},{BS,8},{TM,4},{BS,16},{TM,16},{TM,16},{TM,16},{BS,16},{TM,16},{TM,16},{TM,16},  {BS,4},{BS,4},{BS,4},{BS,4},
  /*33*/{BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,4},{TM,4},{BS,8},{BS,8},{TM,4},
  /*37*/{BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,8},{BS,8},{TM,4},{BS,16},{TM,16},{TM,16},{TM,16},{BS,16},{TM,16},{TM,16},{TM,16},
  /*41*/{BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,4},{BS,4},{BS,16},{TM,16},{BS,8},{BS,8},{0,16},{TM,16},
  /*45*/{BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,8},{BS,8},{TM,4},{BS,16},{TH,16},{TL,8},{BS,8},{TM,16},{TM,16},
  /*49*/{BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,4},{TM,4},{BS,8},{BS,8},{TM,4},
  /*53*/{BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,8},{BS,8},{TM,4},{BS,8},{TM,16},{TM,16},{BS,16},{TM,16},{TM,16},{TM,16},
  /*57*/{BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,4},{TM,4},{BS,8},{BS,8},{TM,4},
  /*61*/{BS,4},{TM,4},{BS,8},{BS,8},{TM,4},  {BS,4},{TM,4},{BS,8},{BS,8},{TM,8},{BS,16},{BS,16},  {TM,8},{BS,8},{TM,8},{BS,8},{TM,8},{BS,8},{TM,8},{BS,8},   {TM,8},{0,16},{TM,16},{BS,8},{TM,16},{TM,16},{BS,16},{TM,16},{TM,16},{TM,16},{BS,16},{TM,16},{TM,16},{TM,16},
  /*65*/{BS,4},{TM,8},{BS,4},{BS,8},{TM,4},  {BS,8},{BS,8},{TM,8},{BS,4},{BS,8},{TM,4},  {BS,4},{TM,8},{BS,4},{BS,8},{TM,4},  {BS,8},{BS,8},{BS,4},{BS,8},{TM,16},{TM,16},{BS,16},{TM,16},{TH,8},
  /*69*/{BS,4},{TM,8},{BS,4},{BS,8},{TM,4},  {BS,8},{BS,8},{TM,4},{BS,16},{TM,16},{TM,16},{TM,16},{TM,8},{TM,8},  {TM,8},{TM,16},{TH,16},{TL,8},{TM,8},{TM,8},{BS,8},{TM,8},{TM,8},
  //OVER
  /*72*/{0,1}
};
//青春症候群
void QCZHQ(void)
{
  HMIDIOUT handle;
  midiOutOpen(&handle, 0, 0, 0, CALLBACK_NULL); //打开midi通道
  int volume[]{ 68, 85, 127, 60, 90 }; //各音轨的音量；最高音量为127, 即0x7f
  float bpm = 240;
  float time_of_whole = 4 * 60 * 1000 / bpm; //一个全音符的时长，单位毫秒

  midiOutShortMsg(handle, 30 << 8 | 0xC0);//设置主音吉他音色
  midiOutShortMsg(handle, 33 << 8 | 0xC1);//贝斯音色
  midiOutShortMsg(handle, 0 << 8 | 0xC2);//人声
  midiOutShortMsg(handle, 30 << 8 | 0xC3);//节奏吉他音色
  midiOutShortMsg(handle, 117 << 8 | 0xC4);//鼓音色

  // 为每个音轨创建一个计时器和记录它们演奏到哪儿了的指针
  struct
  {
    note* where;
    float timer;
  }
  each[5] = {
    {&guitar_1[1], time_of_whole},
    {&bass[1], time_of_whole},
    {&voice[1], time_of_whole},
    {&guitar_2[1], time_of_whole},
    {&drums[1], time_of_whole}
  };
  float cycle = time_of_whole / 32;//以32分音符为循环的最小单位
  int rhythm = 0;
  while (each[0].where < guitar_1 + sizeof(guitar_1) / sizeof(note))
  {
    // 节拍可视化
    rhythm++;
    // 演奏单元
    for (int i = 0; i < 5; i++)
    {
      if (each[i].timer >= time_of_whole / (each[i].where - 1)->time)
      {
        midiOutShortMsg(handle, 0x7BB0 + i);
        if (each[i].where->pitch)
        {
          midiOutShortMsg(handle, (volume[i] << 16) + (each[i].where->pitch << 8) + 0x90 + i);//演奏对应的乐器
        }
        each[i].timer = 0;
        each[i].where++;
      }
      each[i].timer += cycle;
    }
    Sleep(cycle);
  }
  Sleep(2000);
  midiOutClose(handle);
}

//皎洁的笑颜
void jjdxy(void)
{
  HMIDIOUT handIe;
  midiOutOpen(&handIe, 0, 0, 0, CALLBACK_NULL);
  int volume = 0x7f , voice = 0x0 , sleep = 350;
  int wind[] =
  {
    0,D4s,_,G5s,A4s,G5,A4s,G5s,A4s,G5s,A4s,
    0,D4,_,G5,A4s,G5,A4s,G5,A4s,D5s,F5,
    0,C4,_,G5,A4s,G5,A4s,G5,A4s,G5s,A4s,
    0,A3s,_,A5s,A4s,G5s,A4s,G5,A4s,700,F5,
    0,G3s,_,D5s,A4s,D5s,A4s,D5s,A4s,F5,A4s,
    0,G3,_,D5s,A4s,D5s,A4s,D5s,A4s,700,A5s,
    0,F3,_,D5s,A4s,D5s,F5,G5,100,F5,G5,F5,D5s,A4s,
    0,A3s,_,D5s,A4s,D5s,F5,G5,100,F5,G5,F5,D5s,F5,

    0,D3s,_,G5,0,A3s,_,A4s,0,G4,_,G5,A4s,0,D3s,_,G5,0,A3s,_,A4s,0,F4,_,G5s,A4s,
    0,D3s,G5,0,A3s,_,A4s,0,F4,_,G5,A4s,0,D3,_,G5,0,A3s,_,A4s,0,D4s,_,D5s,F5,
    0,C3,_,G5,0,G3,_,A4s,0,D4s,_,G5,A4s,0,C3,_,G5,0,G3,_,A4s,0,D4s,_,G5,G5s,
    0,A2s,A5s,0,G3,_,A4s,0,D4s,700,D6s,0,A2s,_,A5s,0,G3,100,G5s,A5s,G5s,0,D4s,G5,F5,
    0,G2s,_,D5s,0,D3s,_,A4s,0,C4,_,D5s,0,D3s,_,A4s,0,G2s,_,D5s,0,D3s,_,A4s,0,C4,700,A5s,
    0,G2,88,G5,A5s,500,D6s,0,D3s,0,A3s,_,A5s,0,D3s,_,G5s,0,G2,_,G5,0,D3s,_,F5,0,A3s,_,D5s,0,D3s,_,A4s,
    0,F2,_,D5s,0,C3,_,A4s,0,G3,_,D5s,F5,0,F2,_,G5,0,C3,_,100,F5,G5,F5,0,G3,_,D5s,A4s,
    0,A2s,_,D5s,0,G3,_,A4s,0,G3s,_,D5s,0,G3,_,A5s,0,A2s,_,G5s,0,G3,_,100,G5,G5s,G5,0,D4,_,F5,D5s,

    0,F2s,_,A5s,0,C3s,_,C5s,0,A3s,_,A5s,0,C3s,_,C5s,0,F2s,_,A5s,0,C3s,_,C5s,0,G3s,_,B5,0,C3s,_,C5s,
    0,F2,_,A5s,0,D3s,_,D5s,0,G3s,_,A5s,0,D3s,_,D5s,0,A2s,_,A5s,0,G3s,_,D5,0,D4,_,F5s,0,G3s,_,G5s,
    0,D2s,_,A5s,0,A2s,_,D5s,0,F3s,_,A5s,0,A2s,_,D5s,0,D2s,_,A5s,0,A2s,_,D5s,0,F3s,_,B5,0,A2s,_,D5s,
    0,C3s,_,C6s,8,G3s,_,F5,0,E4,_,F6s,G3s,0,F3s,_,C6s,0,C4s,_,100,B5,C6s,B5,0,A4s,_,A5s,G5s,
    0,B2,_,F5s,0,F3s,_,C5s,0,B3,_,F5s,0,F3s,_,C5s,0,C4s,_,F5s,0,F3s,_,C5s,0,D4s,_,700,C6s,
    0,A2s,88,F5s,A5s,C6s,F6s,_,F3s,0,C4s,_,C6s,0,F3,_,B5,0,A2s,_,A5s,0,F3s,_,100,G5s,A5s,G5s,0,C4s,_,F5s,0,_,F3s,_,C5s,
    0,G2s,_,F5s,0,F3s,_,C5s,0,B3,_,F5s,0,D4s,_,G5s,0,A4s,_,A5s,100,G5s,A5s,G5s,_,F5s,C5s,
    0,C3s,_,F5s,0,B3,_,C5s,0,F4s,_,F5s,C6s,B5,100,A5s,B5,A5s,_,G5s,F5s,
    0,F3s,88,F4s,A4s,C5s,F5s,500,C4s,A4s,C4s,A4s,700,C4s,2800,F3s,
  };
  for (auto i : wind)
  {
    switch (i)
    {
      case 500:
      case 300:
      case 400:
        sleep = i;
        continue;
      case 0:
        sleep = 0;
        continue;
      case 88:
        sleep = 88;
        continue;
      case 100:
        sleep = 100;
        continue;
      case _:
        sleep = 350;
        continue;
    }
    voice = (volume << 16) + ((i) << 8) + 0x90;
    midiOutShortMsg(handIe, voice);
    Sleep(sleep);
  }
  midiOutClose(handIe);
}
//火花
void Score(void)
{
  HMIDIOUT handle;
  midiOutOpen(&handle, 0, 0, 0, CALLBACK_NULL);
  int voice = 0x0;      // 声音参数
  int voiceType = 0x94;     // 音色，范围为0x90~0x9f,其中0x99为鼓，其余为钢琴
  int sleep = 148;      // 一个十六分音符的长度  
  int wind[2256][8] =    // 歌曲编排，前两位为主旋律，中间三位为和弦，后三位为鼓
  {
    //这样的一行 为两拍
    /*1*/   { B4,_,D3s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        //每四拍一小节
    /*2*/   { B4,_,E3,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,E4,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },

    /*3*/   { B4,_,F3s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,F4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },

    /*4*/   { B4,_,F4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,F4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
    
    
    /*5*/   { B4,_,D3s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },

    /*6*/   { B4,_,E3,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,E4,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },

    /*7*/   { B4,_,F3s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,F4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },

    /*8*/   { B4,_,F4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,F4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
    
     
    /*9*/   { B4,_,D3s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },

    /*10*/  { B4,_,E3,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,E4,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },

    /*11*/  { B4,_,F3s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,F4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },

    /*12*/  { B4,_,G3s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,G4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,F4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
    
    
    /*13*/  { B4,_,D3s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,_,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,_,_,_,_,_,_},
        { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,_,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,_,_,_,_,_,_},

    /*14*/  { B4,_,E3,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,_,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,_,_,_,_,_,_},
        { B4,_,E4,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,_,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,_,_,_,_,_,_},

    /*15*/  { B4,_,F3s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,_,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,_,_,_,_,_,_},
        { B4,_,F4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,_,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,_,_,_,_,_,_},

    /*16*/  { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,B3,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,_,_,_,_,_,_},
        { B4,_,F3s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,B3,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,_,_,_,_,_,_},
     
    
    /*17*/  { B4,_,D3s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,D4s,_,_,_,_,_},{C5s,_,D4s,_,_,_,_,_},{F5s,_,D4s,_,_,_,_,_},
        { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,C4s,_,_,_,_,_},{B4,_,C4s,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,B3,_,_,_,_,_},

    /*18*/  { B4,_,B3,E3,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,_,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,_,_,_,_,_,_},
        { B4,_,E4,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,_,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,_,_,_,_,_,_},

    /*19*/  { B4,_,F3s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,D4s,_,_,_,_,_},{C5s,_,D4s,_,_,_,_,_},{F5s,_,D4s,_,_,_,_,_},
        { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,C4s,_,_,_,_,_},{B4,_,C4s,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,B3,_,_,_,_,_},

    /*20*/  { B4,_,G3s,D4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,_,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,F4s,_,_,_,_,_},
        { B4,_,C4s,G4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,B3,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,_,_,_,_,_,_},
    
    
    /*21*/  { B4,_,D3s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,D4s,_,_,_,_,_},{C5s,_,D4s,_,_,_,_,_},{F5s,_,D4s,_,_,_,_,_},
        { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,C4s,_,_,_,_,_},{B4,_,C4s,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,B3,_,_,_,_,_},

    /*22*/  { B4,_,B3,E3,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,_,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,_,_,_,_,_,_},
        { B4,_,E4,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,_,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,_,_,_,_,_,_},

    /*23*/  { B4,_,F3s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,D4s,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,D4s,_,_,_,_,_},
        { B4,_,D4s,F4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,C4s,_,_,_,_,_},{B4,_,C4s,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,B3,_,_,_,_,_},

    /*24*/  { B4,_,B3,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,B1,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,_,_,_,_,_,_},
        { B4,_,F3s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,B3,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,_,_,_,_,_,_},

    
    /*25*/  { B4,_,D3s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,D4s,_,_,_,_,_},{C5s,_,D4s,_,_,_,_,_},{F5s,_,D4s,_,_,_,_,_},
        { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,E4,_,_,_,_,_},{B4,_,D4s,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,C4s,_,_,_,_,_},

    /*26*/  { B4,_,B3,E3,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,_,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,_,_,_,_,_,_},
        { B4,_,E4,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,_,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,_,_,_,_,_,_},

    /*27*/  { B4,_,F3s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,D4s,_,_,_,_,_},{C5s,_,D4s,_,_,_,_,_},{F5s,_,D4s,_,_,_,_,_},
        { B4,_,D4s,F4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,C4s,_,_,_,_,_,_},{B4,_,C4s,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,B3,_,_,_,_,_},
     
    /*28*/  { B4,_,G3s,D4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,D4s,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,F4s,_,_,_,_,_},
        { B4,_,C4s,G4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,B3,F4s,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,_,_,_,_,_,_},

    
    /*29*/  { B4,_,D3s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,D4s,_,_,_,_,_},{C5s,_,D4s,_,_,_,_,_},{F5s,_,D4s,_,_,_,_,_},
        { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,C4s,_,_,_,_,_,_},{B4,_,C4s,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,B3,_,_,_,_,_},

    /*30*/  { B4,_,B3,E3,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,B3,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,_,_,_,_,_,_},
        { B4,_,B3,E4,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,B3,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,_,_,_,_,_,_},

    /*31*/  { B4,_,F3s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,C4s,_,_,_,_,_},{C5s,_,C4s,_,_,_,_,_},{F5s,_,C4s,_,_,_,_,_},
        { B4,_,C4s,F4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,D4s,_,_,_,_,_,_},{B4,_,C4s,_,_,F2s,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,B3,_,_,_,_,_},

    /*32*/  { B4,_,B3,F4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,_,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,_,_,_,_,_,_},
        { B4,_,F4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_},{B4,_,_,_,_,_,_,_},{C5s,_,_,_,_,_,_,_},{F5s,_,_,_,_,_,_,_},

    
    /*33*/  { B4,_,D3s,B3,D4s,_,_,_ }, { C5s,_,C4s,_,_,_,_,_ }, { F5s,_,B3,_,_,_,_,_ }, { B4,B5,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { C6s,_,D3s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,B5,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,F5s,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },

    /*34*/  { B4,E5,E3,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,F4s,E4,_,_,_,_,_ }, { C5s,G4s,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,C5s,_,_,_,_,_,_ },

    /*35*/  { B4,_,F3s,_,_,_,_,_ }, { C5s,G5s,_,_,_,_,_,_ }, { B5,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { G5s,_,_,_,_,_,_,_ },
        { B4,_,F4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { G5s,_,_,_,_,_,_,_ }, { B4,F5s,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },

    /*36*/  { B4,_,F4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,F4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },


    /*37*/  { B4,_,D3s,B3,D4s,_,_,_ }, { C5s,_,C4s,_,_,_,_,_ }, { F5s,_,B3,_,_,_,_,_ }, { B4,B5,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { C6s,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,B5,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,F5s,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },

    /*38*/  { B4,E5,E3,E4,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,F4s,E4,_,_,_,_,_ }, { C5s,G4s,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,C5s,_,_,_,_,_,_ },

    /*39*/  { B4,B5,F3s,F4s,_,_,_,_ }, { C5s,B5,_,_,_,_,_,_ }, { F5s,C6s,_,_,_,_,_,_ }, { B4,F5s,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,E5,F4s,_,_,_,_,_ }, { C5s,F5s,_,_,_,_,_,_ }, { G5s,_,_,_,_,_,_,_ }, { B4,F5s,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { G5s,_,_,_,_,_,_,_ },

    /*40*/  { B4,B5,F4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B5,C6s,F6s,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ },

    
    /*41*/  { B4,_,D2s,D3s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,D4s,_,_,_,_,_ }, { C5s,_,D4s,_,_,_,_,_ }, { F5s,_,D4s,_,_,_,_,_ },
        { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,E4,_,_,_,_,_ }, { B4,_,_,D4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,C4s,_,_,_,_,_ },

    /*42*/  { B4,_,E3,B3,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,E4,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,E3,_,_,_,_,_ },

    /*43*/  { B4,_,F2s,F3s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,D4s,_,_,_,_,_ }, { C5s,_,D4s,_,_,_,_,_ }, { F5s,_,D4s,_,_,_,_,_ },
        { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,C4s,_,_,_,_,_ }, { B4,_,C4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,B3,_,_,_,_,_ },

    /*44*/  { B4,_,G3s,D4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,F4s,_,_,_,_,_ },
        { B4,_,C4s,G4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,B3,F4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },


    /*45*/  { B4,_,D2s,D3s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,D4s,_,_,_,_,_ }, { C5s,_,D4s,_,_,_,_,_ }, { F5s,_,D4s,_,_,_,_,_ },
        { B4,_,D4s,_,_,_,_,_ }, { C5s,_,D4s,_,_,_,_,_ }, { F5s,_,E4,_,_,_,_,_ }, { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,C4s,_,_,_,_,_ },

    /*46*/  { B4,_,E3,B3,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,E4,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,E3,_,_,_,_,_ },

    /*47*/  { B4,_,F2s,F3s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,C4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,C4s,_,_,_,_,_ },
        { B4,_,C4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,D4s,_,_,_,_,_ }, { B4,_,C4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,B3,_,_,_,_,_ },

    /*48*/  { B4,_,B2,B3,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,B1, B2,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,F3s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,B3,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },


    /*49*/  { B4,_,D2s,D3s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,E4,_,_,_,_,_ }, { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,C4s,_,_,_,_,_ },

    /*50*/  { B4,_,E3,B3,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,C4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,B3,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },

    /*51*/  { B4,_,F2s,C3s,F3s,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,D4s,_,_,_,_,_ }, { C5s,_,D4s,_,_,_,_,_ }, { F5s,_,D4s,_,_,_,_,_ },
        { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,C4s,_,_,_,_,_ }, { B4,_,C4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,B3,_,_,_,_,_ },

    /*52*/  { B4,_,G3s,D4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,F4s,_,_,_,_,_ },
        { B4,_,D4s,G4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,B3,F4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },


    /*53*/  { B4,_,D2s,D3s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,D4s,_,_,_,_,_ }, { C5s,_,D4s,_,_,_,_,_ }, { F5s,_,D4s,_,_,_,_,_ },
        { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,C4s,_,_,_,_,_ }, { B4,_,C4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,B3,_,_,_,_,_ },

    /*54*/  { B4,_,E3,B3,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,B3,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,B3,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,B3,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },

    /*55*/  { B4,_,F2s,C3s,F3s,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,C4s,_,_,_,_,_ }, { C5s,_,C4s,_,_,_,_,_ }, { F5s,_,C4s,_,_,_,_,_ },
        { B4,_,C4s,_,_,_,_,_ }, { C5s,_,C4s,_,_,_,_,_ }, { F5s,_,D4s,_,_,_,_,_ }, { B4,_,C4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,B3,_,_,_,_,_ },

    /*56*/  { B4,_,B2,F3s,B3,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,B2,F3s,B3,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },

    // 进鼓
    /*57*/  { B4,_,D3s,B3,D4s,_,D2,_ }, { C5s,_,C4s,_,_,_,D2,_ }, { F5s,_,B3,_,_,_,D2,_ }, { B4,B5,_,_,_,_,D2,_ }, { C5s,_,_,_,_,_,D2,_ }, { F5s,_,_,_,_,_,D2,_ },
        { C6s,_,D3s,_,_,_,D2,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,B5,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,F5s,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,D2,_ },

    /*58*/  { B4,E5,E3,_,_,_,D2,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,F4s,E4,_,_,_,D2,_ }, { C5s,G4s,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,D2,_ }, { B4,_,_,_,_,_,D2,_ }, { C5s,_,_,_,_,_,D2,_ }, { F5s,C5s,_,_,_,_,D2,_ },

    /*59*/  { B4,_,F3s,_,_,_,_,_ }, { C5s,G5s,_,_,_,_,_,_ }, { B5,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { G5s,_,_,_,_,_,_,_ },
        { B4,_,F4s,_,_,_,D2,_ }, { C5s,_,_,_,_,_,D2,_ }, { G5s,_,_,_,_,_,D2,_ }, { B4,F5s,_,_,_,_,D2,_ }, { C5s,_,_,_,_,_,D2,_ }, { F5s,_,_,_,_,_,D2,_ },

    /*60*/  { B4,_,F4s,_,_,_,D2,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,F4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
    
    
    /*61*/  { B4,_,D3s,B3,D4s,_,_,_ }, { C5s,_,C4s,_,_,_,_,_ }, { F5s,_,B3,_,_,_,_,_ }, { B4,B5,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { C6s,_,D4s,_,_,_,D2,_ }, { C5s,_,_,_,_,_,D2,_ }, { F5s,B5,_,_,_,_,D2,_ }, { B4,_,_,_,_,_,D2,_ }, { C5s,F5s,_,_,_,_,D2,_ }, { F5s,_,_,_,_,_,D2,_ },

    /*62*/  { B4,E5,E3,E4,_,_,D2,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,F4s,E4,_,_,_,D2,_ }, { C5s,G4s,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,D2,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,D2,_ }, { F5s,C5s,_,_,_,_,_,_ },
    
    /*63*/  { B4,B5,F3s,F4s,_,_,_,_ }, { C5s,B5,_,_,_,_,_,_ }, { F5s,C6s,_,_,_,_,_,_ }, { B4,F5s,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,E5,F4s,_,_,_,D2,_ }, { C5s,F5s,_,_,_,_,D2,_ }, { G5s,_,_,_,_,_,D2,_ }, { B4,F5s,_,_,_,_,D2,_ }, { C5s,_,_,_,_,_,D2,_ }, { G5s,_,_,_,_,_,D2,_ },
        
    /*64*/  { B4,B5,F4s,_,_,_,D2,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B5,C6s,F6s,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ },

    
    /*65*/  { B4,_,D2s,D3s,_,_,C2,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,D4s,_,_,_,_,_ }, { C5s,_,D4s,_,_,_,_,_ }, { F5s,_,D4s,_,_,_,_,_ },
        { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,E4,_,_,_,_,_ }, { B4,_,_,D4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,C4s,_,_,_,_,_ },

    /*66*/  { B4,_,E3,B3,_,_,C2,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,E4,_,_,_,D2,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,E3,_,_,_,C2,_ },

    /*67*/  { B4,_,F2s,F3s,_,_,C2,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,D4s,_,_,_,_,_ }, { C5s,_,D4s,_,_,_,_,_ }, { F5s,_,D4s,_,_,_,_,_ },
        { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,C4s,_,_,_,_,_ }, { B4,_,C4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,B3,_,_,_,_,_ },

    /*68*/  { B4,_,G3s,D4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,F4s,_,_,_,_,_ },
        { B4,_,C4s,G4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,B3,F4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },


    /*69*/  { B4,_,D2s,D3s,_,_,C2,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,D4s,_,_,_,_,_ }, { C5s,_,D4s,_,_,_,_,_ }, { F5s,_,D4s,_,_,_,_,_ },
        { B4,_,D4s,_,_,_,_,_ }, { C5s,_,D4s,_,_,_,_,_ }, { F5s,_,E4,_,_,_,_,_ }, { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,C4s,_,_,_,_,_ },

    /*70*/  { B4,_,E3,B3,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,E4,_,_,_,D2,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,E3,_,_,_,C2,_ },

    /*71*/  { B4,_,F2s,F3s,_,_,C2,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,C4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,C4s,_,_,_,_,_ },
        { B4,_,C4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,D4s,_,_,_,_,_ }, { B4,_,C4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,B3,_,_,_,_,_ },

    /*72*/  { B4,_,B2,B3,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,B1, B2,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,F3s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,B3,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },


    /*73*/  { B4,_,D2s,D3s,_,_,C2,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,E4,_,_,_,_,_ }, { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,C4s,_,_,_,_,_ },

    /*74*/  { B4,_,E3,B3,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,B3,_ }, { F5s,_,_,_,_,_,B3,_ },
        { B4,_,C4s,_,_,_,D2,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,B3,_ }, { B4,_,B3,_,_,_,B3,_ }, { C5s,_,_,_,_,_,B3,_ }, { F5s,_,_,_,_,_,B3,_ },

    /*75*/  { B4,_,F2s,C3s,F3s,_,B3,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,D4s,_,_,_,_,_ }, { C5s,_,D4s,_,_,_,_,_ }, { F5s,_,D4s,_,_,_,_,_ },
        { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,C4s,_,_,_,_,_ }, { B4,_,C4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,B3,_,_,_,B3,_ },

    /*76*/  { B4,_,G3s,D4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,B3,_ }, { F5s,_,F4s,_,_,_,B3,_ },
        { B4,_,D4s,G4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,B3,F4s,_,_,_,_ }, { C5s,_,_,_,_,_,B3,_ }, { F5s,_,_,_,_,_,B3,_ },


    /*77*/  { B4,_,D2s,D3s,_,_,C2,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,D4s,_,_,_,_,_ }, { C5s,_,D4s,_,_,_,_,_ }, { F5s,_,D4s,_,_,_,_,_ },
        { B4,_,D4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,C4s,_,_,_,_,_ }, { B4,_,C4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,B3,_,_,_,B3,_ },

    /*78*/  { B4,_,E3,B3,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,B3,_ },
        { B4,_,B3,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,B3,_ }, { B4,_,_,_,_,_,D2,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,B3,_,_,_,F2s,_ },

    /*79*/  { B4,_,F2s,C3s,F3s,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,C4s,_,_,_,_,_ }, { C5s,_,C4s,_,_,_,_,_ }, { F5s,_,C4s,_,_,_,_,_ },
        { B4,_,C4s,_,_,_,_,_ }, { C5s,_,C4s,_,_,_,_,_ }, { F5s,_,D4s,_,_,_,_,_ }, { B4,_,C4s,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,B3,_,_,_,_,_ },

    /*80*/  { B4,_,B2,F3s,B3,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,B3,_,_,_,_,_ }, { C5s,_,C4s,_,_,_,_,_ }, { F5s,_,B3,_,_,_,_,_ },
        { B5,_,B3,_,_,_,_,_ }, { C6s,_,C4s,_,_,_,_,_ }, { B5,_,B3,_,_,_,_,_ }, { F5s,F6s,F4s,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ },
    
    //Brioso 变前三旋律中三和弦
    /*81*/  { B4,D5s,F5s,F2s,D3s,F3s,A3,_ }, { F5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,D5s,F5s,F3s,D4s,_,C2,_ }, { _,_,_,F3s,D4s,_,_,_ }, { F5s,_,_,F3s,D4s,_,_,_ },
        { B4,D5s,F5s,G2s,E3,G3s,C2,_ }, { _,_,_,_,_,_,_,_ }, { E5,_,_,F3s,_,_,_,_ }, { D4s,_,_,B3,D4s,F4s,D2,_ }, { _,_,_,D4s,_,_,_,_ }, { C5s,_,_,B3,_,_,_,_ },

    /*82*/  { F4s,B4,_,E2,E3,_,C2,_ }, { _,_,_,_,_,_,_,_ }, { F4s,B4,_,B2,_,_,_,_ }, { F4s,B4,_,E3,G3s,B3,C2,_ }, { _,_,_,_,_,_,_,_ }, { C5s,_,_,B2,_,_,_,_ },
        { D5s,B5,_,F2s,F3s,_,D2,_ }, { A5s,_,_,_,_,_,D2,_ }, { C5s,F5s,_,C3s,_,_,D2,_ }, { C5s,_,_,F3s,A3s,C4s,F2s,_ }, { A4s,_,_,A3s,_,_,_,_ }, { F4s,_,_,F3s,_,_,_,_ },

    /*83*/  { B4,F5s,_,F2s,F3s,_,C2,_ }, { F5s,_,_,C3s,_,_,_,_ }, { F5s,_,_,F3s,_,_,_,_ }, { F5s,_,_,A3s,_,_,C2,_ }, { C4s,_,_,_,_,_,_,_ }, { F5s,_,_,F4s,_,_,_,_ },
        { B4,F5s,_,G2s,G3s,_,C2,_ }, { _,_,_,D3s,_,_,_,_ }, { E5,_,_,G3s,_,_,_,_ }, { D5s,_,_,B3,_,_,D2,_ }, { _,_,_,F4s,_,_,_,_ }, { C5s,_,_,D4s,_,_,_,_ },


    /*84*/  { F4s,B4,D5s,E2,E3,_,C2,_ }, { _,_,_,B2,_,_,_,_ }, { _,_,_,E3,_,_,_,_ }, { _,_,_,G3s,_,_,C2,_ }, { C5s,_,_,B3,_,_,_,_ }, { B4,_,_,E3,_,_,_,_ },
        { G4s,D5s,_,D2s,D3s,_,D2,_ }, { A4s,_,_,A2s,_,_,D2,_ }, { C5s,_,_,D3s,_,_,D2,_ }, { D5s,_,_,A3s,_,_,D2,_ }, { _,_,_,D4s,_,_,F2s,_ }, { _,_,_,A3s,_,_,A3,_ },

    /*85*/  { G4s,B4,_,G1s,G2s,_,C3s,_ }, { _,_,_,_,_,_,_,_ }, { C5s,_,_,D3s,G3s,_,_,_ }, { D5s,_,_,B3,D4s,_,C2,_ }, { _,_,_,G4s,_,_,_,_ }, { G4s,E5,_,E4,_,_,_,_ },
        { _,_,_,E2,E3,_,C2,_ }, { _,_,_,_,_,_,_,_ }, { D4s,_,_,_,_,_,_,_ }, { C5s,_,_,E3,B3,E4,D2,_ }, { _,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ },

    /*86*/  { F4s,B4,D5s,B1,B2,_,C2,_ }, { E5,_,_,_,_,_,_,_ }, { D5s,_,_,F3s,B3,_,_,_ }, { B4,_,_,D4s,_,_,C2,_ }, { _,_,_,F4s,_,_,_,_ }, { C5s,_,_,D4s,_,_,_,_ },
        { B4,_,_,F2s,F3s,_,D2,_ }, { C5s,_,_,_,_,_,D2,_ }, { F4s,_,_,F3s,_,_,A3,_ }, { F5s,_,_,A3s,C4s,F4s,D2,_ }, { _,_,_,_,_,_,F2s,_ }, { _,_,_,_,_,_,A3,_ },

    /*87*/  { B4,_,_,G1s,G2s,_,C2,_ }, { _,_,_,_,_,_,_,_ }, { C5s,_,_,F3s,_,_,_,_ }, { D5s,_,_,D4s,F4s,C2,_,_ }, { _,_,_,_,_,_,_,_ }, { G4s,E5,_,D4s,_,_,_,_ },
        { _,_,_,E2,E3,C2,_,_ }, { _,_,_,_,_,_,_,_ }, { D5s,_,_,E3,_,_,_,_ }, { G4s,E5,_,G3s,B3,E4,D2,_ }, { _,_,_,_,_,_,D2,_ }, { E3,_,_,F4s,_,_,D2,_ },


    /*88*/  { B4,D5s,F5s,B1,B2,_,C2,_ }, { _,_,_,_,_,_,_,_ }, { E5,_,_,F3s,B3,_,_,_ }, { D5s,B5,_,D4s,_,_,C2,_ }, { _,_,_,F4s,_,_,_,_ }, { C5s,_,_,C4s,_,_,_,_ },
        { A4s,C5s,A5s,F2s,F3s,_,D2,_ }, { _,_,_,_,_,_,D2,_ }, { D5s,_,_,F3s,_,_,D2,_ }, { C5s,C6s,_,A3s,C4s,F4s,F2s,_ }, { _,_,_,_,_,_,_,_ }, { B4,_,_,A3s,_,_,_,_ },

    /*89*/  { B4,E5,B5,A1,A2,_,A3,_ }, { B4,C5s,_,_,_,_,_,_ }, { A4,_,_,_,_,_,_,_ }, { B4,C5s,_,_,_,_,B3,_ }, { A4,_,_,_,_,_,_,_ }, { B4,C5s,_,_,_,_,_,_ },
        { A4,_,_,_,_,_,D2,_ }, { B4,C5s,_,_,_,_,_,_ }, { A4,_,_,_,_,_,D2,_ }, { B4,C5s,_,E2,_,_,B3,_ }, { A4,_,_,A2,_,_,D2,_ }, { B4,C5s,_,B2,_,_,C2,_ },

    /*90*/  { E4,A4,_,A2,_,_,C2,_ }, { B4,C5s,_,B2,_,_,_,_ }, { A4,A5,_,E3,_,_,D2,_ }, { B4,C5s,A5,A3,_,_,B3,_ }, { A4,_,_,_,_,_,D2,_ }, { B4,C5s,_,_,_,_,C2,_ },
        { A4,_,_,_,_,_,D2,_ }, { B4,C5s,_,_,_,_,_,_ }, { A4,_,_,_,_,_,_,_ }, { F4s,B4,C5s,F3s,C4s,_,B3,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ },

    /*91*/  { B4,_,_,F1s,F2s,_,C2,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,F2s,_,_,_,_ }, { B4,_,_,F3s,_,_,B3,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,F2s,D2,_,_,_ },
        { B4,_,_,F3s,_,_,D2,_ }, { C5s,_,_,F2s,_,_,_,_ }, { F5s,_,_,F3s,_,_,A2,_ }, { B4,_,_,B2,_,_,A2,_ }, { C5s,_,_,F3s,_,_,G2,_ }, { F5s,_,_,B3,_,_,G2,_ },


    /*92*/  { A4s,_,_,F3s,C4s,_,A3,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { A4s,_,_,C4s,F4s,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { A5s,C6s,F6s,F4s,F5s,_,A3,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { A3s,A4s,_,F3s,_,_,_,_ }, { _,_,_,C3s,_,_,_,_ }, { _,_,_,F2s,_,_,_,_ },
     
    /*93*/  { B3,F4s,B4,B0,B1,_,A3,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,B1,_,_,_,_ }, { _,_,_,F2s,_,_,_,_ }, { F4s,F5s,_,B2,_,_,_,_ },
        { F4s,B4,D5s,F5s,D3s,F3s,B3,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { B3,B4,_,D2s,D3s,_,B3,_ }, { _,_,_,_,_,_,_,_ }, { A3s,A4s,_,_,_,_,C2,_ },

    /*94*/  { B3,E4,B4,E1,E2,_,C2,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,E2,_,_,B3,_ }, { _,_,_,B2,_,_,_,_ }, { G4s,G5s,_,E3,_,_,_,_ },
        { F4s,F5s,_,G3s,B3,_,D2,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,B2,B3,_,B3,_ }, { B3,B4,_,_,_,_,_,_ }, { B3,B4,_,_,_,_,_,_ },

    /*95*/  { C4s,F4s,C5s,F1s,F2s,_,C2,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,C3s,F3s,A3s,B3,_ }, { C4s,C5s,_,_,_,_,_,_ }, { D4s,D5s,_,_,_,_,_,_ },
        { E4,G4,C5s,E5,G1,G2,B3,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,G3,_,_,B3,_ }, { D4s,D5s,_,E3,_,_,_,_ }, { C4s,C5s,_,C3s,_,_,D2,_ },


    /*96*/  { B3,D4s,G4s,B4,G1s,G2s,C2,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,D3s,G3s,_,B3,_ }, { _,_,_,_,_,_,_,_ }, { C4s,C5s,_,_,_,_,_,_ },
        { B3,D4s,F4s,B4,F1s,F2s,D2,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { D5s,_,_,F3s,_,_,B3,_ }, { C5s,_,_,C3s,_,_,_,_ }, { B4,_,_,F2s,_,_,_,_ },

    /*97*/  { B4,E5,G5s,B5,E1,E2,A3,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,E2,_,_,_,_ }, { B4,B5,_,B2,_,_,_,_ }, { _,_,_,E3,_,_,_,_ },
        { B4,E5,G5s,B5,G3s,B3,B3,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { F4s,B4,F5s,E2,E3,_,B3,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,D2,_ },

    /*98*/  { B4,D5s,F5s,B5,D1s,D2s,C2,_ }, { _,_,_,_,_,_,_,_ }, { B4,B5,_,_,_,_,_,_ }, { _,_,_,D2s,_,_,B3,_ }, { _,_,_,B2,_,_,_,_ }, { D3s,_,_,C5s,C6s,_,_,_ },
        { B4,D5s,F5s,B5,F3s,B3,D2,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { D2s,D3s,_,_,_,_,B3,_ }, { _,_,_,_,_,_,_,_ }, { F4s,F5s,_,_,_,_,_,_ },

    /*99*/  { C5s,E5,G5s,C6s,C1s,C2s,C2,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,C3s,_,_,_,_ }, { _,_,_,G3s,C4s,B3,_,_ }, { C5s,C6s,_,_,_,_,_,_ }, { D5s,D6s,_,_,_,_,_,_ },
        { E5,G5s,B5,E6,C2s,C3s,B3,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,G3s,B3,E4,B3,_ }, { D5s,D6s,_,_,_,_,_,_ }, { C5s,C6s,_,_,_,_,C2,_ },


    /*100*/ { B4,C5s,F5s,B5,F1s,F2s,C2,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,B2,_,_,_,_ }, { _,_,_,F3s,B3,_,B3,_ }, { A4s,A5s,_,_,_,_,_,_ }, { B4,B5,_,_,_,_,A2,_ },
        { C5s,F5s,C6s,F2s,F3s,G2,_ }, { _,_,_,_,_,_,F2,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,F3s,C4s,F4s,F2,_ }, { _,_,_,C4s,_,_,_,_ }, { A4s,_,_,F3s,_,_,_,_ },
        
    /*101*/ { B3,D4s,F4s,B4,B0,B1,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,B1,_,_,_,_ }, { _,_,_,F2,_,_,_,_ }, { F4s,F5s,_,B2,_,_,_,_ },
        { F4s,F5s,_,D3s,F3s,B3,_,_ }, { _,_,_,_,_,_,_,_ }, { B4,_,_,B2,_,_,_,_ }, { B3,D4s,B4,D2s,D3s,_,_,_ }, { _,_,_,_,_,_,_,_ }, { A3s,A4s,_,_,_,_,_,_ },

    /*102*/ { B3,E4,B4,E1,E2,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,E2,_,_,_,_ }, { _,_,_,B2,_,_,_,_ }, { G4s,G5s,_,E3,_,_,_,_ },
        { F4s,F5s,_,G3s,B3,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,E2,E3,_,_,_ }, { _,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ },

    /*103*/ { C4s,F4s,C5s,F2s,F3s,_,_,_ }, { B4,_,_,C3s,_,_,_,_ }, { C5s,_,_,F3s,_,_,_,_ }, { _,_,_,A3s,_,_,_,_ }, { C5s,_,_,C4s,_,_,_,_ }, { D5s,_,_,D4s,_,_,_,_ },
        { E4,G4,C5s,E5,G2,G3,_,_ }, { _,_,_,E3,_,_,_,_ }, { _,_,_,G3,_,_,_,_ }, { _,_,_,C4s,_,_,_,_ }, { D5s,_,_,A3s,_,_,_,_ }, { C5s,_,_,E3,_,_,_,_ },


    /*104*/ { D4s,G4s,B4,G2s,G3s,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,G2s,_,_,_,_ }, { _,_,_,D3s,_,_,_,_ }, { B4,_,_,G3s,_,_,_,_ },
        { F4s,B4,_,F3s,_,_,_,_ }, { _,_,_,B3,_,_,_,_ }, { _,_,_,D4s,_,_,_,_ }, { _,_,_,F4s,_,_,_,_ }, { _,_,_,G4s,_,_,_,_ }, { _,_,_,F4s,_,_,_,_ },

    /*105*/ { B4,E5,G5s,B5,C1s,C2s,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,C2s,_,_,_,_ }, { _,_,_,G2s,_,_,_,_ }, { B4,B5,_,C3s,_,_,_,_ },
        { B4,E5,G5s,B5,G3s,B3,_,_ }, { _,_,_,_,_,_,_,_ }, { F4s,F5s,_,_,_,_,_,_ }, { F4s,F5s,_,C2s,C3s,_,_,_ }, { _,_,_,_,_,_,_,_ }, { B4,B5,_,_,_,_,_,_ },

    /*106*/ { B4,D5s,F5s,B5,D1s,D2s,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,D2s,_,_,_,_ }, { B4,B5,_,B2,_,_,_,_ }, { C5s,C6s,_,C3s,_,_,_,_ },
        { B4,D5s,F5s,B5,F3s,B3,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { F5s,B5,F6s,D2s,D3s,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ },

    /*107*/ { B4,E5,G5s,B5,E1,E2,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,E2,_,_,_,_ }, { _,_,_,B2,_,_,_,_ }, { G4s,G5s,_,E3,_,_,_,_ },
        { B4,E5,B5,G3s,B3,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { F5s,B5,E6,F6s,E3,_,_,_ }, { _,_,_,B2,_,_,_,_ }, { _,_,_,E2,_,_,_,_ },


    /*108*/ { B4,E5,G5s,B5,E1,E2,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,E2,_,_,_,_ }, { _,_,_,B2,_,_,_,_ }, { G4s,G5s,_,E3,_,_,_,_ },
        { B4,E5,B5,G3s,B3,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,E2,E3,_,_,_ }, { _,_,_,_,_,_,_,_ }, { F4s,F5s,_,_,_,_,_,_ },

    /*109*/ { D5s,F5s,B5,D6s,F1s,F2s,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,B2,_,_,_,_ }, { _,_,_,C3s,_,_,_,_ }, { _,_,_,F3s,_,_,_,_ },
        { _,_,_,B3,_,_,_,_ }, { _,_,_,C4s,_,_,_,_ }, { _,_,_,F4s,_,_,_,_ }, { B4,_,_,B3,_,_,_,_ }, { C5s,C6s,_,C4s,_,_,_,_ }, { B4,B5,_,F4s,_,_,_,_ },

    /*110*/ { C5s,F5s,A5s,C6s,F1s,F2s,_,_ }, { _,_,_,F2s,_,_,_,_ }, { _,_,_,C3s,_,_,_,_ }, { _,_,_,A3s,_,_,_,_ }, { _,_,_,F3s,_,_,_,_ }, { _,_,_,C3s,_,_,_,_ },
        { _,_,_,A3s,_,_,_,_ }, { _,_,_,F3s,_,_,_,_ }, { _,_,_,C3s,_,_,_,_ }, { _,_,_,A3s,_,_,_,_ }, { _,_,_,F3s,_,_,_,_ }, { B4,B5,_,C3s,_,_,_,_ },

    /*111*/ { B4,B5,_,B2,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },


    /*112*/ { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,B1,B2,_,_,_ }, { C5s,_,_,B1,B2,_,_,_ }, { F5s,_,_,B1,B2,_,_,_ },
    

    /*113*/ { B4,_,_,B2,D3s,B3,_,_ }, { C5s,_,_,C4s,_,_,_,_ }, { F5s,_,_,B3,_,_,_,_ }, { B4,B5,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,C6s,_,D4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,B5,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,F5s,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },

    /*114*/ { B4,E5,_,E1,E2,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,E2,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,E2,_,_,_,_ },
        { B4,E4,F4s,E3,_,_,_,_ }, { C5s,G4s,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,C5s,_,_,_,_,_,_ },

    /*115*/ { B4,F5s,_,F2s,F3s,_,_,_ }, { C5s,G5s,_,_,_,_,_,_ }, { F5s,B5,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { G5s,_,_,_,_,_,_,_ },
        { B4,_,_,F4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { G5s,_,_,_,_,_,_,_ }, { B4,F5s,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },


    /*116*/ { B4,_,_,F4s,_,_,_,_ }, { C5s,F5s,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,B5,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,C6s,_,_,_,_,_,_ },
        { B4,_,_,F4s,_,_,_,_ }, { C5s,B5,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,F5s,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },

    /*117*/ { B4,_,_,B2,D3s,B3,_,_ }, { C5s,_,_,C4s,_,_,_,_ }, { F5s,_,_,B3,_,_,_,_ }, { B4,B5,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,C6s,_,D4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,B5,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,F5s,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },

    /*118*/ { B4,E5,_,E1,E2,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,E2,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,E2,_,_,_,_ },
        { B4,E4,F4s,E3,_,_,_,_ }, { C5s,G4s,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,B4,_,_,_,_,_,_ },

    /*119*/ { B4,_,_,F2s,F3s,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { B5,_,_,_,_,_,_,_ },
        { F5s,_,F3s,B3,C4s,F4s,_,_ }, { D5s,_,F3s,B3,C4s,F4s,_,_ }, { B4,_,F3s,B3,C4s,F4s,_,_ }, { B4,_,F3s,B3,C4s,F4s,_,_ }, { C5s,_,F3s,B3,C4s,F4s,_,_ }, { F5s,_,F3s,B3,C4s,F4s,_,_ },


    /*120*/ { B4,_,F3s,B3,C4s,F4s,_,_ }, { C5s,_,F3s,B3,C4s,F4s,_,_ }, { F5s,_,F3s,B3,C4s,F4s,_,_ }, { B4,_,F3s,B3,C4s,F4s,_,_ }, { C5s,_,F3s,B3,C4s,F4s,_,_ }, { F5s,_,F3s,B3,C4s,F4s,_,_ },
        { B4,_,F3s,B3,C4s,F4s,_,_ }, { C5s,_,F3s,B3,C4s,F4s,_,_ }, { G5s,_,F3s,B3,C4s,F4s,_,_ }, { B4,_,F3s,B3,C4s,F4s,_,_ }, { C5s,_,F3s,B3,C4s,F4s,_,_ }, { B5,_,F3s,B3,C4s,F4s,_,_ },

    /*121*/ { B4,_,_,B2,D3s,B3,_,_ }, { C5s,_,_,C4s,_,_,_,_ }, { F5s,_,_,B3,_,_,_,_ }, { B4,B5,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,C6s,_,D4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,B5,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,F5s,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },

    /*122*/ { B4,E5,_,E1,E2,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,E2,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,E2,_,_,_,_ },
        { B4,E4,F4s,E3,_,_,_,_ }, { C5s,G4s,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,B4,_,_,_,_,_,_ },

    /*123*/ { B4,B5,_,F2s,F3s,_,_,_ }, { C5s,B5,_,_,_,_,_,_ }, { F5s,C6s,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,F5s,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,E5,_,F4s,_,_,_,_ }, { C5s,F5s,_,_,_,_,_,_ }, { G5s,_,_,_,_,_,_,_ }, { B4,F5s,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { G5s,_,_,_,_,_,_,_ },


    /*124*/ { B4,B5,_,F4s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B5,C6s,F6s,F4s,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ },
    
    /*125*/ { B4,C5s,_,B0,B1,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,B1,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,B1,_,_,_,_ },
        { B4,C5s,_,B2,_,_,_,_ }, { C5s,D5s,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,B0,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,B0,_,_,_,_ },

    /*126*/ { B4,F5s,_,E1,E2,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,B2,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,B2,_,_,_,_ },
        { B4,C5s,_,E3,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,B2,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,B2,_,_,_,_ },

    /*127*/ { B4,C5s,_,F1s,F2s,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,F2s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,F2s,_,_,_,_ },
        { B4,C5s,_,F3s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,F2s,_,_,_,_ }, { C5s,_,_,F3s,_,_,_,_ }, { F5s,_,_,F2s,_,_,_,_ },


    /*128*/ { B4,D5s,_,G1s,G2s,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,G2s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,G2s,_,_,_,_ },
        { B4,G5s,_,G3s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,F5s,_,F3s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },

    /*129*/ { B4,C5s,_,F2s,B2,D3s,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,F3s,D4s,_,_,_ }, { B4,_,_,F3s,D4s,_,_,_ }, { C5s,_,_,F3s,D4s,_,_,_ }, { F5s,_,_,F3s,D4s,_,_,_ },
        { B4,C5s,_,F3s,D4s,_,_,_ }, { C5s,_,D5s,F3s,D4s,_,_,_ }, { F5s,_,_,F3s,D4s,_,_,_ }, { B4,_,_,F3s,D4s,_,_,_ }, { C5s,_,_,F3s,D4s,_,_,_ }, { F5s,_,_,F3s,D4s,_,_,_ },

    /*130*/ { B4,F5s,_,E2,E3,_,_,_ }, { C5s,_,_,F3s,C4s,_,_,_ }, { F5s,_,_,F3s,C4s,_,_,_ }, { B4,_,_,F3s,C4s,_,_,_ }, { C5s,_,_,F3s,C4s,_,_,_ }, { F5s,_,_,F3s,C4s,_,_,_ },
        { B4,C5s,_,F3s,C4s,_,_,_ }, { C5s,_,_,F3s,C4s,_,_,_ }, { F5s,_,_,F3s,C4s,_,_,_ }, { B4,_,_,F3s,C4s,_,_,_ }, { C5s,_,_,F3s,C4s,_,_,_ }, { F5s,_,_,F3s,C4s,_,_,_ },

    /*131*/ { B4,C5s,_,F3s,F2s,_,_,_ }, { C5s,_,_,F3s,A3s,C4s,_,_ }, { F5s,_,_,F3s,A3s,C4s,_,_ }, { B4,_,_,F3s,A3s,C4s,_,_ }, { C5s,_,_,F3s,A3s,C4s,_,_ }, { F5s,_,_,F3s,A3s,C4s,_,_ },
        { B4,C5s,_,F3s,A3s,C4s,_,_ }, { C5s,_,_,F3s,A3s,C4s,_,_ }, { F5s,D5s,_,F3s,A3s,C4s,_,_ }, { B4,_,_,F3s,A3s,C4s,_,_ }, { C5s,_,_,F3s,A3s,C4s,_,_ }, { F5s,_,_,F3s,A3s,C4s,_,_ },


    /*132*/ { B4,F5s,_,F3s,A3s,C4s,_,_ }, { C5s,_,_,F3s,A3s,C4s,_,_ }, { F5s,_,_,F3s,A3s,C4s,_,_ }, { B4,_,_,F3s,A3s,C4s,_,_ }, { C5s,_,_,F3s,A3s,C4s,_,_ }, { F5s,_,_,F3s,A3s,C4s,_,_ },
        { F5s,_,_,F3s,A3s,C4s,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { F4s,_,_,F3s,_,_,_,_ }, { B4,_,_,B3,_,_,_,_ }, { C5s,_,_,C4s,_,_,_,_ },
   
    /*133*/ { D4s,_,_,D2s,B2,D3s,_,_ }, { F4s,_,_,D3s,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,D3s,F3s,B3,_,_ }, { D4s,_,_,D3s,F3s,B3,_,_ }, { B4,_,_,_,_,_,_,_ },
        { B4,C5s,_,D3s,F3s,B3,_,_ }, { F5s,_,_,D3s,F3s,B3,_,_ }, { B4,_,_,_,_,_,_,_ }, { D4s,_,_,D3s,F3s,B3,_,_ }, { B4,_,_,_,_,_,_,_ }, { D4s,_,_,D3s,F3s,B3,_,_ },

    /*134*/ { E4,_,_,E2,B2,E3,_,_ }, { B4,_,_,E3,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { B4,D5s,_,E3,F3s,B3,_,_ }, { E4,_,_,E3,F3s,B3,_,_ }, { B4,_,_,_,_,_,_,_ },
        { B4,C5s,_,E3,F3s,B3,_,_ }, { F5s,_,_,E3,F3s,B3,_,_ }, { B4,_,_,_,_,_,_,_ }, { E4,_,_,E3,F3s,B3,_,_ }, { B4,_,_,_,_,_,_,_ }, { E4,_,_,E3,F3s,B3,_,_ },

    /*135*/ { F4s,_,_,F2s,C3s,F3s,_,_ }, { B4,_,_,F3s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { D5s,_,_,F3s,B3,C4s,_,_ }, { F4s,_,_,F3s,B3,C4s,_,_ }, { B4,_,_,_,_,_,_,_ },
        { B4,C5s,_,F3s,B3,C4s,_,_ }, { F5s,_,_,F3s,B3,C4s,_,_ }, { B4,_,_,_,_,_,_,_ }, { F4s,_,_,F3s,B3,C4s,_,_ }, { B4,_,_,_,_,_,_,_ }, { F4s,_,_,F3s,B3,C4s,_,_ },


    /*136*/ { F4s,_,_,F2s,C3s,F3s,_,_ }, { B4,_,_,F3s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { D5s,B5,_,F3s,C4s,_,_,_ }, { _,_,_,F3s,C4s,_,_,_ }, { B4,_,_,_,_,_,_,_ },
        { C5s,C6s,_,F3s,C4s,_,_,_ }, { _,_,_,F3s,C4s,_,_,_ }, { B4,B5,_,_,_,_,_,_ }, { _,_,_,F3s,C4s,_,_,_ }, { B4,F5s,_,_,_,_,_,_ }, { _,_,_,F3s,C4s,_,_,_ },

    /*137*/ { D4s,_,_,D2s,B2,D3s,_,_ }, { F4s,_,_,D3s,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,D3s,F3s,B3,_,_ }, { D4s,_,_,D3s,F3s,B3,_,_ }, { B4,_,_,_,_,_,_,_ },
        { B4,C5s,_,D3s,F3s,B3,_,_ }, { F5s,_,_,D3s,F3s,B3,_,_ }, { B4,_,_,_,_,_,_,_ }, { D4s,_,_,D3s,F3s,B3,_,_ }, { B4,_,_,_,_,_,_,_ }, { D4s,_,_,D3s,F3s,B3,_,_ },

    /*138*/ { E4,_,_,E2,B2,E3,_,_ }, { B4,_,_,E3,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { B4,D5s,_,E3,F3s,B3,_,_ }, { E4,_,_,E3,F3s,B3,_,_ }, { B4,_,_,_,_,_,_,_ },
        { B4,C5s,_,E3,F3s,B3,_,_ }, { F5s,_,_,E3,F3s,B3,_,_ }, { B4,_,_,_,_,_,_,_ }, { E4,_,_,E3,F3s,B3,_,_ }, { B4,_,_,_,_,_,_,_ }, { E4,_,_,E3,F3s,B3,_,_ },

    /*139*/ { F4s,_,_,F2s,C3s,F3s,_,_ }, { B4,_,_,F3s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { D5s,_,_,F3s,B3,C4s,_,_ }, { F4s,_,_,F3s,B3,C4s,_,_ }, { B4,_,_,_,_,_,_,_ },
        { B4,C5s,_,F3s,B3,C4s,_,_ }, { F5s,_,_,F3s,B3,C4s,_,_ }, { B4,_,_,_,_,_,_,_ }, { F4s,_,_,F3s,B3,C4s,_,_ }, { B4,_,_,_,_,_,_,_ }, { F4s,_,_,F3s,B3,C4s,_,_ },


    /*140*/ { F4s,_,_,F2s,C3s,F3s,_,_ }, { B4,_,_,F3s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { D5s,_,_,F3s,C4s,_,_,_ }, { _,_,_,F3s,C4s,_,_,_ }, { B4,_,_,_,_,_,_,_ },
        { C5s,F5s,_,F3s,C4s,_,_,_ }, { _,_,_,A3s,_,_,_,_ }, { F5s,C6s,_,F3s,_,_,_,_ }, { _,_,_,C3s,_,_,_,_ }, { F5s,B5,_,A2s,F2s,_,_,_ }, { F5s,_,_,_,_,_,_,_ },

    /*141*/ { D4s,_,_,D2s,_,_,_,_ }, { F4s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,B2,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ },
        { B4,C5s,_,F3s,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { D4s,_,_,_,_,_,_,_ }, { B4,_,_,D3s,_,_,_,_ }, { D4s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ },

    /*142*/ { E4,_,_,E2,E3,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { B4,D5s,_,B2,_,_,_,_ }, { _,_,_,E3,_,_,_,_ }, { B4,_,_,B3,_,_,_,_ },
        { B4,C5s,_,E3,_,_,_,_ }, { F5s,_,_,C4s,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { D4s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { E4,_,_,_,_,_,_,_ },

    /*143*/ { F4s,_,_,F2s,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { D5s,_,_,C3s,_,_,_,_ }, { F4s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ },
        { B4,C5s,_,F3s,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { F4s,_,_,A3s,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { F4s,_,_,_,_,_,_,_ },


    /*144*/ { G4s,_,_,G2s,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { D5s,B5,_,D3s,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ },
        { C5s,A5s,_,G2s,G3s,_,_,_ }, { _,_,_,G2s,G3s,_,_,_ }, { B4,G5s,_,_,_,_,_,_ }, { _,_,_,G2s,G3s,_,_,_ }, { B4,D5s,_,_,_,_,_,_ }, { _,_,_,D3s,_,_,_,_ },

    /*145*/ { D4s,_,_,D2s,D3s,_,_,_ }, { F4s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,B2,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ },
        { B4,C5s,_,D3s,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { D4s,_,_,_,_,_,_,_ }, { B4,_,_,F3s,_,_,_,_ }, { D4s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ },

    /*146*/ { E4,_,_,E2,E3,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { B4,D5s,_,G2s,_,_,_,_ }, { _,_,_,E3,_,_,_,_ }, { B4,_,_,_,_,_,_,_ },
        { B4,C5s,_,D3s,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,E3,_,_,_,_ }, { E4,_,_,G3s,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { E4,_,_,_,_,_,_,_ },

    /*147*/ { F4s,_,_,F2s,F3s,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { D5s,_,_,C3s,_,_,_,_ }, { _,_,_,F3s,_,_,_,_ }, { B4,_,_,C4s,_,_,_,_ },
        { B4,C5s,_,F4s,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,C4s,_,_,_,_ }, { F4s,_,_,F3s,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { F4s,_,_,_,_,_,_,_ },


    /*148*/ { F4s,_,_,B2,B3,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { D5s,_,_,F2s,_,_,_,_ }, { F4s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ },
        { B4,C5s,_,B2,D3s,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { F4s,_,_,F2s,_,_,_,_ }, { B4,_,_,B1,B2,_,_,_ }, { F4s,_,_,F1s,F2s,_,_,_ }, { B3,_,_,B0,B1,_,_,_ },

    /*149*/ { D4s,C5s,_,D1s,D2s,_,_,_ }, { F4s,_,_,D2s,_,_,_,_ }, { B3,_,_,_,_,_,_,_ }, { C4s,B4,_,D3s,_,_,_,_ }, { _,_,_,D3s,_,_,_,_ }, { B3,_,_,_,_,_,_,_ },
        { F4s,C5s,_,D3s,_,_,_,_ }, { D5s,_,_,D3s,_,_,_,_ }, { B3,_,_,_,_,_,_,_ }, { B4,_,_,D3s,_,_,_,_ }, { B3,_,_,_,_,_,_,_ }, { D3s,_,_,_,_,_,_,_ },

    /*150*/ { E4,F5s,_,E1,_,_,_,_ }, { B4,_,_,E2,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { D5s,_,_,E3,_,_,_,_ }, { _,_,_,E3,_,_,_,_ }, { B3,_,_,_,_,_,_,_ },
        { F4s,C5s,_,E3,_,_,_,_ }, { _,_,_,E3,_,_,_,_ }, { B3,_,_,_,_,_,_,_ }, { B4,_,_,E3,_,_,_,_ }, { B3,_,_,_,_,_,_,_ }, { E3,_,_,_,_,_,_,_ },

    /*151*/ { F4s,C5s,_,F1s,_,_,_,_ }, { B3,_,_,F2s,_,_,_,_ }, { C4s,_,_,_,_,_,_,_ }, { D4s,B4,_,F3s,_,_,_,_ }, { _,_,_,F3s,_,_,_,_ }, { B3,_,_,_,_,_,_,_ },
        { F4s,C5s,_,F3s,_,_,_,_ }, { _,_,_,F3s,_,_,_,_ }, { B4,D5s,_,_,_,_,_,_ }, { B4,_,_,F3s,_,_,_,_ }, { B3,_,_,_,_,_,_,_ }, { _,_,_,F3s,_,_,_,_ },


    /*152*/ { G4s,D5s,_,G1s,_,_,_,_ }, { B4,_,_,G2s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { D5s,_,_,F3s,_,_,_,_ }, { _,_,_,F3s,_,_,_,_ }, { B4,_,_,_,_,_,_,_ },
        { C5s,G5s,_,F3s,_,_,_,_ }, { _,_,_,F3s,_,_,_,_ }, { F4s,_,_,_,_,_,_,_ }, { A5s,_,_,F3s,_,_,_,_ }, { F4s,_,_,_,_,_,_,_ }, { _,_,_,F3s,_,_,_,_ },

    /*153*/ { D5s,B5,_,D1s,D2s,_,_,_ }, { F5s,_,_,D2s,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,F5s,_,D3s,_,_,_,_ }, { D5s,_,_,D3s,_,_,_,_ }, { B4,_,_,_,_,_,_,_ },
        { F5s,C6s,_,D3s,_,_,_,_ }, { D5s,D6s,_,D3s,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { D5s,B5,_,D3s,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { F4s,_,_,D3s,_,_,_,_ },

    /*154*/ { E5,D6s,_,E2,_,_,_,_ }, { B5,_,_,E3,_,_,_,_ }, { G5s,_,_,_,_,_,_,_ }, { E5,_,_,E3,_,_,_,_ }, { D5s,_,_,E3,_,_,_,_ }, { B4,_,_,_,_,_,_,_ },
        { E5,C6s,_,E3,_,_,_,_ }, { D5s,_,_,E3,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { D5s,B5,_,E3,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { B4,_,_,E3,_,_,_,_ },

    /*155*/ { F5s,C6s,_,F2s,_,_,_,_ }, { B4,_,_,F3s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { D5s,B5,_,F3s,_,_,_,_ }, { C5s,_,_,F3s,_,_,_,_ }, { B4,_,_,_,_,_,_,_ },
        { F5s,C6s,_,F3s,_,_,_,_ }, { F5s,_,_,F3s,_,_,_,_ }, { B5,D6s,_,_,_,_,_,_ }, { F5s,F6s,_,F3s,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { C5s,_,_,F3s,_,_,_,_ },


    /*156*/ { F5s,F6s,_,F2s,_,_,_,_ }, { B5,_,_,F3s,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { D6s,_,_,F3s,_,_,_,_ }, { _,_,_,F3s,_,_,_,_ }, { B5,_,_,_,_,_,_,_ },
        { C5s,C6s,_,F3s,_,_,_,_ }, { _,_,_,F3s,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B5,F6s,_,F3s,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { F5s,_,_,F3s,_,_,_,_ },

    /*157*/ { D5s,D6s,_,F2s,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,F2s,_,_,_,_,_ }, { D5s,D6s,_,D3s,_,_,_,_ }, { _,_,_,F3s,_,_,_,_ }, { _,_,_,B3,_,_,_,_ },
        { E5,B5,E6,G2s,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,G3s,_,_,_,_ }, { F5s,F6s,_,B3,_,_,_,_ }, { _,_,_,G3s,_,_,_,_ }, { _,_,_,D3s,_,_,_,_ },

    /*158*/ { B5,B6,_,E2,E3,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,B2,_,_,_,_ }, { _,_,_,G3s,A3s,_,_,_ }, { _,_,_,_,_,_,_,_ }, { F6s,_,_,B2,_,_,_,_ },
        { F6s,B6,_,F2s,_,_,_,_ }, { A6s,_,_,_,_,_,_,_ }, { F6s,_,_,C3s,_,_,_,_ }, { C6s,A5s,_,C4s,_,_,_,_ }, { A5s,_,_,A3s,_,_,_,_ }, { F5s,_,_,F3s,_,_,_,_ },

    /*159*/ { F4s,C5s,_,F2s,F3s,_,_,_ }, { A4s,F5s,_,C3s,_,_,_,_ }, { F4s,C5s,_,F3s,_,_,_,_ }, { A4s,F5s,_,A3s,_,_,_,_ }, { F4s,C5s,_,F3s,_,_,_,_ }, { A4s,F5s,_,C3s,_,_,_,_ },
        { F4s,B4,_,G2s,G3s,_,_,_ }, { D5s,F5s,_,D3s,_,_,_,_ }, { F4s,B4,_,G3s,_,_,_,_ }, { D5s,F5s,_,B3,_,_,_,_ }, { F4s,B4,_,F3s,_,_,_,_ }, { D5s,F5s,_,D3s,_,_,_,_ },


    /*160*/ { E4,E5,_,E2,E3,_,_,_ }, { F4s,F5s,_,B2,_,_,_,_ }, { E4,E5,_,E3,_,_,_,_ }, { B4,B5,_,G3s,_,_,_,_ }, { G4s,G5s,_,B3,_,_,_,_ }, { B4,B5,_,E3,_,_,_,_ },
        { G4,G5,_,D2s,D3s,_,_,_ }, { A4s,A5s,_,A2s,_,_,_,_ }, { C5s,C6s,_,D3s,_,_,_,_ }, { D5s,D6s,_,A3s,_,_,_,_ }, { _,_,_,C4s,_,_,_,_ }, { A4s,_,_,D4s,_,_,_,_ },

    /*161*/ { D4s,G4s,B4,G1s,G2s,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,D3s,_,_,_,_ }, { F5s,_,_,B3,D2s,_,_,_ }, { _,_,_,G3s,_,_,_,_ }, { D5s,_,_,B3,_,_,_,_ },
        { B4,E5,_,E2,E3,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,E3,_,_,_,_ }, { E5,_,_,B3,E4,_,_,_ }, { _,_,_,_,_,_,_,_ }, { E5,_,_,E3,_,_,_,_ },

    /*162*/ { B4,D5s,_,B1,B2,_,_,_ }, { E5,_,_,F3s,_,_,_,_ }, { D5s,_,_,B3,_,_,_,_ }, { B4,_,_,B3,D4s,_,_,_ }, { _,_,_,F3s,_,_,_,_ }, { D5s,_,_,B3,D4s,_,_,_ },
        { F4s,B4,_,F2s,F3s,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { F4s,_,_,F3s,_,_,_,_ }, { B4,D5s,_,C3s,_,_,_,_ }, { D5s,F5s,_,B1,B2,_,_,_ }, { A4s,A5s,_,A1s,A2s,_,_,_ },

    /*163*/ { B4,G5s,B5,G1s,G2s,_,_,_ }, { _,_,_,_,_,_,_,_ }, { F3s,_,_,_,_,_,_,_ }, { F5s,F6s,_,D4s,F4s,_,_,_ }, { _,_,_,_,_,_,_,_ }, { D5s,D6s,_,B3,_,_,_,_ },
        { E5,B5,E6,E2,E3,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,E3,_,_,_,_ }, { G5s,G6s,_,G3s,B3,E4,_,_ }, { _,_,_,_,_,_,_,_ }, { E3,_,_,_,_,_,_,_ },


    /*164*/ { F5s,F6s,_,B1,B2,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,F3s,_,_,_,_ }, { B5,B6,_,B3,D4s,_,_,_ }, { _,_,_,F4s,_,_,_,_ }, { _,_,_,C4s,_,_,_,_ },
        { A5s,A6s,_,F2s,F3s,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,F3s,_,_,_,_ }, { C6s,F6s,C7s,A3s,C4s,F4s,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,A3s,_,_,_,_ },

    /*165*/ { B4,E5,A5,A1,A2,_,_,_ }, { B4,C5s,_,_,_,_,_,_ }, { A4,_,_,_,_,_,_,_ }, { B4,C5s,_,_,_,_,_,_ }, { A4,_,_,_,_,_,_,_ }, { B4,C5s,_,_,_,_,_,_ },
        { A4,_,_,E1,E2,_,_,_ }, { B4,C5s,_,_,_,_,_,_ }, { A4,_,_,_,_,_,_,_ }, { B4,C5s,_,E2,_,_,_,_ }, { A4,_,_,A2,_,_,_,_ }, { B4,C5s,_,B2,_,_,_,_ },

    /*166*/ { A4,_,_,A2,_,_,_,_ }, { B4,C5s,_,B2,_,_,_,_ }, { A4,A5,_,E3,_,_,_,_ }, { B4,C5s,A5,A3,_,_,_,_ }, { A4,_,_,_,_,_,_,_ }, { B4,C5s,_,_,_,_,_,_ },
        { A4,_,_,_,_,_,_,_ }, { B4,C5s,_,_,_,_,_,_ }, { A4,_,_,_,_,_,_,_ }, { F4s,B4,C5s,F3s,C4s,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ },

    /*167*/ { B4,_,_,F1s,F2s,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,F2s,_,_,_,_ }, { B4,_,_,B2,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,B2,_,_,_,_ },
        { B4,_,_,F2s,_,_,_,_ }, { C5s,_,_,C3s,_,_,_,_ }, { F5s,_,_,F3s,_,_,_,_ }, { B4,_,_,B2,_,_,_,_ }, { C5s,_,_,F3s,_,_,_,_ }, { F5s,_,_,B3,_,_,_,_ },


    /*168*/ { A4s,_,_,F3s,C4s,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { A4s,_,_,C4s,F4s,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { A5s,C6s,_,F1s,F2s,_,_,_ }, { F6s,_,_,F1s,F2s,_,_,_ }, { _,_,_,F1s,F2s,_,_,_ }, { _,_,_,F1s,F2s,_,_,_ }, { D5s,_,_,F1s,F2s,_,_,_ }, { E5,_,_,F1s,F2s,_,_,_ },

    /*169*/ { F4s,B4,D5s,F5s,B0,B1,_,_ }, { _,_,_,_,_,_,_,_ }, { B5,_,_,_,_,_,_,_ }, { F5s,_,_,B2,_,_,_,_ }, { B5,_,_,F2s,_,_,_,_ }, { D6s,_,_,B2,_,_,_,_ },
        { D6s,F6s,B6,D3s,F3s,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,D2s,D3s,_,_,_ }, { _,_,_,_,_,_,_,_ }, { G4s,G5s,_,_,_,_,_,_ },

    /*170*/ { F4s,B4,D5s,F5s,E1,E2,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,E3,_,_,_,_ }, { E5,_,_,B2,_,_,_,_ }, { D5s,_,_,E3,_,_,_,_ },
        { E4,G4s,C5s,G3s,B3,_,_,_ }, { _,_,_,E4,_,_,_,_ }, { B5,_,_,_,_,_,_,_ }, { G5s,E6,_,E2,E3,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,B1,B2,_,_,_ },

    /*171*/ { D4s,F4s,B4,D5s,F1s,F2s,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { D4s,F4s,B4,C3s,_,_,_,_ }, { _,_,_,F3s,_,_,_,_ }, { _,_,_,A3s,_,_,_,_ },
        { D4s,G4,A4s,C5s,G1,G2,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,G5,_,_,_,_ }, { C4s,E4,A4s,D3s,_,_,_,_ }, { _,_,_,G3,_,_,_,_ }, { _,_,_,B3,_,_,_,_ },

    /*172*/ { B3,D4s,G4s,B4,G1s,G2s,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { C5s,_,_,G2s,_,_,_,_ }, { _,_,_,D3s,_,_,_,_ }, { _,_,_,G3s,_,_,_,_ },
        { D4s,F4s,D5s,F1s,F2s,_,_,_ }, { _,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { _,_,_,D3s,_,_,_,_ }, { B4,_,_,C3s,_,_,_,_ }, { _,_,_,B2,_,_,_,_ },

    /*173*/ { B4,E5,G5s,B5,B1,E2,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { E5,_,_,E2,_,_,_,_ }, { G5s,_,_,B2,_,_,_,_ }, { B5,_,_,E3,_,_,_,_ },
        { G5s,B5,E6,G3s,B3,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { F4s,F5s,_,E2,E3,_,_,_ }, { _,_,_,_,_,_,_,_ }, { B4,B5,_,_,_,_,_,_ },

    /*174*/ { C5s,F5s,C6s,D1s,D2s,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { D5s,_,_,D2s,_,_,_,_ }, { F5s,_,_,B2,_,_,_,_ }, { B5,_,_,D3s,_,_,_,_ },
        { B5,D6s,F6s,F3s,B3,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { B4,B5,_,D2s,D3s,_,_,_ }, { _,_,_,_,_,_,_,_ }, { C5s,C6s,_,_,_,_,_,_ },

    /*175*/ { E5,G5s,D6s,C1s,C2s,_,_,_ }, { _,_,_,_,_,_,_,_ }, { E5,_,_,C3s,_,_,_,_ }, { G5s,_,_,G3s,C4s,_,_,_ }, { B5,D6s,_,_,_,_,_,_ }, { G5s,_,_,_,_,_,_,_ },
        { E5,G5s,C6s,C2s,C3s,_,_,_ }, { _,_,_,_,_,_,_,_ }, { G5s,_,_,_,_,_,_,_ }, { C6s,_,_,G3s,B3,E4,_,_ }, { G5s,E6,_,_,_,_,_,_ }, { G6s,_,_,C3s,_,_,_,_ },


    /*176*/ { F5s,A5s,C6s,F6s,F1s,F2s,_,_ }, { _,_,_,_,_,_,_,_ }, { F5s,_,_,B2,_,_,_,_ }, { C6s,_,_,F3s,B3,_,_,_ }, { F6s,_,_,_,_,_,_,_ }, { A6s,_,_,_,_,_,_,_ },
        { F6s,_,_,F2s,C3s,F3s,_,_ }, { C6s,_,_,_,_,_,_,_ }, { A5s,_,_,_,_,_,_,_ }, { G5s,C6s,G6s,C3s,F3s,C4s,_,_ }, { B5,_,_,A3s,_,_,_,_ }, { C6s,_,_,C4s,_,_,_,_ },

    /*177*/ { F5s,B5,D6s,F6s,B0,B1,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,F2s,_,_,_,_ }, { _,_,_,B2,_,_,_,_ }, { _,_,_,D3s,_,_,_,_ },
        { F5s,B5,E6,D3s,F3s,B3,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,B2,_,_,_,_ }, { _,_,_,D2s,D3s,_,_,_ }, { _,_,_,_,_,_,_,_ }, { G5s,G6s,_,_,_,_,_,_ },

    /*178*/ { E5,B5,F6s,E1,E2,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,E2,_,_,_,_ }, { E6,_,_,B2,_,_,_,_ }, { D6s,_,_,E3,_,_,_,_ },
        { E5,G5s,C6s,G3s,B3,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,E2,E3,_,_,_ }, { _,_,_,B5,_,_,_,_ }, { _,_,_,C6s,_,_,_,_ },

    /*179*/ { D5s,F5s,B5,D6s,F2s,F3s,_,_ }, { _,_,_,C3s,_,_,_,_ }, { _,_,_,F3s,_,_,_,_ }, { _,_,_,A3s,_,_,_,_ }, { _,_,_,C4s,_,_,_,_ }, { _,_,_,D4s,_,_,_,_ },
        { A5s,C6s,E6,A6s,G2,G3,_,_ }, { _,_,_,E3,_,_,_,_ }, { _,_,_,G3,_,_,_,_ }, { _,_,_,C4s,_,_,_,_ }, { _,_,_,G3s,_,_,_,_ }, { _,_,_,E3,_,_,_,_ },


    /*180*/ { B5,D6s,G6s,B6,G2s,G3s,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,_,_,_,_,_ }, { _,_,_,G2s,_,_,_,_ }, { G6s,_,_,D3s,_,_,_,_ }, { D6s,_,_,G3s,_,_,_,_ },
        { C5s,C6s,_,F1s,F2s,_,_,_ }, { _,_,_,F1s,F2s,_,_,_ }, { B4,B5,_,_,_,_,_,_ }, { _,_,_,F1s,F2s,_,_,_ }, { F4s,F5s,_,_,_,_,_,_ }, { _,_,_,F1s,F2s,_,_,_ },

    /*181*/ { B4,E5,G5s,B5,C1s,C2s,_,_ }, { _,_,_,_,_,_,_,_ }, { E5,_,_,_,_,_,_,_ }, { G5s,_,_,C2s,_,_,_,_ }, { B5,_,_,G2s,_,_,_,_ }, { G5s,_,_,C3s,_,_,_,_ },
        { E5,_,_,G3s,B3,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { E5,_,_,_,_,_,_,_ }, { F4s,F5s,_,C2s,C3s,_,_,_ }, { D5s,_,_,_,_,_,_,_ }, { B4,B5,_,_,_,_,_,_ },

    /*182*/ { C5s,D5s,F5s,C6s,D1s,D2s,_,_ }, { _,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { D5s,_,_,D2s,_,_,_,_ }, { B5,_,_,B2,_,_,_,_ }, { D6s,_,_,C3s,_,_,_,_ },
        { C6s,_,_,F3s,B3,_,_,_ }, { B5,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,B5,_,D2s,D3s,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { C5s,C6s,_,_,_,_,_,_ },
    /*183*/ { D5s,G5s,B5,D6s,E1,E2,_,_ }, { _,_,_,_,_,_,_,_ }, { G6s,_,_,_,_,_,_,_ }, { D7s,_,_,E2,_,_,_,_ }, { _,_,_,B2,_,_,_,_ }, { G6s,_,_,E3,_,_,_,_ },
        { C5s,E5,G5s,C6s,G3s,B3,_,_ }, { _,_,_,_,_,_,_,_ }, { B6,_,_,_,_,_,_,_ }, { C7s,_,_,F3s,_,_,_,_ }, { _,_,_,B2,_,_,_,_ }, { B6,_,_,_,E2,_,_,_ },
    /*184*/ { B4,E5,G5s,B5,E1,E2,_,_ }, { _,_,_,_,_,_,_,_ }, { B6,_,_,_,_,_,_,_ }, { G6s,_,_,E2,_,_,_,_ }, { B6,_,_,B2,_,_,_,_ }, { D7s,_,_,E3,_,_,_,_ },
        { B6,D7s,E7,G3s,B3,_,_,_ }, { _,_,_,_,_,_,_,_ }, { D7s,_,_,E3,_,_,_,_ }, { B6,_,_,G3s,_,_,_,_ }, { G6s,_,_,B3,_,_,_,_ }, { E6,_,_,E4,_,_,_,_ },
    /*185*/ { F3s,B3,C4s,F4s,F1s,F2s,_,_ }, { _,_,_,_,_,_,_,_ }, { F6s,_,_,F2s,_,_,_,_ }, { E6,_,_,B2,_,_,_,_ }, { D6s,_,_,C3s,_,_,_,_ }, { F5s,_,_,F3s,_,_,_,_ },
        { B5,_,_,B3,_,_,_,_ }, { F5s,_,_,C3s,_,_,_,_ }, { C5s,_,_,F3s,_,_,_,_ }, { B4,_,_,B3,_,_,_,_ }, { F5s,_,_,C3s,_,_,_,_ }, { B4,_,_,F3s,_,_,_,_ },
    /*186*/ { C4s,F4s,A4s,F1s,F2s,_,_,_ }, { F4s,_,_,_,_,_,_,_ }, { C4s,_,_,F2s,_,_,_,_ }, { A4s,_,_,F2s,_,_,_,_ }, { F4s,_,_,C3s,_,_,_,_ }, { C4s,_,_,F3s,_,_,_,_ },
        { A4s,_,_,C3s,_,_,_,_ }, { _,_,_,F3s,_,_,_,_ }, { _,_,_,A3s,_,_,_,_ }, { _,_,_,F3s,_,_,_,_ }, { _,_,_,C4s,_,_,_,_ }, { _,_,_,F4s,_,_,_,_ },
    /*187*/ { B4,_,_,B2,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
    /*188*/ { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
        { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ }, { B4,_,_,_,_,_,_,_ }, { C5s,_,_,_,_,_,_,_ }, { F5s,_,_,_,_,_,_,_ },
    };
  /*
    鼓：C2强壮的底鼓  D2 稍长的军鼓 E2 短暂的军鼓  D2s好狠的军鼓   A2 一通 G2 二通 F2 三通
      B1正常底鼓    F3 牛铃     C3s Clash2     A3 Clash1 B3和D3s 丁丁镲 G1s敲鼓棒
      A1节拍器轻音    A1s节拍器重音 F2s 闭踩镲    G2s 闭踩镲轻音 A2s开踩镲
  */
  int rhyVolume;     // 旋律音量，范围为0x0~0x7f
  int choVolume;     // 和弦音量
  //int drumVolume;    // 鼓音量
  for (int i = 12*0; i < 12*188; i++)
  {
    static int j = i / 12;
    //音量控制
    switch (j)
    {
        case 111:
        case 112:
            rhyVolume = 0x34;
            choVolume = 0x55;
            break;
        case 119:
            choVolume = 0x30;
            break;
        case 120:
            choVolume = 0x44;
            break;
        case 129:
            choVolume = 0x35;
            break;
        case 130:
            choVolume = 0x45;
            break;
        case 131:
            choVolume = 0x55;
            break;
        case 187:
            rhyVolume = 0x32;
            break;
        case 188:
            rhyVolume = 0x20;
            break;
        default:
            rhyVolume = 0x42;
            choVolume = 0x70;
            //drumVolume = 0x52;
            break;
    }
    // 旋律
    voice = (rhyVolume << 16) + ((wind[i][0]) << 8) + voiceType;
    midiOutShortMsg(handle, voice);
    voice = (rhyVolume << 16) + ((wind[i][1]) << 8) + voiceType + 1;
    midiOutShortMsg(handle, voice);
    // 和弦
    voice = (choVolume << 16) + ((wind[i][2]) << 8) + voiceType - 1;
    midiOutShortMsg(handle, voice);
    voice = (choVolume << 16) + ((wind[i][3]) << 8) + voiceType - 2;
    midiOutShortMsg(handle, voice);
    voice = (choVolume << 16) + ((wind[i][4]) << 8) + voiceType - 3;
    midiOutShortMsg(handle, voice);
    voice = (choVolume << 16) + ((wind[i][5]) << 8) + voiceType + 2;
    midiOutShortMsg(handle, voice);
    Sleep(sleep);
  }
  midiOutClose(handle);
}

//玫瑰星云
void NGC2237(void)
{
	HMIDIOUT handle;
	midiOutOpen(&handle, 0, 0, 0, 0);
	int rose[] =
	{
		1,0,4000,1,0,1000,1,0,1000,2,E5,E4,500,2,A4,A3,500,2,B4,B3,500,2,A5,A4,500, //1
		2,G5s,G4s,500,2,E5,E4,1000,1,0,1000,1,E5,500,1,D5,500,1,C5s,250,1,B4,250,//2
		4,B4,D3,A2,D2,500,1,A4,750,1,D2,250,1,A2,250,2,A4,D3,250,4,B4,E3,B2,E2,500,1,A4,250,1,G4s,250,3,B3,G3s,E3,500,1,E5,250,1,E5,250,//3
		2,E5,E2,250,1,C3s,250,1,F3s,250,1,A3,250,1,C4s,250,1,F3s,250,1,A3,250,1,C4s,250,1,E4,500,1,E5,500,1,D5,500,1,C5s,250,1,B4,250,//4
		4,B4,D3,A2,D2,500,1,A4,750,1,D2,250,1,A2,250,2,A4,D3,250,4,B4,E3,B2,E2,500,1,A4,250,1,G4s,250,3,B3,G3s,E3,500,1,G5s,500,//5
		2,G5s,F2s,250,1,C3s,250,1,F3s,250,1,A3,250,1,E4,250,1,B4,250,1,A4,250,1,G4s,250,2,F5s,E4,1000,1,F5s,500,1,E5,250,1,A4,250,//6
		2,A4,D2,250,1,A2,250,2,A4,D3,250,2,F4s,F3s,250,2,A4,A3,250,1,F3s,250,2,B4,D3,250,2,B4,A2,250,1,E2,250,1,B2,250,1,E3,250,1,G3s,250,2,F5s,B3,250,1,G3s,250,2,E5,E3,250,2,B4,B2,250,//7
		2,B4,F2s,250,1,C3s,250,2,B4,F3s,250,2,A4,A3,250,2,B4,C4s,500,1,C5s,250,1,C5s,250,2,A4,A3,500,2,G4s,G3s,500,2,E4,E3,500,2,C4s,C3s,250,1,A4,250,//8
		4,A4,D3,A2,D2,500,1,D5,750,1,D3,250,1,F3s,250,1,A3,250,1,D4,500,1,D5,500,3,E5,B4,G4s,500,3,E5,B4,G4s,500,//9
		4,E5,B4,G4s,E2,250,1,B2,250,1,E3,250,1,G3s,250,1,B3,250,1,E3,250,1,G3s,250,1,B3,250,4,E4,B3,G3s,E3,2000,//10
		4,E4,B3,G3s,E3,2000,1,0,500,1,E5,500,3,B5,E5,C5s,500,3,A5,E5,C5s,500,//11
		4,A5,E5,C5s,F2s,250,1,C3s,250,2,E5,F3s,250,1,A3,250,4,B5,E5,C5s,C4s,250,1,A3,250,4,A5,E5,C5s,F3s,250,1,C3s,250,1,D2,250,1,A2,250,2,E5,D3,250,1,F3s,250,4,C6s,A5,E5,A3,250,1,F3s,250,4,C6s,A5,E5,D3,250,1,A2,250,//12
		4,C6s,A5,E5,A2,250,1,E3,250,1,A3,250,1,C4s,250,1,E4,250,2,E4,C4s,250,2,A4,A3,250,2,E5,E3,250,5,B4,E3,B2,G2s,E2,500,1,E5,500,4,B5,E5,C5s,E4,250,1,B3,250,4,A5,E5,C5s,G3s,250,1,E3,250,//13
		4, A5, E5, C5s, F2s, 250,1, C3s, 250,2, E5, F3s, 250,1, A3, 250,4, B5, E5, C5s, C4s, 250,1, A3, 250,4, A5, E5, C5s, F3s, 250,1, C3s, 250,1, D2, 250,1, A2, 250,2, E5, D3, 250,1, F3s, 250,4, C6s, A5, E5, A3, 250,1, F3s, 250,4, C6s, A5, E5, D3, 250,1, A2, 250,//14
		4,C6s,A5,E5,A2,250,1,E2,250,1,A3,250,1,C4s,250,1,E4,250,3,D6,D5,C4s,250,3,C6s,C5s,A3,250,3,B5,B4,E3,250,4,E3,B2,G2s,E2,1000,2,A5,A4,500,2,G5s,G4s,250,2,E5,E4,250,//15
		5, E5, E4, F3s, C3s, F2s, 500,1,C5s,500,4,B4,F3s,C3s,F2s,500,1,A4,250,1,B4,500,3,D3,A2,D2,500,1,C5s,250,5,A5,A4,D3,A2,D2,500,2,G5s,G4s,250,2,E5,E4,250,//16
		5,E5,E4,A3,E3,A2,500,1,E5,250,1,C5s,250,4,B4,A3,E3,A2,500,1,C5s,250,1,B4,250,3,E3,B2,E2,1000,4,A4,E3,B2,E2,500,1,B4,250,1,C5s,250,//17
		2,C5s,F2s,250,1,C3s,250,1,F3s,250,1,A3,250,1,C4s,250,1,A3,250,2,E5,F3s,250,1,C3s,250,2,E5,D2,250,1,A2,250,2,D5,D3,250,1,F3s,250,2,C5s,A3,250,1,F3s,250,2,D5,D3,250,2,C5s,A2,500,//18
		1,E3,250,1,A3,250,1,C4s,250,1,E4,250,1,C4s,250,1,A3,250,1,E3,250,4,E3,B2,G2s,E2,500,1,D5,250,1,C5s,250,1,B4,500,1,A4,2500,1,0,2000,//19,20
		5,F5s,F4s,F3s,C3s,F2s,500,3,F3s,C3s,F2s,500,5,G5s,G4s,F3s,C3s,F2s,500,3,F3s,C3s,F2s,500,5,A5,A4,F3s,C3s,F2s,500,3,F3s,C3s,F2s,500,5,B5,B4,F3s,C3s,F2s,500,3,F3s,C3s,F2s,500,//21
		5,C6s,C5s,D3,A2,D2,500,3, D3, A2, D2, 500,5,E6,E5, D3, A2, D2, 500,3, D3, A2, D2, 500,5,A5,A4, D3, A2, D2, 500,3, D3, A2, D2, 500,3, D3, A2, D2, 500,3, D3, A2, D2, 500,//22
		5,E5,E4,A3,E3,A2,500,3, A3, E3, A2, 500,5,G5s,G4s, A3, E3, A2, 500,3, A3, E3, A2, 500,5,A5,A4, A3, E3, A2, 500,3, A3, E3, A2, 500,5,B5,B4, A3, E3, A2, 500,3, A3, E3, A2, 500,//23
		5,A5,A4,E3,B2,E2,500,3, E3, B2, E2, 500,5,E6,E5, E3, B2, E2, 500,3, E3, B2, E2, 500,5,B5,B4, E3, B2, E2, 500,3, E3, B2, E2, 500,5,G5s,G4s, E3, B2, E2, 500,3, E3, B2, E2, 500,//24
		5,B5,B4, B3, F3s, B2, 500,3, B3, F3s, B2, 500,5,C6s,C5s, B3, F3s, B2, 500,3, B3, F3s, B2, 500,5,D6,D5, B3, F3s, B2, 500,3, B3, F3s, B2, 500,5,E6,E5, B3, F3s, B2, 500,3, B3, F3s, B2, 500,//25
		5,F6s,F5s,G3 ,D3,G2 ,500,3, G3 , D3, G2 , 500,5,A6,A5, G3 , D3, G2 , 500,3, G3 , D3, G2 , 500,5,G6 ,G5 , G3 , D3, G2 , 500,5,F6s,F5s, G3 , D3, G2 , 500,5,D6,D5, G3 , D3, G2 , 500,5,A5,A4, G3 , D3, G2 , 500,//26
		6,E5,G4s,E4,E3,B2,E2,500,3, E3, B2, E2, 500,3, E3, B2, E2, 500,3, E3, B2, E2, 500,3, E3, B2, E2, 500,3, E3, B2, E2, 500,3, E3, B2, E2, 500,3, E3, B2, E2, 500,//27
		5,D5,D4,A3,E3,A2,500,3, A3, E3, A2, 500,3, A3, E3, A2, 500,3, A3, E3, A2, 500,2,C5s,C4s,500,1,E5,500,1,D5,500,1,C5s,250,1,B4,250,//28
		4, B4, D3, A2, D2, 500,1, A4, 750,1, D2, 250,1, A2, 250,2, A4, D3, 250,4, B4, E3, B2, E2, 500,1, A4, 250,1, G4s, 250,3, B3, G3s, E3, 500,1, E5, 250,1, E5, 250,//29
		2, E5, E2, 250,1, C3s, 250,1, F3s, 250,1, A3, 250,1, C4s, 250,1, F3s, 250,1, A3, 250,1, C4s, 250,1, E4, 500,1, E5, 500,1, D5, 500,1, C5s, 250,1, B4, 250,//30
		4, B4, D3, A2, D2, 500,1, A4, 750,1, D2, 250,1, A2, 250,2, A4, D3, 250,4, B4, E3, B2, E2, 500,1, A4, 250,1, G4s, 250,3, B3, G3s, E3, 500,1, G5s, 500,//31
		2, G5s, F2s, 250,1, C3s, 250,1, F3s, 250,1, A3, 250,1, E4, 250,1, B4, 250,1, A4, 250,1, G4s, 250,2, F5s, E4, 1000,1, F5s, 500,1, E5, 250,1, A4, 250,//32
		2,A4,D2,250,1,A2,250,2,A4,D3,250,2,F4s,F3s,250,2,A4,A3,250,1,F3s,250,2,E5,D3,250,2,E5,A2,250,1,E2,250,2,C5s,B2,250,2,B4,E3,250,1,G3s,250,2,A5,B3,250,1,G3s,250,2,G5s,E3,250,2,E5,B2,250,//33
		2,E5,F2s,250,1,C3s,250,2,E5,F3s,250,2,C5s,A3,250,2,B4,C4s,500,1,C5s,250,1,C5s,250,2,A4,A3,250,1,D5,250,3,C5s,G4s,G3s,500,2,E4,E3,500,2,C4s,C3s,250,1,A4,250,//34
		4,A4,D3,A2,D2,500,4,D5, D3, A2, D2, 500,3, D3, A2, D2, 500,3, D3, A2, D2, 500,3, D3, A2, D2, 500,4,D5, D3, A2, D2, 500,4,E5, D3, A2, D2, 500,4,E5, D3, A2, D2, 500,//35
		4,E5,E3,B2,E2,500,6,B5,E5,B4, E3, B2, E2, 500,3, E3, B2, E2, 500,3, E3, B2, E2, 500,4,E4,B3,G3s,E3,500,1,E5,500,3,B5,E5,C5s,500,3,A5,E5,C5s,500,//36
		4, A5, E5, C5s, F2s, 250,1, C3s, 250,2, E5, F3s, 250,1, A3, 250,4, B5, E5, C5s, C4s, 250,1, A3, 250,4, A5, E5, C5s, F3s, 250,1, C3s, 250,1, D2, 250,1, A2, 250,	2, E5, D3, 250,	1, F3s, 250,4, C6s, A5, E5, A3, 250,1, F3s, 250,4, C6s, A5, E5, D3, 250,1, A2, 250,//37
		4, C6s, A5, E5, A2, 250,1, E3, 250,1, A3, 250,1, C4s, 250,1, E4, 250,1, C4s, 250,1, A3, 250,1, E3, 250,4, E3, B2, G2s, E2, 500,1, E5, 500,3, B5, E5, C5s, 500,
		3, A5, E5, C5s, 500,//38
		4, A5, E5, C5s, F2s, 250,1, C3s, 250,2, E5, F3s, 250,1, A3, 250,4, B5, E5, C5s, C4s, 250,1, A3, 250,4, A5, E5, C5s, F3s, 250,1, C3s, 250,1, D2, 250,1, A2, 250,2, E5, D3, 250,1, F3s, 250,4, C6s, A5, E5, A3, 250,1, F3s, 250,4, C6s, A5, E5, D3, 250,1, A2, 250,//39
		4, C6s, A5, E5, A2, 250,1, E2, 250,1, A3, 250,1, C4s, 250,1, E4, 250,3, D6, D5, C4s, 250,3, C6s, C5s, A3, 250,3, B5, B4, E3, 250,4, E3, B2, G2s, E2, 1000,2, A5, A4, 500,2, G5s, G4s, 250,2, E5, E4, 250,//40
		5, E5, E4, F3s, C3s, F2s, 500,1, C5s, 500,4, B4, F3s, C3s, F2s, 500,1, A4, 250,	1, B4, 500,3, D3, A2, D2, 500,1, C5s, 250,5, A5, A4, D3, A2, D2, 500,2, G5s, G4s, 250,2, E5, E4, 250,//4
		5, E5, E4, A3, E3, A2, 500,1, E5, 250,1, C5s, 250,4, B4, A3, E3, A2, 500,1, C5s, 250,1, B4, 250,3, E3, B2, E2, 1000,4, A4, E3, B2, E2, 500,	1, B4, 250,1, C5s, 250,//42
		2,C5s,F2s,250,1,C3s,250,1,F3s,250,1,A3,250,1,C4s,250,1,A3,250,4,E5,C5s,A4,F3s,250,1,C3s,250,4,E5,C5s,A4,D2,250,	1,A2,250,2,D5,D3,250,1,F3s,250,	2,C5s,A3,250,1,F3s,250,2,D5,D3,250,2,E5,A2,500,//43
		2,D5,E3,250,2,C5s,A3,250,1,C4s,250,1,E4,250,1,C4s,250,1,A3,250,1,E3,250,4,E3,B2,G2s,E2,500,2,E5,E4,500,2,B5,B4,500,2,A5,A4,500,//44
		5,A5,A4,F3s,C3s,F2s,250,1,C3s,250,1,F3s,250,1,A3,250,4,E5,C4s,A3,F3s,250,1,A3,250,3,G5s,G4s,F3s,250,3,A5,A4,C3s,250,5,B5,B4,E3,B2,E2,250,1,E3,250,1,G3s,250,1,B3,250,5,C5s,E4,B3,G3s,E3,250,1,A3,250,3,A5,A4,G3s,250,1,E3,250,//45
		3,G5s,G4s,F2s,250,2,G4s,C3s,250,2,B4,F3s,250,2,G5s,G3s,250,5,A5,E5,C5s,A4,A3,250,1,G3s,250,1,F3s,250,1,C3s,250,2,A3,A2,500,4,E5,E4,G3s,G2s,500,4,B5,B4,E3,E2,500,4,A5,A4,C3s,C2s,500,//46
		6,A5,A4,D3,A2,F2s,D2,250,1,D3,250,1,F3s,250,1,A3,250,1,D4,250,1,A3,250,1,F3s,250,1,D3,250,4,E3,B2,G2s,E2,250,1,E3,250,3,A5,A4,G3s,250,1,B5,250,5,B5,B4,E4,B3,G3s,250,1,B3,250,3,C6s,C5s,G3s,250,1,E3,250,//47
		6,C6s,C5s,A3,E3,C3s,A2,250,1,E3,250,3,D6,D5,A3,250,3,C6s,C5s,C3s,250,3,B5,B4,E4,250,1,C4s,250,1,A3,250,1,E3,250,4,E3,B2,G2s,E2,1000,1,E4,250,1,B3,250,3,A5,A4,G3s,250,3,G5s,G4s,E3,250,//48
		3,B3,F3s,B2,500,3, B3, F3s, B2, 500,3, B3, F3s, B2, 500,3, B3, F3s, B2, 500,3, B3, F3s, B2, 500,5,F5s,F4s, B3, F3s, B2, 500,5,D6,D5, B3, F3s, B2, 500,5,C6s,C5s, B3, F3s, B2, 500,//49
		5,C6s,C5s,D3,A2,D2,500,5,A5,A4, D3, A2, D2, 500,3, D3, A2, D2, 500,3, D3, A2, D2, 500,3, D3, A2, D2, 500,3, D3, A2, D2, 500,3, D3, A2, D2, 500,5,A5,A4, D3, A2, D2, 500,//50
		5,E6,E5,E3,B2,E2,500,3, E3, B2, E2, 500,5,D6,D5, E3, B2, E2, 500,3, E3, B2, E2, 500,5,C6s,C5s, E3, B2, E2, 500,3, E3, B2, E2, 500,5,B5,B4, E3, B2, E2, 500,3, E3, B2, E2, 500,//51
		6,C6s,G5s,C5s,C4s,G3s,C3s,500,3, C4s, G3s, C3s, 500,3, C4s, G3s, C3s, 500,3, C4s, G3s, C3s, 500,3, C4s, G3s, C3s, 500,3, C4s, G3s, C3s, 500,3, C4s, G3s, C3s, 500,3, C4s, G3s, C3s, 500,//52
		3, C4s, G3s, C3s, 2000,1,0,1500,1,E5,500,//53
		2,G5s,F3s,500,1,C4s,500,1,F4s,500,2,A5,A4,1000,1,0,500,1,A4,250,1,G4s,250,2,E5,E4,500,//54
		2,B5,D3,500,1,A3,500,1,D4,500,4,A5,A4,F4s,D4,1000,1,0,500,1,D3,250,1,A3,250,2,A5,D4,500,//55
		4,G5s,F4s,C4s,F3s,250,1,E5,250,1,C5s,500,1,A3,250,1,B3,250,1,C4s,500,3,D4,A3,D3,1000,1,A3,250,1,G3s,250,2,E5,E3,500,//56
		4,E5,A4,E4,A3,250,1,C5s,250,1,B4,500,1,A3,250,1,E4,250,1,A4,500,3,E4,B3,E3,500,2,B4,B3,500,5,C5s,C4s,A3,E3,A2,500,5,E5,E4,E3,B2,E2,500,//57
		5,G5s,G4s,F3s,C3s,F2s,500,3, F3s, C3s, F2s, 500,3, F3s, C3s, F2s, 500,5,A5,A4, F3s, C3s, F2s, 500,3, F3s, C3s, F2s, 500,3, F3s, C3s, F2s, 500,3, F3s, C3s, F2s, 500,5,E5,E4, F3s, C3s, F2s, 500,//58
		5,B5,B4,D3,A2,D2,500,3, D3, A2, D2, 500,5,A5,A4, D3, A2, D2, 500,3, D3, A2, D2, 500,5,G5s,G4s, D3, A2, D2, 500,3, D3, A2, D2, 500,3, D3, A2, D2, 250,2,G5s,G4s,250,5,A5,A4, D3, A2, D2, 250,2,B5,B4,250,//59
		5,C6s,C5s,A3,E3,A2,500,3, A3, E3, A2, 500,3, A3, E3, A2, 250,1,C4s,250,4,E4, A3, E3, A2, 250,1,A4,250,4,C5s, A3, E3, A2, 250,1,E4,250,4,A4, A3, E3, A2, 250,1,C5s,250,4,E5, A3, E3, A2, 500,5,A5,A4, A3, E3, A2, 500,//60
		6, E6, B5, E5, E3, B2, E2, 500,3, E3, B2, E2, 500,3, E3, B2, E2, 500,3, E3, B2, E2, 500,3, F3, C3, F2, 500,	2, F5, F4, 500,2, C6, C5, 500,2, A5s, A4s, 500,//61
		5, A5s, A4s, G3, D3, G2, 250,1, D2, 250,3, F5, F4, G3, 250,1, D3, 250,5, C6, C5, A3s, G3, D3, 250,1, D3, 250,3, A5s, A4s, G3, 250,1, D3, 250,3, D3s, A2s, D2s, 250,1, A2s, 250,3, F5, F4, D3s, 250,1, A2s, 250,6, D6, A5s, D5, G3, D3s, A2s, 250,1, A2s, 250,4, D6, A5s, D5, D3s, 250,1, A2s, 250,//62
		6, D6, A5s, D5, A3s, F3, A2s, 250,1, F3, 250,1, A3s, 250,1, F3, 250,3, D4, A3s, F3, 250,1, F3, 250,1, A3s, 250,1, F3, 250,3, F3, C3, F2, 250,1, C3, 250,3, F5, F4, F3, 250,1, C3, 250,5, C6, C5, A3, F3, C3, 250,1, C3, 250,4, A5s, G5, A4s, F3, 250,1, C3, 250,//63
		6, A5s, G5, A4s, G3, D3, G2, 250,1, D3, 250,3, F5, F4, G3, 250,1, D3, 250,5, C6, C5, A3s, G3, D3, 250,1, D3, 250,4, A5s, G5, A4s, G3, 250,1, D3, 250,3, D3s, A2s, D2s, 250,1, A2s, 250,3, F5, F4, D3s, 250,	1, A2s, 250,6, D6, A5s, D5, G3, D3s, A2s, 250,1, A2s, 250,4, D6, A5s, D5, D3s, 250,1, A2s, 250,//64
		6, D6, A5s, D4, A3s, F3, A2s, 250,1, F3, 250,1, A3s, 250,1, F3, 250,3, D4, A3s, F3, 250,3, D6s, D5s, F3, 250,3, D6, D5, A3s, 250,3, F6, F5, F3, 250,3, F3, C3, F2, 250,1, C3, 250,1, F3, 250,1, F2, 250,5, F6, F5, A3, F3, C3, 250,1, C3, 250,3, D6, D5, F3, 250,3, A5s, A4s, C3, 250,//65
		3, A5s, A4s, G2, 250,1, D3, 250,2, G5, G3, 250,2, F5, D3, 250,2, G5, A5s, 250,1, D3, 250,2, A5s, G3, 250,3, F5, A4s, D3, 250,1, D2s, 250,1, A2s, 250,1, D3s, 250,1, A2s, 250,3, D6, D5, G3, 250,1, A2s, 250,2, A5s, D3s, 250,3, F5, A4s, A2s, 250,//66
		3, F5, A4s, A2s, 250,1, F3, 250,2, F5, A3s, 250,2, D5, F3, 250,2, C5, D4, 250,1, F3, 250,2, F5, A3s, 250,2, F5, F3, 250,1, F2, 250,1, C3, 250,1, F3, 250,1, C3, 250,1, A3, 250,	1, C3, 250,2, A4s, F3, 250,2, C5, C3, 250,//67
		4, D5, A4s, G4, G2, 250,1, D3, 250,1, G3, 250,1, D3, 250,1, A3s, 250,1, D3, 250,3, F5, F4, G3, 250,1, D3, 250,1, D2s, 250,1, A2s, 250,3, D5s, D4s, D3s, 250,1, A2s, 250,3, D5, D4, G3, 250,1, A2s, 250,3, D5s, D4s, D3s, 250,1, A2s, 250,//68
		3, D5s, D4s, A2s, 250,1, F3, 250,3, D5, D4, A3s, 250,1, F3, 250,1, D4, 250,1, F3, 250,1, A3s, 250,1, F3, 250,1, F2, 250,1, C3, 250,2, D5s, F3, 250,2, D5, C3, 250,2, C5, A3, 250,1, C3, 250,2, A4s, F3, 250,1, C3, 250,//69
		3, A4s, D4, G3, 250,1, A4, 250,1, A4s, 250,1, F5, 500,1, A4s, 250,1, A4, 250,1, F4, 250,2, A4s, D3s, 250,1, A4, 250,2, A4s, A3s, 250,1, F5, 250,1, D4s, 250,1, A4s, 250,1, A4, 250,1, F4, 250,//70
		2, A4s, A2s, 250,2, A4, F3, 250,2, A4s, A3s, 250,1, F3, 250,2, F5, D4, 250,1, A4s, 250,1, A4, 250,1, F4, 250,2, C5, F2, 250,2, F4, C3, 250,2, C5, F3, 250,2, F5, A3, 250,2, A5, C4, 250,2, A5s, A3, 250,2, A5, F3, 250,2, F5, C3, 250,//71
		4, A5s, G4, D4, G3, 250,1, A5, 250,1, A5s, 250,1, F6, 500,2, A5s, G3, 250,2, A5, D4, 250,2, F5, G4, 250,2, A5s, D3s, 250,2, A5, A3s, 250,2, A5s, D4s, 250,2, F6, G4, 250,1, A4s, 250,2, A5s, G4, 250,2, A5, D4s, 250,2, F5, A3s, 250,//72
		2, A5s, A2s, 250,2, A5, F3, 250,2, A5s, A3s, 250,1, D4, 250,2, F6, F4, 250,2, A5s, D4, 250,2, A5, A3s, 250,	2, F5, F3, 250,4, C6, F4, C4, F3, 250,1, F5, 250,1, C6, 250,1, F6, 250,1, A6, 250,1, A6s, 250,1, A6, 250,1, F6, 2250,1, 0, 2000,//73,74
		1,0,4000,-1
	};
	int i = 1 , t = 0 , o = 0 , p = 0 , q = 0;
	int nebula[10010];
	while (rose[i] != -1)
	{
		t = rose[i];
		for (o = i + 1; o <= i + rose[i]; ++o)
		{
			if (rose[o] != 0)
			{
				nebula[o] = ((0x7f) << 16) + (rose[o] << 8) + (0x90);
				midiOutShortMsg(handle, nebula[o]);
			}
		}
		Sleep(rose[i + rose[i] + 1] * 0.88);
		p += rose[i + rose[i] + 1];
		if (p % 4000 == 0)
		{
			q += p / 4000;
			p = 0; 
		}
		i = i + rose[i] + 2;
	}
	midiOutClose(handle);
}

//落凡尘
void People(void)
{
 	HMIDIOUT handle;
 	midiOutOpen(&handle, 0, 0, 0, 0);

 	int peoplee[] =
 	{
		0,0,1000,
		F4s,1000, G4s,500, B4,500, C5s,2000, //1
		B4,500, G4s,500, G4s,500, A5s,500, D5s,2000, //2
		G4s,500, B4,500, B4,500, D5s,500, C5s,500, B4,500, C5s,1000, //3
		C5s,500, B4,500, C5s,500, B4,500, D5s,1000, D5s,500, C5s,500, //4
		B4,1500, G5s,500, F5s,2000, //5
		G4s,500, B4,500, B4,500, E5,500, D5s,2000, //6
		D5s,500, F5s,500, F5s,500, G5s,500, F5s,500, D5s,500, C5s,500, B4,500, //7
		G4s,500, B4,500, B4,500, C5s,500, B4,2000, 0,2000, //8
		F4s,1000, G4s,500, B4,500, C5s,2000, //9
		B4,500, G4s,500, G4s,500, A5s,500, D5s,2000, //10
		G4s,500, B4,500, B4,500, D5s,500, C5s,250, B4,250, B4,500, C5s,1000, //11
		C5s,500, B4,500, C5s,500, B4,500, D5s,1000, D5s,500, C5s,500, //12
		B4,1500, G5s,500, F5s,2000, //13
		G5s,500, B5,500, B5,500, D5s,500, C5s,500, B4,1500, //14
		G4s,500, B4,500, B4,500, G5s,500, F5s,500, D5s,500, C5s,500, B4,500, //15
		G4s,500, B4,500, B4,500, C5s,1000, B4,2500, //16
		0,4000, //17
		D5s,500, F5s,500, B5,1500, A5s,500, G5s,500, F5s,500, //18
		D5s,500, G5s,250, F5s,750, F5s,2500, //19
		D5s,500, F5s,500, G5s,1500, A5s,500, B5,500, F5s,500, //20
		B4,500, F5s,500, D5s,1750, C5s,250, C5s,1000, //21
		D5s, 500, F5s, 500, B5, 1500, A5s, 500, G5s, 500, F5s, 500, //22
		D5s,500, D6s,500, A5s,500, A5s,2500, //23
		D5s, 500, F5s, 500, G5s, 1500, A5s, 500, B5, 500, A5s, 500, //20
		G5s,250, F5s,500, D5s,250, F5s,2000, 0,1000, //21
		D5s,1000, C5s,250, B4,250, B4,2500, //22
		0,1000,-1
 	};
	int i = 1;
	int back;
	while (peoplee[i] != -1)
	{
		if (peoplee[i] != 0)
		{
			back = ((0x7f) << 16) + ((peoplee[i]) << 8) + (0x90);
			midiOutShortMsg(handle, back);
		}
		Sleep(peoplee[i+1]/1.1);
		i = i + 2;
	}
	midiOutClose(handle);
}

//光之黎明
void Light(void)
{
	HMIDIOUT handle;
	midiOutOpen(&handle, 0, 0, 0, 0);
	int light[] = {
		0,1,0,1000,1,F2,500,2,E5,C3,500,2,E5,E3,500,2,E5,A3,250,1,E5,250,2,E5,C4,500,1,D4,250,1,C5,250,2,C5,A4,500,2,B4,E3,500,//1
		2,B4,G2,500,1,D3,500,1,G3,500,1,B3,500,2,B4,D4,500,1,C5,500,2,B4,B3,500,2,B4,G3,500,//2
		2,B4,E2,500,1,B2,500,1,E3,500,1,G3,500,2,G4,B3,500,1,A4,500,2,B4,G3,250,1,A4,250,1,G3,250,1,A4,250,//3
		2,A4,A2,500,1,E3,500,1,A3,500,1,C4,500,1,E4,500,1,C4,500,1,A3,500,//4
		1,F2,500,2,E5,C3,500,2,E5,E3,500,2,E5,A3,250,1,E5,250,1,C4,500,1,G5,250,1,E5,250,2,E5,A3,500,2,D5,E3,500,//5
		1,G2,500,1,D3,500,1,G3,500,1,B3,500,2,D5,D4,500,1,G5,500,2,C5,B3,250,1,D5,250,1,G3,250,1,C5,250,//6
		1,F2,500,1,C3,500,1,E3,500,2,A4,A3,500,2,A4,C4,500,1,B4,500,2,C5,A3,500,2,D5,E3,500,//7
		2,E5,C2,500,1,G2,500,2,F5,C3,500,2,E5,E3,500,1,G3,500,1,G5,500,1,E3,500,2,F5,C3,250,1,E5,250,//8
		1,C2,500,1,G2,500,1,C3,500,2,G4,E3,500,2,E5,G3,500,1,F5,250,1,E5,250,2,E5,E3,250,1,C5,250,2,B4,C3,250,1,B4,250,//9
		2,B4,E2,500,2,G5,B2,250,1,G5,250,2,G5,E3,500,1,G3,500,1,B3,500,1,C5,500,2,B4,G3,500,2,C5,E3,500,//10
		2,A5,A2,500,2,G5,E3,250,1,G5,250,2,G5,A3,250,1,E5,500,1,C4,500,2,A5,E4,500,1,G4,250,1,G4,250,1,C4,250,1,E5,500,1,A3,250,1,E5,250,//11
		2,E5,E2,500,1,B2,500,1,E3,500,1,G3,500,1,B3,1000,1,G3,500,1,E3,500,//12
		2,A4,F2,250,1,B4,250,2,C5,C3,250,1,C5,250,1,A3,500,1,G5,250,1,G5,250,2,G5,G2,250,1,D5,500,1,D3,500,1,B3,500,1,G5,500,//13
		2,B4,E2,500,2,C5,B2,250,1,D5,250,2,D5,G3,250,1,D5,500,1,C5,250,2,C5,A2,500,	1,E3,500,1,C4,1000,//14
		2,E5,F2,500,2,F5,C3,500,2,E5,A3,500,1,A4,500,2,D5,G2,500,1,D3,500,1,B3,1000,//15
		1,C2,500,2,C5,G2,500,2,C5,C3,500,1,E3,500,3,E4,C4,G3,2000,//16
		1,C2,500,2,C5,G2,500,2,C5,C3,500,2,C5,E3,500,2,C5,G3,500,1,C5,500,2,C5,E3,250,1,D5,250,1,C3,250,1,B4,250,//17
		2,B4,E2,500,2,B4,B2,500,2,B4,E3,500,2,B4,G4,250,1,B4,250,2,B4,B3,250,1,B4,500,1,C5,250,2,C5,G3,250,1,B4,250,2,A4,E3,250,1,G4,250,//18
		2,A4,A2,250,1,C5,250,2,A4,E3,250,1,C5,250,1,A3,500,1,C4,500,1,E4,500,1,E5,500,2,C5,C4,500,2,A4,A3,250,1,G4,250,//19
		2,A4,F2,500,1,C3,500,2,C5,A3,500,1,C5,500,2,C5,G3,500,2,D5,D3,500,1,B3,1000,1,C5,500,//20
		1,C2,500,2,C5,G2,500,2,C5,C3,500,2,G4,E3,500,2,C5,G3,500,1,C5,500,2,G5,E3,250,1,F5,250,1,C3,250,1,E5,250,//21
		2, E5, E2, 500,2, B4, B2, 500,2, B4, E3, 500,2, B4, G4, 250,1, B4, 250,2, B4, B3, 250,1, B4, 500,1, C5, 250,2, C5, G3, 250,1, G5, 250,1, E3, 250,1, A4, 250,//22
		2,B4,F2,500,2,C5,C3,500,1,E3,500,2,F5,A3,250,1,E5,250,2,E5,C4,1000,1,A3,500,2,A4,E3,500,//23
		2,D5,D2,500,2,E5,A2,500,1,F3,500,1,F5,500,2,G5,G2,500,2,A5,D3,500,1,B3,1000,//24
		2,A5, C2, 500,1, G2, 500,1, C3, 500,2,G5, E3, 500,3, E4, C4, G3, 2000,//25
		1, C2, 500,1, G2, 500,1, C3, 500,2, G4, E3, 500,2, E5, G3, 500,1, F5, 250,1, E5, 250,2, E5, E3, 250,1, C5, 250,2, B4, C3, 250,1, B4, 250,//26
		2, B4, E2, 500,2, G5, B2, 250,1, G5, 250,2, G5, E3, 500,1, G3, 500,1, B3, 500,1, C5, 500,2, B4, G3, 500,2, C5, E3, 500,//27
		2, A5, A2, 500,2, G5, E3, 250,1, G5, 250,2, G5, A3, 250,1, E5, 500,1, C4, 500,2, A5, E4, 500,1, G4, 250,1, G4, 250,2, G5,C4, 250,1, E5, 500,1, A3, 250,1, E5, 250,//28
		2, E5, E2, 500,	1, B2, 500,1, E3, 500,2,F5, G3, 250,1,G5,250,1, B3, 1000,1, G3, 500,1, E3, 500,//29
		2, A4, F2, 250,1, B4, 250,2, C5, C3, 250,1, C5, 250,1, A3, 500,1, G5, 250,1, G5, 250,2, G5, G2, 250,1, D5, 500,1, D3, 500,1, B3, 500,1, G5, 500,//30
		2, B4, E2, 500,2, C5, B2, 250,1, D5, 250,2, D5, G3, 250,1, E5, 500,1, E5, 250,2, E5, A2, 500,1, E3, 500,1, C4, 1000,//31
		2,E5,F2,500,2,F5,C3,500,2,F5,E3,250,1,E5,250,1,A3,250,1,E5,250,2,F5,C4,1000,1,A3,500,2,G5,E3,500,//32
		2,E5,G2,500,2,D5,D3,500,1,G3,500,1,B3,500,1,D4,500,1,G4,500,2,D5,B3,500,2,E5,G3,500,//33
		2,E5, C2, 500,1, G2, 500,1, C3, 500,1, E3, 500,2, E5, G3, 500,1, F5, 250,1,E5,250,2, E5, E3, 250,1, C5, 250,1, C3, 250,1, B4, 250,//34
		2, B4, E2, 250,1, G5, 250,1, B2, 250,1, G5, 250,2,G5, E3, 500,1, G3, 500,1, B3, 500,1,C5,500,2, B4, G3, 500,2, C5, E3, 500,//35
		2, A5, A2, 500,	2, G5, E3, 250,	1, G5, 250,	2, G5, A3, 250,	1, E5, 500,	1, C4, 500,	2, C6, E4, 500,	1, C6, 250,	1, B5, 250,	2,B5, C4, 250,1, G5, 250,1, A3, 250,1, E5, 250,//36
		2, E5, E2, 500,1, B2, 500,1, E3, 500,1, G3, 500,1, B3, 1000,1, G3, 500,1, E3, 500,//37
		2, A4, F2, 250,1, B4, 250,2, C5, C3, 250,1, C5, 250,1, A3, 500,1, G5, 250,1, G5, 250,2, G5, G2, 250,1, D5, 500,1, D3, 500,1, B3, 1000,//38
	  	2, B4, E2, 500,2, C5, B2, 250,1, D5, 250,2, D5, G3, 250,1, E5, 500,	1, E5, 250,2, E5, A2, 250,1,D5,250,2,C5, E3, 500,1, C4, 1000,//39
		2, E5, F2, 500,2, F5, C3, 500,2, E5, E3, 250,1, A5, 250,1, A3, 250,1, C5, 250,2, C5, C4, 1000,1, A3, 500,1, E3, 500,//40
		2,E5,F2,500,2,F5,C3,500,2,F5,E3,250,1,F5,250,2,E5,A3,250,1,D5,250,2,C5,G2,250,1,B4,500,1,D3,500,1,B3,500,1,C5,500,//41
		2,E5,C2,500,1,G2,500,1,C3,500,1,E3,500,3,E4,C4,G3,2000,//42
		1, C2, 500, 1, G2, 500, 1, C3, 500, 2, G4, E3, 500, 2, E5, G3, 500, 1, F5, 250, 1, E5, 250, 2, E5, E3, 250, 1, C5, 250, 2, B4, C3, 250, 1, B4, 250,//43
		2, B4, E2, 500, 2, G5, B2, 250, 1, G5, 250, 2, G5, E3, 500, 1, G3, 500, 1, B3, 500, 1, C5, 500, 2, B4, G3, 500, 2, C5, E3, 500,//44
		2, A5, A2, 500, 2, G5, E3, 250, 1, G5, 250, 2, G5, A3, 250, 1, E5, 500, 1, C4, 500, 2, A5, E4, 500, 1, G4, 250, 1, G4, 250, 2, G5, C4, 500, 2, E5, A3, 250, 1, E5, 250,//45
		2, E5, E2, 500, 1, B2, 500, 1, E3, 500, 1, G3, 500, 1, B3, 1000, 1, G3, 500, 1, E3, 500,//46
		2, A4, F2, 250, 1, B4, 250, 2, C5, C3, 250, 1, C5, 250, 1, A3, 500, 1, G5, 250, 1, G5, 250, 2, G5, G2, 250, 1, D5, 500, 1, D3, 500, 1, B3, 500, 1, G5, 500,//47
		2, B4, E2, 500, 2, C5, B2, 250, 1, D5, 250, 2, D5, G3, 250, 1, E5, 250, 1, F5, 250, 1, E5, 250, 2, E5, A2, 500, 1, E3, 500, 1, C4, 1000,//48
		2, E5, F2, 500, 2, F5, C3, 500, 2, F5, E3, 250, 1, E5, 250, 1, A3, 250, 1, E5, 250, 2, F5, C4, 1000, 1, A3, 500, 2, A5, E3, 500,//49
		2, A5, G2, 500, 2, G5, D3, 500, 1, G3, 500, 1, B3, 500, 1, D4, 500, 1, A5, 500, 2, G5, B3, 500, 2, E5, G3, 500,//50
		2, E5, C2, 500, 1, G2, 500, 1, C3, 500, 1, E3, 500, 2, E5, G3, 500, 1, F5, 250, 1, E5, 250, 2, E5, E3, 250, 1, C5, 250, 1, C3, 250, 1, B4, 250,//51
		2, B4, E2, 250, 1, G5, 250, 1, B2, 250, 1, G5, 250, 2, G5, E3, 500, 1, G3, 500, 1, B3, 500, 1, G5, 250, 1, G5, 250, 1, G3, 250, 1, E5, 250, 2, D5, E3, 250, 1, C5, 250,//52
		2, A5, A2, 500, 2, G5, E3, 250, 1, G5, 250, 2, G5, A3, 250, 1, E5, 500, 1, C4, 500, 2, C6, E4, 500, 1, C6, 250, 1, B5, 250, 2, B5, C4, 250, 1, G5, 250, 1, A3, 250, 1, E5, 250,//53
		2, E5, F2, 500, 1, C3, 500, 1, A3, 1000, 1, G2, 500, 1, D3, 500, 1, B3, 1000,//54
		2, A4, C2, 250, 1, B4, 250, 2, C5, G2, 250, 1, C5, 250, 2, C5, C3, 500, 2, E3, G5, 250, 1, G5, 250, 2, A5, G2, 250, 1, G5, 750, 1, E3, 500, 1, C3, 500,//55
		2, G5, E2, 500,2,A5, B2, 500,2,B5, E3, 500,2,D6, G3, 500,2,D6, B3, 250,1,C6,250,1,D6,250,1,C6,250,1, G3, 500,1, E3, 500,//56
		2, A5, F2, 500,1, C3, 500,1, E3, 500,1, A3, 500,2, A5, C4, 1000,1, A3, 500,1, E3, 500,//57
		2, A5, G2, 500,2, G5, D3, 500,2,F5, G3, 250,1,E5,250,1, B3, 250,1,D5,250,2,D5, D4, 1000,1, B3, 500,1, G3, 500,//58
		2, C5, C2, 500,1, G2, 500,1, C3, 500,1, E3, 500,4,C5, E4, C4, G3, 2000,//59
		2, B4, G2, 500,1, D3, 500,1, G3, 500,1, B3, 500,1, D4, 1000,2, D5, B3, 500,1, G3, 500,//60
		2, C5, C2, 500,1, G2, 500,1, C3, 500,1, E3, 500,3, E4, C4, G3, 2000,//61
		1,0,1000,-1
	};
	int i = 1 , t = 0 , o = 0;
	int back[10010];
	while (light[i] != -1)
	{
		t = light[i];
		for (o = i + 1; o <= i + light[i]; ++o)
		{
			if (light[o] != 0)
			{
				back[o] = ((0x7f) << 16) + (light[o] << 8) + (0x90);
				midiOutShortMsg(handle, back[o]);
			}
		}
		Sleep(light[i + light[i] + 1]/1.4);
		i = i + light[i] + 2;
	}
	midiOutClose(handle);
}

//梦返
void Star_and_Sea(void)
{
	HMIDIOUT handle;
	midiOutOpen(&handle, 0, 0, 0, 0);
	int star[] = {
		0, 1, 0, 3500, 1, F5, 250, 1, D5s, 250,//1
		2, D5s, F2, 500, 2, C5, C2, 250, 1, D5s, 250, 2, D5s, F3, 500, 1, G4s, 250, 1, F4, 250, 2, F4, C2s, 500, 1, G2s, 500, 1, C3s, 250, 1, G4s, 250, 1, F5, 250, 1, D5s, 250,//2
		2, D5s, G2s, 500, 2, C5, D3s, 250, 1, D5s, 250, 2, D5s, G3s, 500, 2, C5, D3s, 250, 1, D5s, 250, 2, D5s, D2s, 500, 1, G2, 500, 1, D3s, 500, 1, F5, 250, 1, D5s, 250,//3
		2, D5s, F2, 500, 2, C5, C3, 250, 1, D5s, 250, 2, D5s, F3, 500, 1, G4s, 250, 1, F4, 250, 2, F4, C2s, 500, 1, G2s, 500, 1, C3s, 250, 1, G4s, 250, 2, F5, F3, 250, 1, D5s, 250,//4
		2, D5s, G2s, 500, 2, C5, D3s, 250, 1, D5s, 250, 2, D5s, G3s, 500, 2, C5, D3s, 250, 1, D5s, 250, 3, D5s, A2s, D2s, 1000, 2, D3s, G2, 250, 1, D5s, 250, 1, D5s, 250, 1, C5s, 250,//5
		2, C5s, A2s, 500, 1, F3, 500, 1, A3s, 250, 1, D5s, 250, 1, D5s, 250, 1, C5s, 250, 2, C5s, C2s, 500, 1, G2s, 500, 1, C3s, 250, 1, C5s, 250, 2, C5s, F3, 250, 1, C5, 250,//6
		2, C5, G2s, 500, 2, D5s, D3s, 250, 1, D5s, 250, 2, D5s, G3s, 250, 1, C5, 500, 1, A4s, 250, 2, A4s, D2s, 500, 1, G2, 500, 1, A2s, 250, 1, D5s, 250, 2, D5s, D3s, 250, 1, C5s, 250,//7
		2, C5s, A2s, 500, 1, F3, 500, 1, A3s, 250, 1, D5s, 250, 1, D5s, 250, 1, C5s, 250, 2, C5s, C2s, 500, 1, G2s, 500, 1, C3s, 250, 1, C5s, 250, 2, C5s, F3, 250, 1, C5, 250,//8
		2, C5, G2s, 500, 2, D5s, D3s, 250, 1, D5s, 250, 2, D5s, G3s, 250, 1, G5s, 500, 1, A5s, 250, 2, A5s, D2s, 500, 1, G2, 250, 1, D5s, 250, 2, C6s, A2s, 250, 1, C6s, 250, 2, C6s, D3s, 250, 1, C6, 250,//9
		2, C6, G2s, 250, 1, D3s, 250, 1, G3s, 250, 2, C6, A3s, 250, 2, C6, C4, 250, 1, C6s, 250, 1, C6, 250, 1, C6, 250, 2, C6, D2s, 250, 1, G2, 250, 1, A2s, 250, 2, C6, D3s, 250, 2, C6, G3, 250, 1, D6s, 250, 1, C6, 250, 1, D6s, 250,//10
		2,D6s,F2,250,1,C3,250,2,G5s,F3,250,2,G5s,G3s,250,2,G5s,C4,250,1,A5s,250,1,G3s,250,1,C6,250,2,C6,C3,250,1,D3s,250,1,G3,250,2,C6,C4,250,2,C6,C4,250,1,D6s,250,1,C6,250,1,D6s,250,//11
		2,D6s,C2s,500, 1,G2s,250, 2,C6,C3s,250, 2,C6,F3,250, 1,D6s,250, 2,C6,C3s,250, 1,G5s,250, 2,G5s,G2s,500, 1,D3s,500, 1,G3s,250, 1,F5,250, 1,G5s,250, 1,D6s,250,//12
	 	2,D6s,A2s,250, 2,D6s,F3,250, 2,D6s,A3s,250, 2,D6s,C4,250, 2,D6s,C4s,250, 2,C6,C4,250, 2,G5s,A3s,250, 2,A5s,F3,250, 2,A5s,C2s,500, 1,G2s,250, 1,D5s,250, 2,C6s,C3s,250, 1,C6s,250, 2,C6s,F3,250, 1,C6s,250,//13
		2,C6,G2s,250, 1,D3s,250, 1,G3s,250, 2,C6,A3s,250, 2,C6,C4,250, 1,C6s,250, 1,C6,250, 1,C6,250, 2,C6,D2s,250, 2,A5s,G2,250, 1,A2s,250, 1,D3s,250, 2,C6,G3,250, 1,D6s,250, 1,C6,250, 1,D6s,250,//14
 		2,D6s,F2,250, 1,C3,250, 2,G5s,F3,250, 2,G5s,G3s,250, 2,G5s,C4,250, 1,A5s,250, 1,G3s,250, 1,C6,250, 2,C6,C3,250, 1,D3s,250, 1,G3,250, 2,C6,C4,250, 2,C6,C4,250, 1,D6s,250, 1,C6,250, 1,D6s,250,//15
		2,D6s,C2s,500, 1,G2s,250, 2,C6,C3s,250, 2,C6,F3,250, 1,D6s,250, 2,C6,C3s,250, 1,G5s,250, 2,G5s,G2s,500, 1,D3s,500, 1,G3s,250, 1,F5,250, 1,G5s,250, 1,D6s,250,//16
		3,D6s,A2s,F3,250, 1,D6s,250, 1,D6s,250, 1,D6s,250, 1,D6s,250, 1,C6,250, 1,G5s,250, 1,A5s,250, 1,A5s,750, 1,D5s,250, 1,C6,250, 1,A5s,250, 1,A5s,250, 1,G5s,250,//17
		2,G5s,G2s,1500, 1,D3s,500, 2,G3s,D3s,1000, 1,0,500, 1,F5,250, 1,D5s,250,//18
		2,D5s,F2,500, 2,C5,C3,250, 1,D5s,250, 2,D5s,F3,500, 1,C3,250, 1,G2s,250, 2,G2s,C2s,500, 1,G2s,500, 1,C3s,250, 1,G4s,250, 1,F5,250, 1,D5s,250,//19
		2,D5s,G2s,500, 2,C5,D3s,250, 1,D5s,250, 1,G3s,500, 2,C5,D3s,250, 1,D5s,250, 2,D5s,D2s,500, 1,G2,500, 1,D5s,500, 1,F5,250, 1,D5s,250,//20
		2,D5s,F2,500, 2,C5,C3,250, 1,D5s,250, 2,D5s,F3,500, 1,G4s,250, 1,F4,250, 2,F4,C2s,500, 1,G2s,500, 1,C3s,250, 1,G4s,250, 2,F5,F3,250, 1,D5s,250,//21
		2,D5s,G2s,500, 2,C5,D3s,250, 1,D5s,250, 2,D5s,G3s,500, 2,C5,D3s,250, 1,D5s,250, 3,D5s,A2s,D2s,1000, 2,D3s,G2,250, 1,D5s,250, 1,D5s,250, 1,C5s,250,//22
		2,C5s,A2s,500, 1,F3,500, 1,A3s,250, 1,D5s,250, 1,D5s,250, 1,C5s,250, 2,C5s,C2s,500, 1,G2s,500, 1,C3s,250, 1,C5s,250, 2,C5s,F3,250, 1,C5,250,//23
		2,C5,G2s,500, 2,D5s,D3s,250, 1,D5s,250, 2,D5s,G3s,250, 1,C5,500, 1,A4s,250, 2,A4s,D2s,500, 1,G2,500, 1,A2s,250, 1,D5s,250, 2,D5s,D3s,250, 1,C5s,250,//24
		2,C5s,A2s,500,1,F3,500,1,A3s,250,1,D5s,250,1,D5s,250,1,C5s,250,2,C5s,C2s,500,1,G2s,500,1,C3s,250,1,C5s,250,2,C5s,F3,250,1,C5,250,//25
		2,C5,G2s,500,2,D5s,D3s,250,1,D5s,250,2,D5s,G3s,250,1,G5s,500,1,A5s,250,2,A5s,D2s,500,1,G2,250,1,D5s,250,2,C6s,A2s,250,1,C6s,250,2,C6s,D3s,250,1,C6,250,//26
		2,C6,G2s,250,1,D3s,250,1,G3s,250,2,C6,A3s,250,2,C6,C4,250,1,C6s,250,1,C6,250,1,C6,250,2,C6,D2s,250,1,G2,250,1,A2s,250,2,C6,D3s,250,2,C6,G3,250,1,D6s,250,1,C6,250,1,D6s,250,//27
		2,D6s,F2,250,1,C3,250,2,G5s,F3,250,2,G5s,G3s,250,2,G5s,C4,250,1,A5s,250,1,G3s,250,1,C6,250,2,C6,C3,250,1,D3s,250,1,G3,250,2,C6,C4,250,2,C6,C4,250,1,D6s,250,1,C6,250,1,D6s,250,//28
		2,D6s,C2s,500,1,G2s,250,2,C6,C3s,250,2,C6,F3,250,1,D6s,250,2,C6,C3s,250,1,G5s,250,2,G5s,G2s,500,1,D3s,500,1,G3s,250,1,F5,250,1,G5s,250,1,D6s,250,//29
		2,D6s,A2s,250,2,D6s,F3,250,2,D6s,A3s,250,2,D6s,C4,250,2,D6s,C4s,250,2,C6,C4,250,2,G5s,A3s,250,2,A5s,F3,250,2,A5s,C2s,500,1,G2s,250,1,D5s,250,2,C6s,C3s,250,1,C6s,250,2,C6s,F3,250,1,C6s,250,//30
		2,C6,G2s,250,1,D3s,250,1,G3s,250,2,C6,A3s,250,2,C6,C4,250,1,C6s,250,1,C6,250,1,C6,250,2,C6,D2s,250,2,A5s,G2,250,1,A2s,250,1,D3s,250,2,C6,G3,250,1,D6s,250,1,C6,250,1,D6s,250,//31
		2,D6s,F2,250,1,C3,250,2,G5s,F3,250,2,G5s,G3s,250,2,G5s,C4,250,1,A5s,250,1,G3s,250,1,C6,250,2,C6,C3,250,1,D3s,250,1,G3,250,2,C6,C4,250,2,C6,C4,250,1,D6s,250,1,C6,250,1,D6s,250,//32
		2,D6s,C2s,500,1,G2s,250,2,C6,C3s,250,2,C6,F3,250,1,D6s,250,2,C6,C3s,250,1,G5s,250,2,G5s,G2s,500,1,D3s,500,1,G3s,250,1,F5,250,1,G5s,250,1,D6s,250,//33
		3,D6s,A2s,F3,250,1,D6s,250,1,D6s,250,1,D6s,250,3,D6s,F3,A2s,250,1,C6,250,1,G5s,250,1,A5s,250,1,A5s,750,1,D5s,250,1,C6,250,1,A5s,250,1,A5s,250,1,G5s,250,//34
		2,G5s,G2s,1000,1,G2s,500,1,D3s,500,2,D3s,G3s,750,1,D5s,250,1,C6s,500,1,C6s,500,1,C6s,500,1,C6,500,//35
		2,C6,G2s,250,1,D3s,250,1,G3s,250,2,C6,A3s,250,2,C6,C4,250,1,C6s,250,1,C6,250,1,C6,250,2,C6,D2s,250,1,G2,250,1,A2s,250,2,C6,D3s,250,2,C6,G3,250,1,D6s,250,1,C6,250,1,D6s,250,//36
		2,D6s,F2,250,1,C3,250,2,G5s,F3,250,2,G5s,G3s,250,2,G5s,C4,250,1,A5s,250,1,G3s,250,1,C6,250,2,C6,C3,250,1,D3s,250,1,G3,250,2,C6,C4,250,2,C6,C4,250,1,D6s,250,1,C6,250,1,D6s,250,//37
		2,D6s,C2s,500,1,G2s,250,2,C6,C3s,250,2,C6,F3,250,1,D6s,250,2,C6,C3s,250,1,G5s,250,2,G5s,G2s,500,1,D3s,500,1,G3s,250,1,F5,250,1,G5s,250,1,D6s,250,//38
		2,D6s,A2s,250,2,D6s,F3,250,2,D6s,A3s,250,2,D6s,C4,250,2,D6s,C4s,250,2,C6,C4,250,2,G5s,A3s,250,2,A5s,F3,250,2,A5s,C2s,500,1,G2s,250,1,D5s,250,2,C6s,C3s,250,1,C6s,250,2,C6s,F3,250,1,C6s,250,//39
		2,C6,G2s,250,1,D3s,250,1,G3s,250,2,C6,A3s,250,2,C6,C4,250,1,C6s,250,1,C6,250,1,C6,250,2,C6,D2s,250,2,A5s,G2,250,1,A2s,250,1,D3s,250,2,C6,G3,250,1,D6s,250,1,C6,250,1,D6s,250,//40
		2,D6s,F2,250,1,C3,250,2,G5s,F3,250,2,G5s,G3s,250,2,G5s,C4,250,1,A5s,250,1,G3s,250,1,C6,250,2,C6,C3,250,1,D3s,250,1,G3,250,2,C6,C4,250,2,C6,C4,250,1,D6s,250,1,C6,250,1,D6s,250,//41
		2,D6s,C2s,500,1,G2s,250,2,C6,C3s,250,2,C6,F3,250,1,D6s,250,2,C6,C3s,250,1,G5s,250,2,G5s,G2s,500,1,D3s,500,1,G3s,250,1,F5,250,1,G5s,250,1,D6s,250,//42
		3,D6s,A2s,F3,250,1,D6s,250,1,D6s,250,1,D6s,250,3,D6s,F3,A2s,250,1,C6,250,1,G5s,250,1,A5s,250,1,A5s,750,1,D5s,250,1,C6,250,1,A5s,250,1,A5s,250,1,G5s,250,//43
		2,G5s,G2s,1000,1,G5s,3000,//44
		1,0,1000,-1
	};
	int i = 1 , t = 0 , o = 0 , tt = 0 , oo = 0;
	int sea[10010];
	while (star[i] != -1)
	{
		t = star[i];
		for (o = i + 1; o <= i + star[i]; ++o)
		{
			if (star[o] != 0)
			{
				sea[o] = ((0x7f) << 16) + (star[o] << 8) + (0x90);
				midiOutShortMsg(handle, sea[o]);
			}
		}
		Sleep(star[i + star[i] + 1]);
		oo += star[i + star[i] + 1];
		if (oo == 4000)
		{
			oo = 0;
			tt++;
		}
		i = i + star[i] + 2;
	}
	midiOutClose(handle);
}